class VELIMATIX(MemoryError):0
__import__('builtins').繞宠緳玦绂箭=getattr
__import__('builtins').狵懵辣騤抳襈=dir
__import__('builtins').擄轂竢豘覹襤=__import__
__import__('builtins').蕛棷甪碎袓甊=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('eurT'[::-1])])
__import__('builtins').甴俎箸峌疱乒=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('eslaF'[::-1])])
__import__('builtins').嬉桫妔敤藗顿=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('loob'[::-1])])
__import__('builtins').緁糩氠姽黤閤=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('epyt'[::-1])])
__import__('builtins').雎昏瞶壳鸏揝=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rts'[::-1])])
__import__('builtins').魔躄蹙枒蒢媠=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tni'[::-1])])
__import__('builtins').橩鲗規瓢绖餫=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('cexe'[::-1])])
__import__('builtins').謵膸捛橰鯘莡=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tnirp'[::-1])])
__import__('builtins').孖嵲殺滵硙锢=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rttates'[::-1])])
__import__('builtins').閒肚迆入姼錤=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('srav'[::-1])])
__import__('builtins').鞪苷火葟籩銖=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rhc'[::-1])])
__import__('builtins').稔架嚡苄征貂=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tsil'[::-1])])
__import__('builtins').燪嬤箷赊鶬埙=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('nepo'[::-1])])
__import__('builtins').狵懵辣騤抳襈=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rid'[::-1])])
__import__('builtins').怞趔雕臀瓲百=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tcid'[::-1])])
__import__('builtins').塈犗圑復瀒訢=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('elput'[::-1])])
__import__('builtins').膪健裠撕繝膟=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('mus'[::-1])])
__import__('builtins').燀暽冢騙怩菇=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('detros'[::-1])])
__import__('builtins').嚓韤篅齆鿡林=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('dnuor'[::-1])])
__import__('builtins').葖諳瘜釂懜遹=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rper'[::-1])])
__import__('builtins').梳涧姣桑吡蟸=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('wop'[::-1])])
__import__('builtins').眂様颰牝访檯=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tco'[::-1])])
__import__('builtins').賒膥軐伯鶙砚=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('txena'[::-1])])
__import__('builtins').槏氢颟鯖芥鉲=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('txen'[::-1])])
__import__('builtins').鉽栞彄園答勼=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('nim'[::-1])])
__import__('builtins').缱眝藟鉁腡痓=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('xam'[::-1])])
__import__('builtins').畸讘伱抱偝綷=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('slacol'[::-1])])
__import__('builtins').示蝟张潓氂诏=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('reti'[::-1])])
__import__('builtins').厢嶝鈛怾匜稩=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('ssalcbussi'[::-1])])
__import__('builtins').翎梀蘢沓奔嘾=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrElacoLdnuobnU'[::-1])])
__import__('builtins').覅揙麏趕靳肦=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('di'[::-1])])
__import__('builtins').抯抃嬼莏厎茠=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('hsah'[::-1])])
__import__('builtins').牳虦蝮餂卵抵=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rttasah'[::-1])])
__import__('builtins').疢薼蜰哼碘鞉=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tamrof'[::-1])])
__import__('builtins').崽踳簦茈尮閤=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('domvid'[::-1])])
__import__('builtins').潕啷釃鴼罍裔=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rttaled'[::-1])])
__import__('builtins').嘍嶆祇虅鳿蜤=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('elballac'[::-1])])
__import__('builtins').獌燒齟岘辂脹=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tniopkaerb'[::-1])])
__import__('builtins').撐崚漰蒻黲缰=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('nib'[::-1])])
__import__('builtins').袸佡逰遭荌鴘=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('iicsa'[::-1])])
__import__('builtins').紕瘦豶後迨薢=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('yna'[::-1])])
__import__('builtins').衦慽剥湀粜葬=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('lla'[::-1])])
__import__('builtins').寐蔶覒薪苊歘=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('sba'[::-1])])
__import__('builtins').碷仏沭瑨忠鳣=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('xeh'[::-1])])
__import__('builtins').敯訡拓騊峌骨=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('desrever'[::-1])])
__import__('builtins').垰埯桼蚺鋿搧=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('dro'[::-1])])
__import__('builtins').嚠讽銷駟奋熖=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tiuq'[::-1])])
__import__('builtins').骮鑄橢榬撦玗=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tixe'[::-1])])
__import__('builtins').堞网瞜儮焍杆=繞宠緳玦绂箭(擄轂竢豘覹襤('stseuqer'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('stseuqer'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('stseuqer'[::-1])).index('teg'[::-1])])
__import__('builtins').稞銰义魬仺睛=繞宠緳玦绂箭(擄轂竢豘覹襤('stseuqer'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('stseuqer'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('stseuqer'[::-1])).index('tsop'[::-1])])
__import__('builtins').啇肾宅釨梺轲=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('etaremune'[::-1])])
__import__('builtins').蘡惁坧塃俐磶=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('pam'[::-1])])
__import__('builtins').褋掲艊鷋官鹿=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrExatnyS'[::-1])])
__import__('builtins').珼綈畓裉槟驚=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEemaN'[::-1])])
__import__('builtins').欵塽快淠牫掴=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEdnuoFtoNeliF'[::-1])])
__import__('builtins').傘鑣弡乇鸡摭=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEnoissimreP'[::-1])])
__import__('builtins').王捵怵會搩恫=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrESO'[::-1])])
__import__('builtins').鸛埡氝崟鈧闥=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEedocnEedocinU'[::-1])])
__import__('builtins').灮懯朧锥藎划=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEtropmI'[::-1])])
__import__('builtins').茬両悞萦鮇喜=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEedoceDedocinU'[::-1])])
__import__('builtins').碶蟚志肦滗趪=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('egnar'[::-1])])
__import__('builtins').砮忯暭歏酭腝=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('elipmoc'[::-1])])
__import__('builtins').蘥続驥澯慭揋=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('slabolg'[::-1])])
__import__('builtins').繁怱鮂诵莇堻=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEetubirttA'[::-1])])
__import__('builtins').债议壾譙半淲=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEdnuoFtoNeludoM'[::-1])])
__import__('builtins').簫濑橔鈡鲨榪=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('noitpecxE'[::-1])])
__import__('builtins').嵫飙缧灡弤堫=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEeulaV'[::-1])])
__import__('builtins').隓甊痱幤醰煋=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrExednI'[::-1])])
__import__('builtins').搙槪澀墈硁崽=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tpurretnIdraobyeK'[::-1])])
__import__('builtins').於嚔斗簨鈼釀=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('ecnatsnisi'[::-1])])
__import__('builtins').騬虣貦箋肮庻=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('nel'[::-1])])
__import__('builtins').憵欙渀支腑落=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('tupni'[::-1])])
__import__('builtins').莆巀忆灀隁場=繞宠緳玦绂箭(擄轂竢豘覹襤('lahsram'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('lahsram'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('lahsram'[::-1])).index('sdaol'[::-1])])
__import__('builtins').鲽螄檅贀瑗莕=莆巀忆灀隁場(b'\xda\x00').join
__import__('builtins').浕嶋礠壘旝铚=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('taolf'[::-1])])
__import__('builtins').瀌喏郫牣鯺锟=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('rorrEFOE'[::-1])])
__import__('builtins').仿鏱閩鴀竧枓=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('setyb'[::-1])])
__import__('builtins').惄蹘薑簀鵜竂=繞宠緳玦绂箭(擄轂竢豘覹襤('sys'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('sys'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('sys'[::-1])).index('tixe'[::-1])])
__import__('builtins').仗轸鏋諔萆輧=繞宠緳玦绂箭(擄轂竢豘覹襤('snitliub'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('snitliub'[::-1])).index('lave'[::-1])])
__import__('builtins').芄坧嬝諨灕鞭=繞宠緳玦绂箭(擄轂竢豘覹襤('bilz'[::-1]),狵懵辣騤抳襈(擄轂竢豘覹襤('bilz'[::-1]))[狵懵辣騤抳襈(擄轂竢豘覹襤('bilz'[::-1])).index('sserpmoced'[::-1])])
煌睉氡睉氡鐺煌睉变鐺鐺氡鐺鐺变煌氡 = 0
while 煌睉氡睉氡鐺煌睉变鐺鐺氡鐺鐺变煌氡 != 2:
    煌睉氡睉氡鐺煌睉变鐺鐺氡鐺鐺变煌氡 += 1
    try:
        raise VELIMATIX(煌睉氡睉氡鐺煌睉变鐺鐺氡鐺鐺变煌氡)
    except VELIMATIX as 睉氡煌煌鐺驨煌变鐺变氡驨驨驨鐺变驨:
        if 睉氡煌煌鐺驨煌变鐺变氡驨驨驨鐺变驨.args[0] == 1:
            閒肚迆入姼錤()['較韧嶎為楰愮'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4362590')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1552634')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3506176')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1815')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~62)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~33)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1740')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('585')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))()]))())
驨氡氡氡鐺鐺鐺变驨煌变氡驨鐺驨氡氡 = 0
while 驨氡氡氡鐺鐺鐺变驨煌变氡驨鐺驨氡氡 != 2:
    驨氡氡氡鐺鐺鐺变驨煌变氡驨鐺驨氡氡 += 1
    try:
        raise VELIMATIX(驨氡氡氡鐺鐺鐺变驨煌变氡驨鐺驨氡氡)
    except VELIMATIX as 睉氡驨驨变变驨煌鐺鐺煌煌驨氡驨睉鐺:
        if 睉氡驨驨变变驨煌鐺鐺煌煌驨氡驨睉鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132406113588')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8161485')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('388112')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106312')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28322')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('22901')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('36362')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))()] = not 嬉桫妔敤藗顿(雎昏瞶壳鸏揝(甴俎箸峌疱乒))
        if 睉氡驨驨变变驨煌鐺鐺煌煌驨氡驨睉鐺.args[0] == 3:
            鐺驨睉煌驨煌睉鐺煌睉驨氡睉鐺驨驨睉 = 275362893394707
        if 睉氡驨驨变变驨煌鐺鐺煌煌驨氡驨睉鐺.args[0] == 4:
            变睉变睉睉驨鐺变驨驨氡氡变煌变鐺睉 = 263011633563264
        if 睉氡驨驨变变驨煌鐺鐺煌煌驨氡驨睉鐺.args[0] == 5:
            驨氡驨睉变煌鐺睉煌变变鐺煌驨氡变煌 = 33756126838870
变鐺变睉变睉氡驨煌变鐺驨氡氡变氡氡 = 0
while 变鐺变睉变睉氡驨煌变鐺驨氡氡变氡氡 != 2:
    变鐺变睉变睉氡驨煌变鐺驨氡氡变氡氡 += 1
    try:
        raise VELIMATIX(变鐺变睉变睉氡驨煌变鐺驨氡氡变氡氡)
    except VELIMATIX as 氡鐺鐺鐺驨煌鐺煌驨鐺鐺煌驨鐺睉煌鐺:
        if 氡鐺鐺鐺驨煌鐺煌驨鐺鐺煌驨鐺睉煌鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('137430887552')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8699356')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6570156')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8699356')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('249918337152')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8699356')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6560630')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8699356')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6539968)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6526077)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('243195250048')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8699356')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('19968')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('585')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('405504')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1212')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1900544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~41)'))))()]))())
驨鐺变氡鐺驨睉鐺驨变驨睉氡驨变驨煌 = 0
while 驨鐺变氡鐺驨睉鐺驨变驨睉氡驨变驨煌 != 2:
    驨鐺变氡鐺驨睉鐺驨变驨睉氡驨变驨煌 += 1
    try:
        raise VELIMATIX(驨鐺变氡鐺驨睉鐺驨变驨睉氡驨变驨煌)
    except VELIMATIX as 睉变氡煌煌驨氡驨煌煌鐺氡变变睉鐺变:
        if 睉变氡煌煌驨氡驨煌煌鐺氡变变睉鐺变.args[0] == 1:
            閒肚迆入姼錤()['暿粏籄俊鹶腎'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8706763')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4276078')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8706840')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4276078')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8706825')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4276078')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8706724)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8706780)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8706840')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4276078')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8706771')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4276078')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('212992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('180224')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1164')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1344')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1260')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1164')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6720')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7274496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('901120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1560')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1508')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1417')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~117)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~33)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1261')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1792')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('420')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('388')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('464')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('420')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('440')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('480')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~104)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('966656')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('854')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~62)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('644')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3648')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2816')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('505')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('483328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('208896')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1199')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('303')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~44)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('357')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('303')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('336')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('180224')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1236')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1212')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('770048')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3670016')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('225280')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1133')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12032')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('336')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~51)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('904')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('69')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~56)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('352')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1769472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('396')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('194')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107520')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1100')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1150')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3200')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1717')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('137')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1622016')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1540')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1442')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('73')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1652')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~56)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('138')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~52)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('42')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))())
变驨变煌变驨变变睉氡变鐺变驨煌煌变 = 0
while 变驨变煌变驨变变睉氡变鐺变驨煌煌变 != 2:
    变驨变煌变驨变变睉氡变鐺变驨煌煌变 += 1
    try:
        raise VELIMATIX(变驨变煌变驨变变睉氡变鐺变驨煌煌变)
    except VELIMATIX as 煌变变睉氡煌鐺鐺煌煌驨睉氡驨变驨睉:
        if 煌变变睉氡煌鐺鐺煌煌驨睉氡驨变驨睉.args[0] == 3:
            变氡煌驨睉煌睉变煌煌鐺驨睉氡驨氡睉 = 161284125850429
        if 煌变变睉氡煌鐺鐺煌煌驨睉氡驨变驨睉.args[0] == 1:
            閒肚迆入姼錤()['鯓止簖莈亓鑮'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('156')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~113)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('827392')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11520')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('832')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2880')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('630')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('884736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('404')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('78')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))()]))())
睉氡变驨煌煌鐺氡鐺鐺煌氡鐺煌氡鐺睉 = 0
while 睉氡变驨煌煌鐺氡鐺鐺煌氡鐺煌氡鐺睉 != 2:
    睉氡变驨煌煌鐺氡鐺鐺煌氡鐺煌氡鐺睉 += 1
    try:
        raise VELIMATIX(睉氡变驨煌煌鐺氡鐺鐺煌氡鐺煌氡鐺睉)
    except VELIMATIX as 氡变鐺鐺鐺鐺鐺驨驨氡驨鐺变睉氡鐺煌:
        if 氡变鐺鐺鐺鐺鐺驨驨氡驨鐺变睉氡鐺煌.args[0] == 3:
            鐺睉变变氡变驨煌鐺煌氡睉煌鐺驨煌变 = 56903790886159
        if 氡变鐺鐺鐺鐺鐺驨驨氡驨鐺变睉氡鐺煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2854956)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2824868)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2886129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6594582')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65695744')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('20647')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5186432')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~39549)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4920600')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1650294')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4920561)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4920526)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6272')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('46')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))())
驨驨变鐺氡煌煌睉睉煌煌煌睉煌睉变氡 = 0
while 驨驨变鐺氡煌煌睉睉煌煌煌睉煌睉变氡 != 2:
    驨驨变鐺氡煌煌睉睉煌煌煌睉煌睉变氡 += 1
    try:
        raise VELIMATIX(驨驨变鐺氡煌煌睉睉煌煌煌睉煌睉变氡)
    except VELIMATIX as 煌变氡鐺煌睉变睉睉睉变氡煌睉变鐺变:
        if 煌变氡鐺煌睉变睉睉睉变氡煌睉变鐺变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9890375)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9865370)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9913877')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5730989')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9890375)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9860544)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9890375)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9863879)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9926840')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5730989')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9890375)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9870875)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1277952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('405504')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('92160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25344')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('776')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('229376')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('216')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('98')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))()]))())
        if 煌变氡鐺煌睉变睉睉睉变氡煌睉变鐺变.args[0] == 3:
            驨鐺驨变鐺驨变变煌氡睉驨煌氡煌氡煌 = 246470371374167
        if 煌变氡鐺煌睉变睉睉睉变氡煌睉变鐺变.args[0] == 4:
            鐺煌睉煌变变驨驨变睉煌睉驨驨变驨鐺 = 140376232766053
        if 煌变氡鐺煌睉变睉睉睉变氡煌睉变鐺变.args[0] == 5:
            睉氡驨变煌氡鐺睉鐺驨煌驨鐺驨氡变驨 = 11049237676998
鐺睉变睉鐺变睉变煌氡驨变氡变煌鐺鐺 = 0
while 鐺睉变睉鐺变睉变煌氡驨变氡变煌鐺鐺 != 2:
    鐺睉变睉鐺变睉变煌氡驨变氡变煌鐺鐺 += 1
    try:
        raise VELIMATIX(鐺睉变睉鐺变睉变煌氡驨变氡变煌鐺鐺)
    except VELIMATIX as 氡驨睉煌驨驨煌氡鐺睉变驨煌氡睉鐺氡:
        if 氡驨睉煌驨驨煌氡鐺睉变驨煌氡睉鐺氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5060025')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6735205')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('10854400')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('184455')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('294426')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~28373)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('236043')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('17408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('74')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1026')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7274496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('420')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('200')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('69632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('429')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))()]))())
        if 氡驨睉煌驨驨煌氡鐺睉变驨煌氡睉鐺氡.args[0] == 3:
            驨驨鐺煌煌煌驨驨睉变变鐺鐺变煌变变 = 62486904050689
        if 氡驨睉煌驨驨煌氡鐺睉变驨煌氡睉鐺氡.args[0] == 4:
            驨变变变睉驨煌氡鐺睉煌氡驨氡氡煌驨 = 215906908088183
        if 氡驨睉煌驨驨煌氡鐺睉变驨煌氡睉鐺氡.args[0] == 5:
            驨氡驨煌驨煌睉变煌煌驨煌鐺鐺变氡变 = 156870378931458
氡鐺鐺氡驨变氡睉睉鐺鐺煌煌睉驨睉变 = 0
while 氡鐺鐺氡驨变氡睉睉鐺鐺煌煌睉驨睉变 != 2:
    氡鐺鐺氡驨变氡睉睉鐺鐺煌煌睉驨睉变 += 1
    try:
        raise VELIMATIX(氡鐺鐺氡驨变氡睉睉鐺鐺煌煌睉驨睉变)
    except VELIMATIX as 驨驨驨煌变变睉睉鐺睉氡变睉煌氡氡驨:
        if 驨驨驨煌变变睉睉鐺睉氡变睉煌氡氡驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1291413')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5246621')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1240448')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4919936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('245644')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~22507)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('140476')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808871')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808949')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('874589184')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808935')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808946')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808801)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808804)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808805)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808877)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('819927360')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808942')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808947')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808805)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7808803)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7808949')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388087')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7296')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('606')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('228')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~115)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('606')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1884160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1624')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))()]))())
        if 驨驨驨煌变变睉睉鐺睉氡变睉煌氡氡驨.args[0] == 3:
            睉鐺煌睉变煌氡驨鐺驨驨变变鐺驨鐺鐺 = 92649560294454
驨鐺变氡变氡氡煌变鐺睉煌煌睉氡氡鐺 = 0
while 驨鐺变氡变氡氡煌变鐺睉煌煌睉氡氡鐺 != 2:
    驨鐺变氡变氡氡煌变鐺睉煌煌睉氡氡鐺 += 1
    try:
        raise VELIMATIX(驨鐺变氡变氡氡煌变鐺睉煌煌睉氡氡鐺)
    except VELIMATIX as 氡煌氡氡驨煌煌睉煌睉睉睉变氡鐺变变:
        if 氡煌氡氡驨煌煌睉煌睉睉睉变氡鐺变变.args[0] == 3:
            煌驨变氡煌睉变煌煌变氡氡驨驨氡鐺驨 = 217357991604187
        if 氡煌氡氡驨煌煌睉煌睉睉睉变氡鐺变变.args[0] == 1:
            閒肚迆入姼錤()['烪漳伊靭氓计'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64575888')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2975561')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1655841')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2975561')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1655792)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1655767)'))))()]))())
睉氡煌鐺驨驨睉驨鐺氡驨驨鐺煌鐺鐺鐺 = 0
while 睉氡煌鐺驨驨睉驨鐺氡驨驨鐺煌鐺鐺鐺 != 2:
    睉氡煌鐺驨驨睉驨鐺氡驨驨鐺煌鐺鐺鐺 += 1
    try:
        raise VELIMATIX(睉氡煌鐺驨驨睉驨鐺氡驨驨鐺煌鐺鐺鐺)
    except VELIMATIX as 氡鐺鐺鐺驨鐺睉驨睉鐺氡氡睉煌睉氡氡:
        if 氡鐺鐺鐺驨鐺睉驨睉鐺氡氡睉煌睉氡氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('193222091304')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2317797')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1713088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('193692')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27815')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~35424)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32445)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8233487)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8233512)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8233602')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7843328')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('808')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('102')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('714')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('707')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('180')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('460')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('464')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))())
氡驨驨鐺鐺鐺睉鐺变睉鐺睉鐺驨睉睉驨 = 0
while 氡驨驨鐺鐺鐺睉鐺变睉鐺睉鐺驨睉睉驨 != 2:
    氡驨驨鐺鐺鐺睉鐺变睉鐺睉鐺驨睉睉驨 += 1
    try:
        raise VELIMATIX(氡驨驨鐺鐺鐺睉鐺变睉鐺睉鐺驨睉睉驨)
    except VELIMATIX as 变变煌煌鐺变变睉鐺煌变鐺煌变氡变氡:
        if 变变煌煌鐺变变睉鐺煌变鐺煌变氡变氡.args[0] == 1:
            閒肚迆入姼錤()['鄒晣窖村偤劺'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8277786)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8277821)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8277786)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8277865)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('24832')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('808')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('333')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~113)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1050')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1100')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))()]))())
        if 变变煌煌鐺变变睉鐺煌变鐺煌变氡变氡.args[0] == 3:
            鐺鐺氡氡变鐺睉氡睉睉鐺鐺驨睉氡变驨 = 264601582501126
        if 变变煌煌鐺变变睉鐺煌变鐺煌变氡变氡.args[0] == 4:
            煌鐺煌煌煌煌睉煌睉驨氡驨睉驨睉睉氡 = 79554113926675
变睉煌驨煌煌驨煌氡驨驨煌氡驨驨变变 = 0
while 变睉煌驨煌煌驨煌氡驨驨煌氡驨驨变变 != 2:
    变睉煌驨煌煌驨煌氡驨驨煌氡驨驨变变 += 1
    try:
        raise VELIMATIX(变睉煌驨煌煌驨煌氡驨驨煌氡驨驨变变)
    except VELIMATIX as 变睉驨鐺睉煌鐺煌鐺睉鐺驨鐺氡驨煌氡:
        if 变睉驨鐺睉煌鐺煌鐺睉鐺驨鐺氡驨煌氡.args[0] == 3:
            睉鐺变睉煌睉氡鐺睉变驨煌氡睉氡驨变 = 47468591283504
        if 变睉驨鐺睉煌鐺煌鐺睉鐺驨鐺氡驨煌氡.args[0] == 4:
            变氡煌煌鐺驨睉鐺氡氡睉鐺氡鐺驨睉煌 = 193235735940990
        if 变睉驨鐺睉煌鐺煌鐺睉鐺驨鐺氡驨煌氡.args[0] == 5:
            鐺煌变鐺睉睉煌鐺煌睉氡鐺睉氡睉鐺鐺 = 257329762073087
        if 变睉驨鐺睉煌鐺煌鐺睉鐺驨鐺氡驨煌氡.args[0] == 1:
            閒肚迆入姼錤()['羃飝彖珉闔鞨'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128250603')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7748823')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14720')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60817408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1881')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54525952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2071')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1919')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))()]))())
驨变鐺睉变鐺驨氡鐺睉睉氡氡煌变鐺睉 = 0
while 驨变鐺睉变鐺驨氡鐺睉睉氡氡煌变鐺睉 != 2:
    驨变鐺睉变鐺驨氡鐺睉睉氡氡煌变鐺睉 += 1
    try:
        raise VELIMATIX(驨变鐺睉变鐺驨氡鐺睉睉氡氡煌变鐺睉)
    except VELIMATIX as 煌煌氡鐺氡煌变变煌变鐺鐺鐺煌变氡氡:
        if 煌煌氡鐺氡煌变变煌变鐺鐺鐺煌变氡氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5759911)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5740021)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3973504')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('278432')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('154868')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('30447')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27585')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('79872')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('483328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('970')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('390')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))()]))())
        if 煌煌氡鐺氡煌变变煌变鐺鐺鐺煌变氡氡.args[0] == 3:
            睉驨氡睉变变睉鐺睉睉鐺睉氡变鐺氡鐺 = 34672759730557
        if 煌煌氡鐺氡煌变变煌变鐺鐺鐺煌变氡氡.args[0] == 4:
            变煌睉煌变氡变睉变鐺睉鐺鐺鐺变睉鐺 = 98437848864141
变鐺氡睉鐺睉睉睉驨变变氡变煌睉煌氡 = 0
while 变鐺氡睉鐺睉睉睉驨变变氡变煌睉煌氡 != 2:
    变鐺氡睉鐺睉睉睉驨变变氡变煌睉煌氡 += 1
    try:
        raise VELIMATIX(变鐺氡睉鐺睉睉睉驨变变氡变煌睉煌氡)
    except VELIMATIX as 煌氡煌鐺煌煌煌睉鐺鐺睉鐺变煌煌驨煌:
        if 煌氡煌鐺煌煌煌睉鐺鐺睉鐺变煌煌驨煌.args[0] == 1:
            閒肚迆入姼錤()['犠韟炾肳瘀鯶'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012550)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012577)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('921443250')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012550)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012643)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012550)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8012645)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360564750')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('817280100')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8012651')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('929455800')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('793242450')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0552108')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~47)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7536640')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('624')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))()]))())
煌鐺氡变煌睉鐺鐺变变睉变氡睉睉鐺睉 = 0
while 煌鐺氡变煌睉鐺鐺变变睉变氡睉睉鐺睉 != 2:
    煌鐺氡变煌睉鐺鐺变变睉变氡睉睉鐺睉 += 1
    try:
        raise VELIMATIX(煌鐺氡变煌睉鐺鐺变变睉变氡睉睉鐺睉)
    except VELIMATIX as 煌变煌氡煌驨煌氡变鐺睉驨氡变变氡煌:
        if 煌变煌氡煌驨煌氡变鐺睉驨氡变变氡煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6466352)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6478821)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6877952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('610528')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28362')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('20755')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('155112')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('270206586')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928374)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928274)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928374)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928281)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6928473')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('810619758')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6928483')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6928475')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928374)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6928280)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6928490')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('270206586')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4738296')")[::-1])))()]))())
        if 煌变煌氡煌驨煌氡变鐺睉驨氡变变氡煌.args[0] == 3:
            煌氡驨鐺驨驨氡驨煌驨鐺鐺睉鐺鐺变鐺 = 160652577589975
        if 煌变煌氡煌驨煌氡变鐺睉驨氡变变氡煌.args[0] == 4:
            鐺驨鐺鐺鐺鐺驨鐺驨煌驨睉睉煌鐺煌睉 = 82642577865287
睉鐺变鐺变鐺睉氡驨鐺氡鐺睉驨煌煌睉 = 0
while 睉鐺变鐺变鐺睉氡驨鐺氡鐺睉驨煌煌睉 != 2:
    睉鐺变鐺变鐺睉氡驨鐺氡鐺睉驨煌煌睉 += 1
    try:
        raise VELIMATIX(睉鐺变鐺变鐺睉氡驨鐺氡鐺睉驨煌煌睉)
    except VELIMATIX as 睉驨鐺睉鐺变驨驨驨睉煌驨煌驨变氡睉:
        if 睉驨鐺睉鐺变驨驨驨睉煌驨煌驨变氡睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('82900012911')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7138812')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2188317)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2167833)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2188317)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2221891)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50259076539')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7138812')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64846397661')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7138812')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2364014592')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('343143801')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9558978')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8798559)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8798526)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8798559)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8798524)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12672')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('707')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('180')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('194')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('26368')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('273')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))())
煌驨变鐺氡睉睉煌驨变鐺睉睉驨睉睉变 = 0
while 煌驨变鐺氡睉睉煌驨变鐺睉睉驨睉睉变 != 2:
    煌驨变鐺氡睉睉煌驨变鐺睉睉驨睉睉变 += 1
    try:
        raise VELIMATIX(煌驨变鐺氡睉睉煌驨变鐺睉睉驨睉睉变)
    except VELIMATIX as 鐺鐺睉氡驨氡煌氡变氡氡煌煌煌睉变鐺:
        if 鐺鐺睉氡驨氡煌氡变氡氡煌煌煌睉变鐺.args[0] == 3:
            鐺驨驨煌变变驨鐺驨鐺煌驨鐺驨氡驨驨 = 250934088905781
        if 鐺鐺睉氡驨氡煌氡变氡氡煌煌煌睉变鐺.args[0] == 4:
            驨睉睉睉变氡睉煌驨煌变氡煌鐺鐺氡鐺 = 85057718202384
        if 鐺鐺睉氡驨氡煌氡变氡氡煌煌煌睉变鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4640104')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2491064')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4642798')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2491064')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4601942)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4612349)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1689780224')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75757568')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31079')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('142378587')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3370563')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~47)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~84)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('156')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('88')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61865984')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('241664')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1356')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~49)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~53)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('540')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('94')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~55)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~49)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~60)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('68')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('45056')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1020')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~49)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1130')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~55)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('480')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('460')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('550')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1100')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~95)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~89)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('966656')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('127')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('854')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('672')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('24117248')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28311552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('63')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2090')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1121')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~46)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~35)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('874')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1007')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))()]))())
变变煌鐺驨氡睉煌氡睉煌驨睉驨氡睉变 = 0
while 变变煌鐺驨氡睉煌氡睉煌驨睉驨氡睉变 != 2:
    变变煌鐺驨氡睉煌氡睉煌驨睉驨氡睉变 += 1
    try:
        raise VELIMATIX(变变煌鐺驨氡睉煌氡睉煌驨睉驨氡睉变)
    except VELIMATIX as 睉睉鐺睉氡煌煌煌睉驨鐺变煌驨驨驨变:
        if 睉睉鐺睉氡煌煌煌睉驨鐺变煌驨驨驨变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5125303')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7210015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('171675374947')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7210015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4880768')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~28150)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~28266)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('278131')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3629018)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3629053)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3629085')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3629129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('402820998')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3629125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3629123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3629018)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3628991)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3629057')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8109263')")[::-1])))()]))())
        if 睉睉鐺睉氡煌煌煌睉驨鐺变煌驨驨驨变.args[0] == 3:
            睉变鐺变驨变鐺氡睉煌驨鐺氡鐺氡氡睉 = 273861656617447
        if 睉睉鐺睉氡煌煌煌睉驨鐺变煌驨驨驨变.args[0] == 4:
            氡煌煌睉鐺鐺鐺变煌睉氡变驨睉睉煌睉 = 156132649100320
        if 睉睉鐺睉氡煌煌煌睉驨鐺变煌驨驨驨变.args[0] == 5:
            变鐺驨睉变驨睉睉驨鐺变变驨煌驨变驨 = 110199316150510
氡鐺煌鐺睉驨鐺变驨鐺睉睉煌氡鐺氡驨 = 0
while 氡鐺煌鐺睉驨鐺变驨鐺睉睉煌氡鐺氡驨 != 2:
    氡鐺煌鐺睉驨鐺变驨鐺睉睉煌氡鐺氡驨 += 1
    try:
        raise VELIMATIX(氡鐺煌鐺睉驨鐺变驨鐺睉睉煌氡鐺氡驨)
    except VELIMATIX as 睉睉睉驨氡煌睉睉氡煌氡变煌氡煌煌氡:
        if 睉睉睉驨氡煌睉睉氡煌氡变煌氡煌煌氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('35376128')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7678984192')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31715328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('256310')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~39687)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('34825')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4083833')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4973804')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('424714576')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4973804')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15204352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1972')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~43)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1700')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('873')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('131')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('927')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('882')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('44')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))()]))())
        if 睉睉睉驨氡煌睉睉氡煌氡变煌氡煌煌氡.args[0] == 3:
            变变氡氡睉睉鐺驨驨驨鐺煌驨睉氡氡煌 = 106072404474632
        if 睉睉睉驨氡煌睉睉氡煌氡变煌氡煌煌氡.args[0] == 4:
            驨变睉驨氡睉鐺睉鐺氡鐺煌驨鐺煌睉变 = 64044616404864
        if 睉睉睉驨氡煌睉睉氡煌氡变煌氡煌煌氡.args[0] == 5:
            驨变变氡变睉驨驨变驨变变变鐺氡睉煌 = 128762311012674
驨变睉氡变煌氡氡氡鐺鐺氡鐺变煌驨鐺 = 0
while 驨变睉氡变煌氡氡氡鐺鐺氡鐺变煌驨鐺 != 2:
    驨变睉氡变煌氡氡氡鐺鐺氡鐺变煌驨鐺 += 1
    try:
        raise VELIMATIX(驨变睉氡变煌氡氡氡鐺鐺氡鐺变煌驨鐺)
    except VELIMATIX as 氡氡变睉驨鐺变变鐺煌鐺煌驨变氡驨变:
        if 氡氡变睉驨鐺变变鐺煌鐺煌驨变氡驨变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4582786')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6886554')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8697856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('301336')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25334')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('215824')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75080')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7024948')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4194207')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7024914)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7024993)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7024914)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7025015)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7024914)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7024998)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('336')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('232')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('42')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('234')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7208960')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1584')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113664')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('16121856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('544')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1887')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1887')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~63)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('510')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('160')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('499712')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('45')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('507')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('611')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55296')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('824')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32768')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4096000')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360448')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('192')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~57)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))()]))())
鐺煌驨变驨鐺睉变睉驨驨氡睉鐺鐺鐺氡 = 0
while 鐺煌驨变驨鐺睉变睉驨驨氡睉鐺鐺鐺氡 != 2:
    鐺煌驨变驨鐺睉变睉驨驨氡睉鐺鐺鐺氡 += 1
    try:
        raise VELIMATIX(鐺煌驨变驨鐺睉变睉驨驨氡睉鐺鐺鐺氡)
    except VELIMATIX as 变变驨煌变氡氡驨睉驨睉睉煌鐺氡煌变:
        if 变变驨煌变氡氡驨睉驨睉睉煌鐺氡煌变.args[0] == 1:
            閒肚迆入姼錤()['汾袝鉌鵟頙涒'[::-1]] = not 嬉桫妔敤藗顿(雎昏瞶壳鸏揝(甴俎箸峌疱乒))
        if 变变驨煌变氡氡驨睉驨睉睉煌鐺氡煌变.args[0] == 3:
            睉变驨煌煌氡氡变鐺变驨煌鐺变睉驨煌 = 224380334748144
        if 变变驨煌变氡氡驨睉驨睉睉煌鐺氡煌变.args[0] == 4:
            变氡煌睉变氡睉煌氡驨氡煌鐺驨变煌变 = 44939456235003
        if 变变驨煌变氡氡驨睉驨睉睉煌鐺氡煌变.args[0] == 5:
            变氡煌变驨变煌睉变驨氡煌氡煌煌睉驨 = 234208032591893
睉氡变氡煌变变鐺鐺变煌鐺驨煌变睉驨 = 0
while 睉氡变氡煌变变鐺鐺变煌鐺驨煌变睉驨 != 2:
    睉氡变氡煌变变鐺鐺变煌鐺驨煌变睉驨 += 1
    try:
        raise VELIMATIX(睉氡变氡煌变变鐺鐺变煌鐺驨煌变睉驨)
    except VELIMATIX as 鐺煌睉鐺氡变驨氡氡煌驨鐺驨氡鐺鐺睉:
        if 鐺煌睉鐺氡变驨氡氡煌驨鐺驨氡鐺鐺睉.args[0] == 1:
            閒肚迆入姼錤()['輶擔楜蘲甜襆'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3110797)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3110826)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3110797)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3110557)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135790592')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2090')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1957')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2097152')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1408')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('133')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125520')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('624')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))()]))())
睉煌变鐺鐺驨睉睉驨变鐺氡氡变鐺变氡 = 0
while 睉煌变鐺鐺驨睉睉驨变鐺氡氡变鐺变氡 != 2:
    睉煌变鐺鐺驨睉睉驨变鐺氡氡变鐺变氡 += 1
    try:
        raise VELIMATIX(睉煌变鐺鐺驨睉睉驨变鐺氡氡变鐺变氡)
    except VELIMATIX as 煌变驨变睉驨氡煌氡鐺睉氡变煌驨氡氡:
        if 煌变驨变睉驨氡煌氡鐺睉氡变煌驨氡氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('79850')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('46063616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('432982')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29527')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1280128')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13435392')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))()]))()] = 嬉桫妔敤藗顿(~甴俎箸峌疱乒 or (蕛棷甪碎袓甊 and 甴俎箸峌疱乒))
        if 煌变驨变睉驨氡煌氡鐺睉氡变煌驨氡氡.args[0] == 3:
            变氡煌睉变变氡氡变驨变氡鐺变鐺驨氡 = 115869634810983
        if 煌变驨变睉驨氡煌氡鐺睉氡变煌驨氡氡.args[0] == 4:
            氡驨驨变煌变睉氡煌鐺煌煌变煌氡鐺煌 = 207698520504086
        if 煌变驨变睉驨氡煌氡鐺睉氡变煌驨氡氡.args[0] == 5:
            氡煌氡睉氡煌氡煌变煌煌氡氡煌睉鐺鐺 = 148111044328344
鐺变睉氡变鐺煌煌驨变睉煌煌氡煌驨变 = 0
while 鐺变睉氡变鐺煌煌驨变睉煌煌氡煌驨变 != 2:
    鐺变睉氡变鐺煌煌驨变睉煌煌氡煌驨变 += 1
    try:
        raise VELIMATIX(鐺变睉氡变鐺煌煌驨变睉煌煌氡煌驨变)
    except VELIMATIX as 驨驨变氡睉睉驨驨睉变煌氡睉驨鐺鐺变:
        if 驨驨变氡睉睉驨驨睉变煌氡睉驨鐺鐺变.args[0] == 1:
            閒肚迆入姼錤()['焜鞭浝組排覣'[::-1]] = not 嬉桫妔敤藗顿(雎昏瞶壳鸏揝(甴俎箸峌疱乒))
        if 驨驨变氡睉睉驨驨睉变煌氡睉驨鐺鐺变.args[0] == 3:
            氡驨变变鐺睉煌氡驨煌睉驨氡煌鐺驨变 = 79000172269910
        if 驨驨变氡睉睉驨驨睉变煌氡睉驨鐺鐺变.args[0] == 4:
            鐺变变鐺睉鐺煌煌煌氡睉氡睉煌驨变氡 = 28813493147097
氡氡变氡煌睉变氡睉氡变鐺煌氡鐺氡鐺 = 0
while 氡氡变氡煌睉变氡睉氡变鐺煌氡鐺氡鐺 != 2:
    氡氡变氡煌睉变氡睉氡变鐺煌氡鐺氡鐺 += 1
    try:
        raise VELIMATIX(氡氡变氡煌睉变氡睉氡变鐺煌氡鐺氡鐺)
    except VELIMATIX as 睉鐺变驨鐺睉睉睉鐺氡鐺氡驨变氡煌驨:
        if 睉鐺变驨鐺睉睉睉鐺氡鐺氡驨变氡煌驨.args[0] == 3:
            煌氡鐺氡睉睉鐺鐺鐺变煌驨变鐺驨氡煌 = 166099860658835
        if 睉鐺变驨鐺睉睉睉鐺氡鐺氡驨变氡煌驨.args[0] == 1:
            閒肚迆入姼錤()['畳贷凌药臯矺'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('79872')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1276')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1199')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1254')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~121)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('429')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))()]))())
睉煌变氡鐺煌睉鐺睉驨驨鐺煌变睉煌煌 = 0
while 睉煌变氡鐺煌睉鐺睉驨驨鐺煌变睉煌煌 != 2:
    睉煌变氡鐺煌睉鐺睉驨驨鐺煌变睉煌煌 += 1
    try:
        raise VELIMATIX(睉煌变氡鐺煌睉鐺睉驨驨鐺煌变睉煌煌)
    except VELIMATIX as 鐺变煌睉煌鐺驨氡驨氡变驨驨变鐺煌变:
        if 鐺变煌睉煌鐺驨氡驨氡变驨驨变鐺煌变.args[0] == 3:
            鐺氡驨氡睉睉睉鐺鐺睉煌氡驨鐺煌驨变 = 156585432302088
        if 鐺变煌睉煌鐺驨氡驨氡变驨驨变鐺煌变.args[0] == 4:
            煌煌煌睉变氡驨变煌变煌睉驨睉睉驨煌 = 153828547209716
        if 鐺变煌睉煌鐺驨氡驨氡变驨驨变鐺煌变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2707373)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2698952)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2707373)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2743562)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2741299')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3737072')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2707373)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2697890)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2707373)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2737134)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2739153')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3737072')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6289960)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6289935)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('654155840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0699826')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6289960)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6289949)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6289999')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0699826')")[::-1])))()]))())
睉鐺鐺氡煌煌睉氡氡氡氡煌睉煌煌驨睉 = 0
while 睉鐺鐺氡煌煌睉氡氡氡氡煌睉煌煌驨睉 != 2:
    睉鐺鐺氡煌煌睉氡氡氡氡煌睉煌煌驨睉 += 1
    try:
        raise VELIMATIX(睉鐺鐺氡煌煌睉氡氡氡氡煌睉煌煌驨睉)
    except VELIMATIX as 煌驨驨氡睉鐺煌变驨变鐺变鐺变驨煌煌:
        if 煌驨驨氡睉鐺煌变驨变鐺变鐺变驨煌煌.args[0] == 1:
            閒肚迆入姼錤()['樛绔駴靠殇銆'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3383502)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3383529)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3383605')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2053833')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3383616')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2053833')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('328199694')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2053833')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3383602')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2053833')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107520')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('206848')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1210')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('495')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('131')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29696')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))()]))())
        if 煌驨驨氡睉鐺煌变驨变鐺变鐺变驨煌煌.args[0] == 3:
            变睉氡变鐺鐺变煌变煌变煌睉变煌鐺变 = 85143636339071
        if 煌驨驨氡睉鐺煌变驨变鐺变鐺变驨煌煌.args[0] == 4:
            氡鐺氡氡煌变氡鐺氡睉鐺鐺氡驨驨睉鐺 = 263059967799153
驨鐺鐺鐺变氡煌氡氡变煌氡煌煌驨鐺睉 = 0
while 驨鐺鐺鐺变氡煌氡氡变煌氡煌煌驨鐺睉 != 2:
    驨鐺鐺鐺变氡煌氡氡变煌氡煌煌驨鐺睉 += 1
    try:
        raise VELIMATIX(驨鐺鐺鐺变氡煌氡氡变煌氡煌煌驨鐺睉)
    except VELIMATIX as 驨睉氡驨氡驨变氡鐺睉鐺睉变煌煌煌驨:
        if 驨睉氡驨氡驨变氡鐺睉鐺睉变煌煌煌驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21473787904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('747327')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38599)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('399209')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14088704')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~40665)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7954048')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9004597')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7954133')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9004597')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7954009)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7954046)'))))()]))())
        if 驨睉氡驨氡驨变氡鐺睉鐺睉变煌煌煌驨.args[0] == 3:
            睉鐺鐺氡睉睉睉氡氡驨变睉变氡驨睉驨 = 39586514832600
        if 驨睉氡驨氡驨变氡鐺睉鐺睉变煌煌煌驨.args[0] == 4:
            驨睉睉驨驨煌驨煌睉变睉煌氡煌煌鐺煌 = 262797636543769
        if 驨睉氡驨氡驨变氡鐺睉鐺睉变煌煌煌驨.args[0] == 5:
            变变煌煌睉驨煌鐺变驨煌氡驨睉氡驨煌 = 214077221192032
变变驨氡鐺氡睉驨驨驨煌氡驨鐺睉睉煌 = 0
while 变变驨氡鐺氡睉驨驨驨煌氡驨鐺睉睉煌 != 2:
    变变驨氡鐺氡睉驨驨驨煌氡驨鐺睉睉煌 += 1
    try:
        raise VELIMATIX(变变驨氡鐺氡睉驨驨驨煌氡驨鐺睉睉煌)
    except VELIMATIX as 鐺鐺变煌鐺煌氡驨驨睉驨变鐺驨睉变睉:
        if 鐺鐺变煌鐺煌氡驨驨睉驨变鐺驨睉变睉.args[0] == 1:
            閒肚迆入姼錤()['銯掿鬑燚誂蚠'[::-1]] = 仗轸鏋諔萆輧(')5_4_4_3_8_8_4_4_6_1-(+5_4_4_3_8_8_4_4_6_1'[::-1])
        if 鐺鐺变煌鐺煌氡驨驨睉驨变鐺驨睉变睉.args[0] == 3:
            鐺变煌变变驨鐺煌煌变煌煌氡鐺睉驨睉 = 218608477699625
        if 鐺鐺变煌鐺煌氡驨驨睉驨变鐺驨睉变睉.args[0] == 4:
            氡氡变氡驨睉驨鐺氡鐺煌氡变变驨变变 = 34842557111532
鐺驨煌氡驨变氡鐺变鐺氡变鐺鐺驨驨氡 = 0
while 鐺驨煌氡驨变氡鐺变鐺氡变鐺鐺驨驨氡 != 2:
    鐺驨煌氡驨变氡鐺变鐺氡变鐺鐺驨驨氡 += 1
    try:
        raise VELIMATIX(鐺驨煌氡驨变氡鐺变鐺氡变鐺鐺驨驨氡)
    except VELIMATIX as 鐺氡鐺睉变煌煌氡睉驨驨鐺氡鐺氡变鐺:
        if 鐺氡鐺睉变煌煌氡睉驨驨鐺氡鐺氡变鐺.args[0] == 3:
            煌煌鐺驨变睉鐺鐺氡鐺变煌睉煌氡鐺驨 = 133588006793360
        if 鐺氡鐺睉变煌煌氡睉驨驨鐺氡鐺氡变鐺.args[0] == 4:
            氡氡鐺睉变氡鐺变煌氡睉睉变鐺变驨变 = 40946805409770
        if 鐺氡鐺睉变煌煌氡睉驨驨鐺氡鐺氡变鐺.args[0] == 5:
            煌鐺睉鐺变驨氡煌煌驨煌驨驨鐺变驨睉 = 270947249964567
        if 鐺氡鐺睉变煌煌氡睉驨驨鐺氡鐺氡变鐺.args[0] == 1:
            閒肚迆入姼錤()['歕萫疈掁貋鄞'[::-1]] = 仗轸鏋諔萆輧(')2_4_5_2_6_4_1_3_7_3-(+3_4_5_2_6_4_1_3_7_3'[::-1])
鐺变睉鐺煌鐺氡睉煌鐺鐺氡煌驨变睉鐺 = 0
while 鐺变睉鐺煌鐺氡睉煌鐺鐺氡煌驨变睉鐺 != 2:
    鐺变睉鐺煌鐺氡睉煌鐺鐺氡煌驨变睉鐺 += 1
    try:
        raise VELIMATIX(鐺变睉鐺煌鐺氡睉煌鐺鐺氡煌驨变睉鐺)
    except VELIMATIX as 煌煌变煌鐺睉睉鐺氡睉鐺煌驨变驨驨睉:
        if 煌煌变煌鐺睉睉鐺氡睉鐺煌驨变驨驨睉.args[0] == 3:
            睉氡变鐺鐺驨鐺睉驨变睉鐺氡驨煌鐺睉 = 153744793820394
        if 煌煌变煌鐺睉睉鐺氡睉鐺煌驨变驨驨睉.args[0] == 1:
            閒肚迆入姼錤()['齉浕嘦墵熊粙'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49152')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('450')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('343')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2624')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))()]))())
氡变氡变睉氡煌鐺变驨变变鐺驨睉煌氡 = 0
while 氡变氡变睉氡煌鐺变驨变变鐺驨睉煌氡 != 2:
    氡变氡变睉氡煌鐺变驨变变鐺驨睉煌氡 += 1
    try:
        raise VELIMATIX(氡变氡变睉氡煌鐺变驨变变鐺驨睉煌氡)
    except VELIMATIX as 驨变驨睉煌氡睉驨变驨变睉煌变驨驨鐺:
        if 驨变驨睉煌氡睉驨变驨变睉煌变驨驨鐺.args[0] == 1:
            閒肚迆入姼錤()['袣陝燸嶁躱籃'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101736)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101711)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5101811')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5101840')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1244823584')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('561190960')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('525478808')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5101768')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('591801376')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101736)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101636)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101736)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101765)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5101768')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6371015')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101736)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5101788)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1703936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7859')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9984')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))()]))())
        if 驨变驨睉煌氡睉驨变驨变睉煌变驨驨鐺.args[0] == 3:
            氡煌驨变煌鐺煌鐺变变驨驨变变煌煌变 = 5886336271177
        if 驨变驨睉煌氡睉驨变驨变睉煌变驨驨鐺.args[0] == 4:
            鐺氡煌驨变煌鐺驨驨驨鐺变煌驨变变睉 = 20351046629023
鐺鐺睉驨鐺煌鐺鐺驨驨变变睉睉鐺氡驨 = 0
while 鐺鐺睉驨鐺煌鐺鐺驨驨变变睉睉鐺氡驨 != 2:
    鐺鐺睉驨鐺煌鐺鐺驨驨变变睉睉鐺氡驨 += 1
    try:
        raise VELIMATIX(鐺鐺睉驨鐺煌鐺鐺驨驨变变睉睉鐺氡驨)
    except VELIMATIX as 氡鐺煌变驨睉煌煌驨鐺氡驨氡变氡煌煌:
        if 氡鐺煌变驨睉煌煌驨鐺氡驨氡变氡煌煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('145627483164')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7000063')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('365756416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('26448')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~23132)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('529914')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('403788')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7653956)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7653987)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7653956)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7653903)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27262976')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4392')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14286848')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~49)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('475136')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7849)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))()]))())
煌驨驨睉煌氡驨煌变睉氡睉氡氡驨氡变 = 0
while 煌驨驨睉煌氡驨煌变睉氡睉氡氡驨氡变 != 2:
    煌驨驨睉煌氡驨煌变睉氡睉氡氡驨氡变 += 1
    try:
        raise VELIMATIX(煌驨驨睉煌氡驨煌变睉氡睉氡氡驨氡变)
    except VELIMATIX as 变睉变煌驨睉煌煌煌变变鐺驨煌变变鐺:
        if 变睉变煌驨睉煌煌煌变变鐺驨煌变变鐺.args[0] == 3:
            鐺鐺氡鐺煌氡变鐺鐺驨睉煌睉驨煌煌驨 = 126123581395061
        if 变睉变煌驨睉煌煌煌变变鐺驨煌变变鐺.args[0] == 4:
            鐺驨鐺驨变变变鐺氡氡鐺氡氡煌鐺睉氡 = 274761070906964
        if 变睉变煌驨睉煌煌煌变变鐺驨煌变变鐺.args[0] == 5:
            煌驨驨鐺氡氡驨氡鐺驨鐺氡氡煌变睉睉 = 15344559636238
        if 变睉变煌驨睉煌煌煌变变鐺驨煌变变鐺.args[0] == 1:
            閒肚迆入姼錤()['瘙硴蟶譬雙崟'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107190876')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4848472')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2748484)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2748431)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13631488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4148')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('127')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('133')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4012')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1853')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('133')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1768')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7860)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('138')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('663')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))())
煌煌氡鐺煌煌睉鐺睉煌变睉煌驨变氡变 = 0
while 煌煌氡鐺煌煌睉鐺睉煌变睉煌驨变氡变 != 2:
    煌煌氡鐺煌煌睉鐺睉煌变睉煌驨变氡变 += 1
    try:
        raise VELIMATIX(煌煌氡鐺煌煌睉鐺睉煌变睉煌驨变氡变)
    except VELIMATIX as 鐺驨睉煌煌鐺氡煌煌变驨氡氡煌煌驨睉:
        if 鐺驨睉煌煌鐺氡煌煌变驨氡氡煌煌驨睉.args[0] == 1:
            閒肚迆入姼錤()['幙斠虸惇胜追'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088662)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088689)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('395763030')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2668806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('602777538')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2668806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('602777538')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2668806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('614954862')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2668806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088662)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088614)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088662)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6088610)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2555904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))()]))())
驨睉氡变鐺鐺驨驨驨煌煌鐺变睉变睉睉 = 0
while 驨睉氡变鐺鐺驨驨驨煌煌鐺变睉变睉睉 != 2:
    驨睉氡变鐺鐺驨驨驨煌煌鐺变睉变睉睉 += 1
    try:
        raise VELIMATIX(驨睉氡变鐺鐺驨驨驨煌煌鐺变睉变睉睉)
    except VELIMATIX as 驨睉驨变睉睉鐺煌变变睉鐺驨变氡变睉:
        if 驨睉驨变睉睉鐺煌变变睉鐺驨变氡变睉.args[0] == 1:
            閒肚迆入姼錤()['騒賵茁鉼跆暧'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1034316')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7724301')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1034393')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7724301')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('827392')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('245760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54525952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2204')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~126)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2052')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('836')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1843')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('131')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114688')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1080')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27525120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50855936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55050240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('130')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('893')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2280')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1976')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('540')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('86')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('98')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('99')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('98')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60817408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1995')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('909312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1430')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1966080')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('226')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('62464')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~58)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('570')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6016')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1589248')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1652')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('616')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1358')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1442')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13238272')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2023')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('100352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55050240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2071')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('52736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('909')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('385024')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1261')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1430')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('66')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('791')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('62464')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1507328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('458752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('572')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1456')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1456')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55050240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1881')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('198656')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1276')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('376')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('920')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('206')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1802240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1654784')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('59')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1414')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12976128')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~112)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1870')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1751')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('808')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7733248')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~44)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('100352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1671168')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('74')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~62)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('144')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('138')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))()]))())
煌煌鐺氡驨睉煌变变驨煌睉睉睉驨驨氡 = 0
while 煌煌鐺氡驨睉煌变变驨煌睉睉睉驨驨氡 != 2:
    煌煌鐺氡驨睉煌变变驨煌睉睉睉驨驨氡 += 1
    try:
        raise VELIMATIX(煌煌鐺氡驨睉煌变变驨煌睉睉睉驨驨氡)
    except VELIMATIX as 煌睉睉氡氡驨睉驨鐺鐺氡氡鐺变驨驨睉:
        if 煌睉睉氡氡驨睉驨鐺鐺氡氡鐺变驨驨睉.args[0] == 3:
            煌鐺变鐺氡氡变驨鐺变睉变煌鐺睉变睉 = 148342910615088
        if 煌睉睉氡氡驨睉驨鐺鐺氡氡鐺变驨驨睉.args[0] == 4:
            睉鐺驨氡变睉驨变变煌变氡氡驨氡驨睉 = 191241070534943
        if 煌睉睉氡氡驨睉驨鐺鐺氡氡鐺变驨驨睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5580636)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5603109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5580636)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5588968)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('199490995092')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6360855')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('224782437444')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6360855')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5580636)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5600001)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5580636)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5588813)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9487556)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9487587)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('35127296')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3801088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1260')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1835008')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51712')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2555904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))()]))())
驨煌驨煌变氡睉变煌煌氡睉睉驨变驨煌 = 0
while 驨煌驨煌变氡睉变煌煌氡睉睉驨变驨煌 != 2:
    驨煌驨煌变氡睉变煌煌氡睉睉驨变驨煌 += 1
    try:
        raise VELIMATIX(驨煌驨煌变氡睉变煌煌氡睉睉驨变驨煌)
    except VELIMATIX as 煌驨鐺鐺睉睉煌变氡鐺驨驨鐺驨煌鐺煌:
        if 煌驨鐺鐺睉睉煌变氡鐺驨驨鐺驨煌鐺煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6082987)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6048567)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6082987)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6048022)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('216724660836')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7892806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('161880450044')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7892806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6111059')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7892806')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1381760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('215635329')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1119255')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('536323767')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1119255')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('619260432')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1119255')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1792')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3178496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1740')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1575')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('960')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('952')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('127')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('952')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('888')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('52')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('819')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('798')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('756')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('770')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('811008')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1443')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~104)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('507')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))()]))())
        if 煌驨鐺鐺睉睉煌变氡鐺驨驨鐺驨煌鐺煌.args[0] == 3:
            睉变煌煌睉变睉氡氡氡睉睉氡睉鐺睉驨 = 37912508062271
        if 煌驨鐺鐺睉睉煌变氡鐺驨驨鐺驨煌鐺煌.args[0] == 4:
            驨睉驨睉氡变氡煌鐺驨变氡煌鐺氡驨变 = 260377927747444
鐺睉睉变变煌氡鐺驨睉驨煌睉鐺氡睉变 = 0
while 鐺睉睉变变煌氡鐺驨睉驨煌睉鐺氡睉变 != 2:
    鐺睉睉变变煌氡鐺驨睉驨煌睉鐺氡睉变 += 1
    try:
        raise VELIMATIX(鐺睉睉变变煌氡鐺驨睉驨煌睉鐺氡睉变)
    except VELIMATIX as 驨煌鐺煌驨氡睉变鐺睉变睉鐺变睉驨驨:
        if 驨煌鐺煌驨氡睉变鐺睉变睉鐺变睉驨驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('225956007416')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6192998')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('236819449944')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6192998')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9029815')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6192998')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8992916)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8997332)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8992916)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9026137)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9014599')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6192998')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1584')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('388')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25952256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3735552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('864')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('42')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))())
氡变氡煌睉煌变睉变煌煌氡睉煌鐺鐺变 = 0
while 氡变氡煌睉煌变睉变煌煌氡睉煌鐺鐺变 != 2:
    氡变氡煌睉煌变睉变煌煌氡睉煌鐺鐺变 += 1
    try:
        raise VELIMATIX(氡变氡煌睉煌变睉变煌煌氡睉煌鐺鐺变)
    except VELIMATIX as 煌煌煌变鐺煌变驨氡睉煌氡睉煌驨变氡:
        if 煌煌煌变鐺煌变驨氡睉煌氡睉煌驨变氡.args[0] == 1:
            閒肚迆入姼錤()['纍箑坸幎夗砯'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1426692)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1426723)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1426801')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2966241')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1426789')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2966241')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1426692)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1426812)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64201140')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2966241')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1426789')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2966241')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('78')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))())
        if 煌煌煌变鐺煌变驨氡睉煌氡睉煌驨变氡.args[0] == 3:
            氡变煌煌睉氡睉氡氡煌鐺驨驨鐺变睉睉 = 233610362043538
        if 煌煌煌变鐺煌变驨氡睉煌氡睉煌驨变氡.args[0] == 4:
            煌鐺鐺氡氡煌氡睉氡煌氡煌驨睉驨鐺鐺 = 163914881427482
        if 煌煌煌变鐺煌变驨氡睉煌氡睉煌驨变氡.args[0] == 5:
            氡氡驨鐺睉变氡变驨变睉睉驨睉变氡驨 = 88487515177233
煌氡氡睉睉驨变氡鐺变氡鐺鐺氡鐺鐺变 = 0
while 煌氡氡睉睉驨变氡鐺变氡鐺鐺氡鐺鐺变 != 2:
    煌氡氡睉睉驨变氡鐺变氡鐺鐺氡鐺鐺变 += 1
    try:
        raise VELIMATIX(煌氡氡睉睉驨变氡鐺变氡鐺鐺氡鐺鐺变)
    except VELIMATIX as 变氡变氡睉煌驨变睉变鐺睉睉煌睉煌变:
        if 变氡变氡睉煌驨变睉变鐺睉睉煌睉煌变.args[0] == 1:
            閒肚迆入姼錤()['惗秅囏繸櫬碞'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4803865')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6283084')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('552439990')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6283084')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4803826)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4803735)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4803925')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6283084')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4803871')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6283084')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51904512')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1976')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~62)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2223')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6356992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('555')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3211264')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~104)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))()]))())
        if 变氡变氡睉煌驨变睉变鐺睉睉煌睉煌变.args[0] == 3:
            驨煌睉鐺煌氡驨氡变鐺睉驨变驨氡睉睉 = 114249247470276
变变驨氡鐺变睉煌煌睉鐺鐺变驨氡驨鐺 = 0
while 变变驨氡鐺变睉煌煌睉鐺鐺变驨氡驨鐺 != 2:
    变变驨氡鐺变睉煌煌睉鐺鐺变驨氡驨鐺 += 1
    try:
        raise VELIMATIX(变变驨氡鐺变睉煌煌睉鐺鐺变驨氡驨鐺)
    except VELIMATIX as 驨驨煌驨变变睉氡鐺变氡变驨变变煌睉:
        if 驨驨煌驨变变睉氡鐺变氡变驨变变煌睉.args[0] == 1:
            閒肚迆入姼錤()['座砚跿鲹憍熝'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2555904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('79')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('784')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('159744')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))()]))())
        if 驨驨煌驨变变睉氡鐺变氡变驨变变煌睉.args[0] == 3:
            变变睉变氡睉氡驨鐺鐺睉睉变驨变驨鐺 = 264615184136189
        if 驨驨煌驨变变睉氡鐺变氡变驨变变煌睉.args[0] == 4:
            煌煌睉煌氡驨鐺鐺氡煌变氡变氡驨煌氡 = 182210570394060
        if 驨驨煌驨变变睉氡鐺变氡变驨变变煌睉.args[0] == 5:
            煌鐺鐺睉变煌氡氡煌睉睉煌变鐺鐺煌煌 = 238297892615501
睉氡变氡鐺驨变氡变睉氡变睉睉睉氡氡 = 0
while 睉氡变氡鐺驨变氡变睉氡变睉睉睉氡氡 != 2:
    睉氡变氡鐺驨变氡变睉氡变睉睉睉氡氡 += 1
    try:
        raise VELIMATIX(睉氡变氡鐺驨变氡变睉氡变睉睉睉氡氡)
    except VELIMATIX as 氡煌煌氡鐺煌煌睉氡变煌鐺氡睉氡鐺氡:
        if 氡煌煌氡鐺煌煌睉氡变煌鐺氡睉氡鐺氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6788309)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6757213)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128384')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('47192')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51952')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~26467)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~30942)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7536640')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1616')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~115)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~115)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('468')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('194')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('47')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3670016')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~110)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118784')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('204')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('228')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))())
        if 氡煌煌氡鐺煌煌睉氡变煌鐺氡睉氡鐺氡.args[0] == 3:
            煌氡煌氡睉鐺氡鐺煌鐺睉氡驨驨变驨鐺 = 149915230202547
煌驨煌氡氡驨氡氡鐺变变驨煌氡氡睉氡 = 0
while 煌驨煌氡氡驨氡氡鐺变变驨煌氡氡睉氡 != 2:
    煌驨煌氡氡驨氡氡鐺变变驨煌氡氡睉氡 += 1
    try:
        raise VELIMATIX(煌驨煌氡氡驨氡氡鐺变变驨煌氡氡睉氡)
    except VELIMATIX as 鐺变鐺氡鐺睉煌煌驨变鐺驨睉驨睉驨驨:
        if 鐺变鐺氡鐺睉煌煌驨变鐺驨睉驨睉驨驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('168673571700')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3930726')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6270393)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6280031)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('209663130741')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3930726')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('230995007727')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3930726')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('67807232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('635551744')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5264188')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5264183')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5264214')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('579056390')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5264249')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('600112986')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9414625')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))())
        if 鐺变鐺氡鐺睉煌煌驨变鐺驨睉驨睉驨驨.args[0] == 3:
            变变变氡煌煌氡驨变鐺鐺变煌氡煌鐺鐺 = 62501806713959
        if 鐺变鐺氡鐺睉煌煌驨变鐺驨睉驨睉驨驨.args[0] == 4:
            变氡鐺睉鐺驨驨鐺鐺变驨煌驨煌鐺睉睉 = 9710286112065
        if 鐺变鐺氡鐺睉煌煌驨变鐺驨睉驨睉驨驨.args[0] == 5:
            驨驨变驨煌变氡睉睉睉氡睉煌氡驨驨煌 = 140808189555222
驨氡氡氡驨变睉驨变睉变鐺驨睉鐺变驨 = 0
while 驨氡氡氡驨变睉驨变睉变鐺驨睉鐺变驨 != 2:
    驨氡氡氡驨变睉驨变睉变鐺驨睉鐺变驨 += 1
    try:
        raise VELIMATIX(驨氡氡氡驨变睉驨变睉变鐺驨睉鐺变驨)
    except VELIMATIX as 煌驨煌氡氡驨睉变驨驨驨鐺氡氡睉变氡:
        if 煌驨煌氡氡驨睉变驨驨驨鐺氡氡睉变氡.args[0] == 3:
            睉驨氡变鐺变鐺煌驨氡鐺变睉煌睉氡鐺 = 27753104476321
        if 煌驨煌氡氡驨睉变驨驨驨鐺氡氡睉变氡.args[0] == 4:
            变驨睉变睉睉氡驨变氡氡睉鐺鐺变氡驨 = 271367429856932
        if 煌驨煌氡氡驨睉变驨驨驨鐺氡氡睉变氡.args[0] == 1:
            閒肚迆入姼錤()['腕氕僰蓞勄右'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('319488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('130')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1456')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~121)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1067')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1111')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1474560')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1755')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1515')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1515')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1515')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~126)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1150')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))()]))())
驨煌煌鐺驨驨变煌驨煌变煌鐺睉鐺鐺鐺 = 0
while 驨煌煌鐺驨驨变煌驨煌变煌鐺睉鐺鐺鐺 != 2:
    驨煌煌鐺驨驨变煌驨煌变煌鐺睉鐺鐺鐺 += 1
    try:
        raise VELIMATIX(驨煌煌鐺驨驨变煌驨煌变煌鐺睉鐺鐺鐺)
    except VELIMATIX as 氡煌煌变驨变氡睉氡变睉变驨氡鐺变氡:
        if 氡煌煌变驨变氡睉氡变睉变驨氡鐺变氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('169904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~25386)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('313928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111246')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('73089024')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('37528')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1277952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1605632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))()]))())
        if 氡煌煌变驨变氡睉氡变睉变驨氡鐺变氡.args[0] == 3:
            氡鐺煌睉鐺鐺变驨氡煌睉睉驨驨氡变睉 = 46259219501634
        if 氡煌煌变驨变氡睉氡变睉变驨氡鐺变氡.args[0] == 4:
            变变煌驨驨鐺鐺睉变驨煌煌氡煌煌驨氡 = 75860881900890
        if 氡煌煌变驨变氡睉氡变睉变驨氡鐺变氡.args[0] == 5:
            驨驨鐺睉驨驨睉变睉煌煌氡睉睉睉鐺煌 = 211325675980729
驨煌驨氡煌鐺氡驨睉驨氡驨变变睉煌鐺 = 0
while 驨煌驨氡煌鐺氡驨睉驨氡驨变变睉煌鐺 != 2:
    驨煌驨氡煌鐺氡驨睉驨氡驨变变睉煌鐺 += 1
    try:
        raise VELIMATIX(驨煌驨氡煌鐺氡驨睉驨氡驨变变睉煌鐺)
    except VELIMATIX as 驨变驨睉变变氡煌煌氡鐺鐺变睉变睉睉:
        if 驨变驨睉变变氡煌煌氡鐺鐺变睉变睉睉.args[0] == 3:
            氡驨睉睉变变变睉煌鐺煌氡睉煌鐺睉驨 = 63021834058985
        if 驨变驨睉变变氡煌煌氡鐺鐺变睉变睉睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('162915913284')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9210605')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('133830291792')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9210605')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('138860060018')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9210605')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('716640')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('151265')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('38772')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('10223616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1890')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1854')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1980')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
睉变睉睉鐺驨氡变鐺氡睉睉氡变鐺氡氡 = 0
while 睉变睉睉鐺驨氡变鐺氡睉睉氡变鐺氡氡 != 2:
    睉变睉睉鐺驨氡变鐺氡睉睉氡变鐺氡氡 += 1
    try:
        raise VELIMATIX(睉变睉睉鐺驨氡变鐺氡睉睉氡变鐺氡氡)
    except VELIMATIX as 煌鐺鐺睉煌驨煌睉氡驨睉驨变煌氡驨鐺:
        if 煌鐺鐺睉煌驨煌睉氡驨睉驨变煌氡驨鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4396058)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4421853)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4432346')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8506934')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4396058)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4423784)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4435800')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8506934')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4420715')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8506934')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4422493')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8506934')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5275603')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4655725')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('548658656')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4655725')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5275680')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4655725')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5275564)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5275608)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7168')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~60)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~41)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('282')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~110)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12058624')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1746')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2196')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1854')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1890')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('368')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('333')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('309')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~36)'))))()]))())
        if 煌鐺鐺睉煌驨煌睉氡驨睉驨变煌氡驨鐺.args[0] == 3:
            睉驨驨氡驨变煌变鐺鐺驨煌煌鐺鐺煌变 = 10786677226451
        if 煌鐺鐺睉煌驨煌睉氡驨睉驨变煌氡驨鐺.args[0] == 4:
            氡氡睉鐺鐺鐺鐺氡驨鐺驨驨驨煌鐺变氡 = 150345043763635
        if 煌鐺鐺睉煌驨煌睉氡驨睉驨变煌氡驨鐺.args[0] == 5:
            睉驨变煌煌煌变煌氡鐺氡睉变鐺鐺煌煌 = 73395110520419
变驨鐺驨煌变变氡驨驨驨驨氡煌睉煌睉 = 0
while 变驨鐺驨煌变变氡驨驨驨驨氡煌睉煌睉 != 2:
    变驨鐺驨煌变变氡驨驨驨驨氡煌睉煌睉 += 1
    try:
        raise VELIMATIX(变驨鐺驨煌变变氡驨驨驨驨氡煌睉煌睉)
    except VELIMATIX as 煌鐺睉鐺睉煌氡驨氡变变睉变变煌鐺鐺:
        if 煌鐺睉鐺睉煌氡驨氡变变睉变变煌鐺鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('310680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('33053')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('40294')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('82017')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25714')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31996')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2555904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('230')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('101')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('99')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('180')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('204')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('202')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('208')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~113)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))()]))())
睉变鐺变变睉睉睉变睉氡驨煌煌睉驨驨 = 0
while 睉变鐺变变睉睉睉变睉氡驨煌煌睉驨驨 != 2:
    睉变鐺变变睉睉睉变睉氡驨煌煌睉驨驨 += 1
    try:
        raise VELIMATIX(睉变鐺变变睉睉睉变睉氡驨煌煌睉驨驨)
    except VELIMATIX as 变变煌睉煌鐺变驨鐺煌氡煌鐺鐺变氡氡:
        if 变变煌睉煌鐺变驨鐺煌氡煌鐺鐺变氡氡.args[0] == 3:
            鐺变氡鐺睉睉鐺睉睉变睉煌煌煌睉驨煌 = 203193972174756
        if 变变煌睉煌鐺变驨鐺煌氡煌鐺鐺变氡氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('89713773314')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1050742')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2508869')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1050742')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2470501)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2476257)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2503488')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1050742')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2470501)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2440580)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3051225088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1523761')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2273251')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1523722)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1523833)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1523819')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2273251')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('436')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103424')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2880')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~116)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))())
氡变驨睉驨驨鐺变变鐺变变氡驨鐺驨变 = 0
while 氡变驨睉驨驨鐺变变鐺变变氡驨鐺驨变 != 2:
    氡变驨睉驨驨鐺变变鐺变变氡驨鐺驨变 += 1
    try:
        raise VELIMATIX(氡变驨睉驨驨鐺变变鐺变变氡驨鐺驨变)
    except VELIMATIX as 变睉氡驨驨鐺驨驨驨变氡变鐺煌煌煌驨:
        if 变睉氡驨驨鐺驨驨驨变氡变鐺煌煌煌驨.args[0] == 3:
            睉鐺变驨变睉鐺睉氡驨煌煌变驨变变驨 = 124122299637406
        if 变睉氡驨驨鐺驨驨驨变氡变鐺煌煌煌驨.args[0] == 4:
            驨氡鐺鐺煌鐺煌氡氡变氡驨睉鐺变氡氡 = 233108254578333
        if 变睉氡驨驨鐺驨驨驨变氡变鐺煌煌煌驨.args[0] == 5:
            驨变氡变睉变驨睉睉煌驨鐺驨变睉鐺变 = 137925331500004
        if 变睉氡驨驨鐺驨驨驨变氡变鐺煌煌煌驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('224359400064')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8292959')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9592928)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9572697)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9592928)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9570535)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('324902878432')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8292959')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9613738')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8292959')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9626255')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8292959')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2483322')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3823842')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('285577545')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3823842')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2483283)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2483254)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('202752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('495')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('127')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('202752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1144')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('495')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('444')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('102')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('319488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))()]))())
氡氡氡氡驨驨驨变氡鐺氡驨氡睉驨鐺变 = 0
while 氡氡氡氡驨驨驨变氡鐺氡驨氡睉驨鐺变 != 2:
    氡氡氡氡驨驨驨变氡鐺氡驨氡睉驨鐺变 += 1
    try:
        raise VELIMATIX(氡氡氡氡驨驨驨变氡鐺氡驨氡睉驨鐺变)
    except VELIMATIX as 鐺鐺驨驨氡鐺驨变睉煌变鐺变煌氡鐺鐺:
        if 鐺鐺驨驨氡鐺驨变睉煌变鐺变煌氡鐺鐺.args[0] == 3:
            驨鐺煌驨睉睉驨驨变煌氡变煌睉鐺睉睉 = 57115477411294
        if 鐺鐺驨驨氡鐺驨变睉煌变鐺变煌氡鐺鐺.args[0] == 4:
            煌氡氡变睉煌变鐺睉氡睉睉驨驨驨煌变 = 92299941307784
        if 鐺鐺驨驨氡鐺驨变睉煌变鐺变煌氡鐺鐺.args[0] == 1:
            閒肚迆入姼錤()['甕覕獐锂葋弙'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9252831)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9252856)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1017811410')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1382529')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('897524607')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1382529')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1091834058')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1382529')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9252936')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1382529')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6750208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1552')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~117)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('78')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))())
氡氡氡睉驨氡鐺鐺变煌煌变变鐺鐺变煌 = 0
while 氡氡氡睉驨氡鐺鐺变煌煌变变鐺鐺变煌 != 2:
    氡氡氡睉驨氡鐺鐺变煌煌变变鐺鐺变煌 += 1
    try:
        raise VELIMATIX(氡氡氡睉驨氡鐺鐺变煌煌变变鐺鐺变煌)
    except VELIMATIX as 煌煌驨变变煌睉氡氡变鐺变氡氡驨睉变:
        if 煌煌驨变变煌睉氡氡变鐺变氡氡驨睉变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4127585')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7653014')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('18226176')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27568')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5405671424')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('681930')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5811747)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5811716)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('225')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('510')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60817408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('855')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1916928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7360')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14942208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))())
        if 煌煌驨变变煌睉氡氡变鐺变氡氡驨睉变.args[0] == 3:
            煌驨驨氡煌变氡驨煌氡驨变睉煌驨驨鐺 = 167369456316426
        if 煌煌驨变变煌睉氡氡变鐺变氡氡驨睉变.args[0] == 4:
            煌睉氡变驨煌氡驨变煌煌氡氡驨鐺鐺睉 = 241908568386200
        if 煌煌驨变变煌睉氡氡变鐺变氡氡驨睉变.args[0] == 5:
            驨变驨驨鐺驨鐺变氡睉睉睉睉鐺变煌睉 = 17112910433908
煌变氡睉变鐺驨睉鐺煌变煌鐺鐺驨睉鐺 = 0
while 煌变氡睉变鐺驨睉鐺煌变煌鐺鐺驨睉鐺 != 2:
    煌变氡睉变鐺驨睉鐺煌变煌鐺鐺驨睉鐺 += 1
    try:
        raise VELIMATIX(煌变氡睉变鐺驨睉鐺煌变煌鐺鐺驨睉鐺)
    except VELIMATIX as 驨鐺驨鐺驨鐺氡煌睉驨睉驨睉鐺氡变鐺:
        if 驨鐺驨鐺驨鐺氡煌睉驨睉驨睉鐺氡变鐺.args[0] == 1:
            閒肚迆入姼錤()['鿯蝡鱦熙峺籮'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('221388570')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0366765')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676630)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676649)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676630)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676647)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676630)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5676657)'))))()]))())
        if 驨鐺驨鐺驨鐺氡煌睉驨睉驨睉鐺氡变鐺.args[0] == 3:
            变变煌睉氡睉睉变变氡鐺驨睉煌驨变煌 = 101674056919237
        if 驨鐺驨鐺驨鐺氡煌睉驨睉驨睉鐺氡变鐺.args[0] == 4:
            驨睉鐺鐺氡驨煌变变变睉氡煌驨睉煌驨 = 76913440775070
煌变氡煌变睉氡驨变煌鐺驨煌变睉煌睉 = 0
while 煌变氡煌变睉氡驨变煌鐺驨煌变睉煌睉 != 2:
    煌变氡煌变睉氡驨变煌鐺驨煌变睉煌睉 += 1
    try:
        raise VELIMATIX(煌变氡煌变睉氡驨变煌鐺驨煌变睉煌睉)
    except VELIMATIX as 鐺睉煌睉睉鐺驨煌氡睉鐺煌煌煌变睉睉:
        if 鐺睉煌睉睉鐺驨煌氡睉鐺煌煌煌变睉睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2243106)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2250674)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2273291')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6013422')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('306800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('73482')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~29905)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('36355')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7795795')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6575977')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('896511940')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6575977')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('787371356')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6575977')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('771779844')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6575977')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50688')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1703936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('630')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('129')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))())
        if 鐺睉煌睉睉鐺驨煌氡睉鐺煌煌煌变睉睉.args[0] == 3:
            鐺煌煌煌鐺鐺驨氡氡氡驨变煌煌鐺睉煌 = 93329216010923
        if 鐺睉煌睉睉鐺驨煌氡睉鐺煌煌煌变睉睉.args[0] == 4:
            氡煌氡煌鐺变煌鐺鐺鐺变驨鐺变驨鐺鐺 = 80840813423638
        if 鐺睉煌睉睉鐺驨煌氡睉鐺煌煌煌变睉睉.args[0] == 5:
            变氡鐺氡鐺氡驨睉鐺鐺驨煌鐺氡氡煌睉 = 170009944480899
驨睉煌氡鐺氡驨鐺氡煌鐺鐺睉鐺煌煌变 = 0
while 驨睉煌氡鐺氡驨鐺氡煌鐺鐺睉鐺煌煌变 != 2:
    驨睉煌氡鐺氡驨鐺氡煌鐺鐺睉鐺煌煌变 += 1
    try:
        raise VELIMATIX(驨睉煌氡鐺氡驨鐺氡煌鐺鐺睉鐺煌煌变)
    except VELIMATIX as 煌变睉氡睉驨鐺鐺睉煌睉鐺煌鐺变鐺煌:
        if 煌变睉氡睉驨鐺鐺睉煌睉鐺煌鐺变鐺煌.args[0] == 3:
            变鐺驨睉氡鐺鐺变煌驨驨睉煌驨睉睉变 = 98852987023652
        if 煌变睉氡睉驨鐺鐺睉煌睉鐺煌鐺变鐺煌.args[0] == 1:
            閒肚迆入姼錤()['紩祿鑻庘潡鎽'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188871')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118883200')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('131960352')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188931')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('139093344')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1188832)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1188749)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188933')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188942')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2388811')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7424')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('45')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))()]))())
睉煌氡睉氡睉睉氡变变驨变鐺睉氡驨睉 = 0
while 睉煌氡睉氡睉睉氡变变驨变鐺睉氡驨睉 != 2:
    睉煌氡睉氡睉睉氡变变驨变鐺睉氡驨睉 += 1
    try:
        raise VELIMATIX(睉煌氡睉氡睉睉氡变变驨变鐺睉氡驨睉)
    except VELIMATIX as 鐺驨驨鐺睉鐺睉煌鐺驨鐺氡变氡鐺氡鐺:
        if 鐺驨驨鐺睉鐺睉煌鐺驨鐺氡变氡鐺氡鐺.args[0] == 1:
            閒肚迆入姼錤()['箽賞寵斊鼂嵥'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5111808')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1938')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))())
        if 鐺驨驨鐺睉鐺睉煌鐺驨鐺氡变氡鐺氡鐺.args[0] == 3:
            氡煌氡睉鐺煌变驨煌睉煌驨变驨睉鐺睉 = 275910118172630
氡睉变氡氡驨煌鐺变鐺鐺睉睉变煌鐺氡 = 0
while 氡睉变氡氡驨煌鐺变鐺鐺睉睉变煌鐺氡 != 2:
    氡睉变氡氡驨煌鐺变鐺鐺睉睉变煌鐺氡 += 1
    try:
        raise VELIMATIX(氡睉变氡氡驨煌鐺变鐺鐺睉睉变煌鐺氡)
    except VELIMATIX as 睉氡氡变变睉氡变睉氡煌睉睉变煌氡睉:
        if 睉氡氡变变睉氡变睉氡煌睉睉变煌氡睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2139776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6719799296')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('10687873024')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1042776064')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4165730304')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('24011')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1278090)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1278125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132921360')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0908721')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1278206')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0908721')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29696')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('896')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('345')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15204352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('846')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2124')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('127')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2160')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1872')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~60)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3178496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('137')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('102400')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('460')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1080')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1110')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('517')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('397312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('100352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7274496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~127)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~63)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1728')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('428')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('404')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('236')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~48)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('92')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('78')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))()]))())
鐺变睉睉氡煌鐺氡鐺煌鐺变鐺驨鐺氡驨 = 0
while 鐺变睉睉氡煌鐺氡鐺煌鐺变鐺驨鐺氡驨 != 2:
    鐺变睉睉氡煌鐺氡鐺煌鐺变鐺驨鐺氡驨 += 1
    try:
        raise VELIMATIX(鐺变睉睉氡煌鐺氡鐺煌鐺变鐺驨鐺氡驨)
    except VELIMATIX as 睉煌氡氡氡变变氡变睉氡变变变变睉变:
        if 睉煌氡氡氡变变氡变睉氡变变变变睉变.args[0] == 1:
            閒肚迆入姼錤()['眏產猬厅骁岼'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4256505')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6646524')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('99328')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6336')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('606')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('92160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('824')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13184')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('707')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))()]))())
        if 睉煌氡氡氡变变氡变睉氡变变变变睉变.args[0] == 3:
            睉氡变氡睉变驨氡变变鐺氡煌鐺驨煌煌 = 247758561414381
        if 睉煌氡氡氡变变氡变睉氡变变变变睉变.args[0] == 4:
            鐺变睉氡驨驨驨驨鐺煌鐺煌鐺变驨氡驨 = 104955126036878
变煌变睉鐺氡睉驨鐺鐺煌氡氡煌煌鐺睉 = 0
while 变煌变睉鐺氡睉驨鐺鐺煌氡氡煌煌鐺睉 != 2:
    变煌变睉鐺氡睉驨鐺鐺煌氡氡煌煌鐺睉 += 1
    try:
        raise VELIMATIX(变煌变睉鐺氡睉驨鐺鐺煌氡氡煌煌鐺睉)
    except VELIMATIX as 睉煌睉煌氡氡睉煌睉驨驨睉鐺睉鐺鐺变:
        if 睉煌睉煌氡氡睉煌睉驨驨睉鐺睉鐺鐺变.args[0] == 3:
            睉煌睉鐺驨氡煌氡氡鐺睉煌煌驨氡氡煌 = 271468896991235
        if 睉煌睉煌氡氡睉煌睉驨驨睉鐺睉鐺鐺变.args[0] == 4:
            煌驨驨睉煌鐺氡睉驨变煌驨煌鐺煌驨睉 = 196987849733731
        if 睉煌睉煌氡氡睉煌睉驨驨睉鐺睉鐺鐺变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5036547)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5014136)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2629959680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~25785)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2169176064')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~30491)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~25197)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('239720871')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9866416')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('725309302')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9866416')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6146689)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6146792)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('276601005')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9866416')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6146689)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6146775)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~115)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('531')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('513')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('396')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1026')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('405')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~87)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('565')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~56)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('240')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('295')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14811136')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~44)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~33)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~63)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('72')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('52953088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('855')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5439488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('452')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15990784')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('24576')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~39)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('63')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('30932992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~46)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('67')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('874')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('10223616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
氡驨变驨煌鐺睉变鐺鐺睉氡睉煌鐺变煌 = 0
while 氡驨变驨煌鐺睉变鐺鐺睉氡睉煌鐺变煌 != 2:
    氡驨变驨煌鐺睉变鐺鐺睉氡睉煌鐺变煌 += 1
    try:
        raise VELIMATIX(氡驨变驨煌鐺睉变鐺鐺睉氡睉煌鐺变煌)
    except VELIMATIX as 驨氡变氡鐺变驨驨鐺鐺鐺变驨睉驨氡煌:
        if 驨氡变氡鐺变驨驨鐺鐺鐺变驨睉驨氡煌.args[0] == 3:
            煌驨煌鐺变睉煌煌氡鐺煌鐺驨氡变氡鐺 = 36813266144636
        if 驨氡变氡鐺变驨驨鐺鐺鐺变驨睉驨氡煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('514688')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91548')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~31081)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('77424')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58152')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49162')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('154782147')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3778693')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1072')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('58195968')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~35)'))))()]))())
睉驨睉变变驨氡驨氡氡睉煌驨鐺变睉氡 = 0
while 睉驨睉变变驨氡驨氡氡睉煌驨鐺变睉氡 != 2:
    睉驨睉变变驨氡驨氡氡睉煌驨鐺变睉氡 += 1
    try:
        raise VELIMATIX(睉驨睉变变驨氡驨氡氡睉煌驨鐺变睉氡)
    except VELIMATIX as 煌鐺鐺煌煌变变鐺驨睉驨睉鐺变鐺变驨:
        if 煌鐺鐺煌煌变变鐺驨睉驨睉鐺变鐺变驨.args[0] == 3:
            变氡煌氡驨煌煌睉驨氡睉变煌煌鐺驨驨 = 73433956577604
        if 煌鐺鐺煌煌变变鐺驨睉驨睉鐺变鐺变驨.args[0] == 4:
            氡鐺煌氡煌驨鐺驨煌氡睉鐺睉氡睉煌鐺 = 187547212493909
        if 煌鐺鐺煌煌变变鐺驨睉驨睉鐺变鐺变驨.args[0] == 1:
            閒肚迆入姼錤()['醊愐诚锇尕鿻'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8769162')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3219678')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('860160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9984')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))()]))())
睉煌变鐺鐺变变变鐺睉变煌驨煌变睉鐺 = 0
while 睉煌变鐺鐺变变变鐺睉变煌驨煌变睉鐺 != 2:
    睉煌变鐺鐺变变变鐺睉变煌驨煌变睉鐺 += 1
    try:
        raise VELIMATIX(睉煌变鐺鐺变变变鐺睉变煌驨煌变睉鐺)
    except VELIMATIX as 鐺鐺驨氡驨煌鐺煌氡煌睉睉睉睉睉煌煌:
        if 鐺鐺驨氡驨煌鐺煌氡煌睉睉睉睉睉煌煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14970519552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('757188')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('651092')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3319040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('26677')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~28953)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64650378')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2077561')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1840')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14942208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('827392')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('466944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~83)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1332')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1368')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~104)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29884416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('702')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
鐺氡睉睉鐺变驨驨鐺氡睉睉睉鐺变睉驨 = 0
while 鐺氡睉睉鐺变驨驨鐺氡睉睉睉鐺变睉驨 != 2:
    鐺氡睉睉鐺变驨驨鐺氡睉睉睉鐺变睉驨 += 1
    try:
        raise VELIMATIX(鐺氡睉睉鐺变驨驨鐺氡睉睉睉鐺变睉驨)
    except VELIMATIX as 氡驨睉鐺驨变鐺氡鐺煌氡煌驨鐺氡睉睉:
        if 氡驨睉鐺驨变鐺氡鐺煌氡煌驨鐺氡睉睉.args[0] == 3:
            煌煌变氡氡驨驨氡鐺驨鐺驨煌鐺氡鐺变 = 275744114145827
        if 氡驨睉鐺驨变鐺氡鐺煌氡煌驨鐺氡睉睉.args[0] == 1:
            閒肚迆入姼錤()['殨凬獝徼阅榢'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('156')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('471040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('130')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~56)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))())
氡氡睉驨煌煌变变氡鐺驨煌煌鐺氡睉驨 = 0
while 氡氡睉驨煌煌变变氡鐺驨煌煌鐺氡睉驨 != 2:
    氡氡睉驨煌煌变变氡鐺驨煌煌鐺氡睉驨 += 1
    try:
        raise VELIMATIX(氡氡睉驨煌煌变变氡鐺驨煌煌鐺氡睉驨)
    except VELIMATIX as 驨煌鐺睉睉变煌睉煌煌睉氡驨睉变煌鐺:
        if 驨煌鐺睉睉变煌睉煌煌睉氡驨睉变煌鐺.args[0] == 1:
            閒肚迆入姼錤()['駌符驋纜蒱驄'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9760512')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3740679')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3768320')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1620')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))()]))())
变驨睉氡鐺驨煌煌睉煌氡鐺变驨驨驨氡 = 0
while 变驨睉氡鐺驨煌煌睉煌氡鐺变驨驨驨氡 != 2:
    变驨睉氡鐺驨煌煌睉煌氡鐺变驨驨驨氡 += 1
    try:
        raise VELIMATIX(变驨睉氡鐺驨煌煌睉煌氡鐺变驨驨驨氡)
    except VELIMATIX as 变睉煌鐺鐺变驨睉氡鐺睉煌驨煌鐺睉变:
        if 变睉煌鐺鐺变驨睉氡鐺睉煌驨煌鐺睉变.args[0] == 3:
            睉氡鐺变鐺驨驨氡鐺驨睉睉氡煌氡驨睉 = 22262220725188
        if 变睉煌鐺鐺变驨睉氡鐺睉煌驨煌鐺睉变.args[0] == 1:
            閒肚迆入姼錤()['燌檙绕鏁镺玅'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2636958')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9196362')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2637034')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9196362')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2637036')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9196362')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2637017')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9196362')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2636919)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2636826)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6720')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3801088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('19968')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))()]))())
煌鐺鐺氡驨变煌氡氡鐺变睉睉煌变煌变 = 0
while 煌鐺鐺氡驨变煌氡氡鐺变睉睉煌变煌变 != 2:
    煌鐺鐺氡驨变煌氡氡鐺变睉睉煌变煌变 += 1
    try:
        raise VELIMATIX(煌鐺鐺氡驨变煌氡氡鐺变睉睉煌变煌变)
    except VELIMATIX as 变氡煌氡驨煌睉睉变变煌鐺氡变驨睉煌:
        if 变氡煌氡驨煌睉睉变变煌鐺氡变驨睉煌.args[0] == 1:
            閒肚迆入姼錤()['屙钻竆懊眲锤'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4740558')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9150474')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4740519)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4740480)'))))()]))())
氡煌鐺睉鐺睉变煌氡氡变鐺氡变氡鐺鐺 = 0
while 氡煌鐺睉鐺睉变煌氡氡变鐺氡变氡鐺鐺 != 2:
    氡煌鐺睉鐺睉变煌氡氡变鐺氡变氡鐺鐺 += 1
    try:
        raise VELIMATIX(氡煌鐺睉鐺睉变煌氡氡变鐺氡变氡鐺鐺)
    except VELIMATIX as 睉睉驨变变氡鐺驨睉氡变睉变驨驨变煌:
        if 睉睉驨变变氡鐺驨睉氡变睉变驨驨变煌.args[0] == 1:
            閒肚迆入姼錤()['敉謣凔岭苷揃'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('86101938')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2477022')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207742)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207638)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207742)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207626)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2207858')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2477022')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('247267104')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2477022')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207742)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2207629)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1900544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('62')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1888')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('436')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('480')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('106496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('460')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1050')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('401408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3456')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3008')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('612')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6336')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('606')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('588')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('666')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('648')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3360')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('535')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('30932992')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('828')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('130')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2016')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('702')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
        if 睉睉驨变变氡鐺驨睉氡变睉变驨驨变煌.args[0] == 3:
            氡煌睉驨鐺睉鐺氡睉氡变氡煌变变氡氡 = 71579907153363
        if 睉睉驨变变氡鐺驨睉氡变睉变驨驨变煌.args[0] == 4:
            睉驨驨鐺驨睉睉煌睉鐺煌煌驨驨驨煌煌 = 164710068242420
        if 睉睉驨变变氡鐺驨睉氡变睉变驨驨变煌.args[0] == 5:
            煌变变氡驨煌驨变鐺驨变驨睉驨氡鐺驨 = 174707934077299
煌煌睉睉煌鐺鐺鐺睉睉变氡煌变煌睉氡 = 0
while 煌煌睉睉煌鐺鐺鐺睉睉变氡煌变煌睉氡 != 2:
    煌煌睉睉煌鐺鐺鐺睉睉变氡煌变煌睉氡 += 1
    try:
        raise VELIMATIX(煌煌睉睉煌鐺鐺鐺睉睉变氡煌变煌睉氡)
    except VELIMATIX as 煌睉氡鐺煌变变变煌氡鐺驨睉煌煌变煌:
        if 煌睉氡鐺煌变变变煌氡鐺驨睉煌煌变煌.args[0] == 3:
            驨睉驨氡驨氡睉睉驨鐺鐺驨煌氡变煌煌 = 73082990535859
        if 煌睉氡鐺煌变变变煌氡鐺驨睉煌煌变煌.args[0] == 4:
            睉鐺氡煌氡驨煌煌变煌煌鐺驨鐺鐺睉煌 = 5414704419411
        if 煌睉氡鐺煌变变变煌氡鐺驨睉煌煌变煌.args[0] == 5:
            煌驨驨氡变变变氡变煌变睉变氡鐺驨煌 = 264263838497449
        if 煌睉氡鐺煌变变变煌氡鐺驨睉煌煌变煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5061471)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5071030)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4775477248')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('642464')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~26069)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15397888')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('293448')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('624')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('648')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28672')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('195')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))()]))())
煌氡驨氡睉煌煌变睉驨变鐺煌煌鐺鐺驨 = 0
while 煌氡驨氡睉煌煌变睉驨变鐺煌煌鐺鐺驨 != 2:
    煌氡驨氡睉煌煌变睉驨变鐺煌煌鐺鐺驨 += 1
    try:
        raise VELIMATIX(煌氡驨氡睉煌煌变睉驨变鐺煌煌鐺鐺驨)
    except VELIMATIX as 氡氡驨鐺鐺氡驨变变驨鐺煌鐺氡睉煌睉:
        if 氡氡驨鐺鐺氡驨变变驨鐺煌鐺氡睉煌睉.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('219594184730')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4329029')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('628588544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('512694')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~36823)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2951741440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32793)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('345')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~113)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29696')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('312')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))()]))())
煌睉鐺驨睉睉氡鐺煌氡氡煌煌驨睉煌煌 = 0
while 煌睉鐺驨睉睉氡鐺煌氡氡煌煌驨睉煌煌 != 2:
    煌睉鐺驨睉睉氡鐺煌氡氡煌煌驨睉煌煌 += 1
    try:
        raise VELIMATIX(煌睉鐺驨睉睉氡鐺煌氡氡煌煌驨睉煌煌)
    except VELIMATIX as 变煌变睉煌驨变变驨煌煌煌鐺煌驨睉驨:
        if 变煌变睉煌驨变变驨煌煌煌鐺煌驨睉驨.args[0] == 3:
            氡煌氡驨变煌驨氡睉驨氡氡驨变睉鐺鐺 = 101357094274355
        if 变煌变睉煌驨变变驨煌煌煌鐺煌驨睉驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3137591)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3116788)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3175551')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1957313')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3137591)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3111064)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3172033')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1957313')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123715213130')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1957313')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3137591)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3125294)'))))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059260)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059227)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059260)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059272)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3059361')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0629503')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3059380')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0629503')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3059376')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0629503')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059260)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059219)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('324281560')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0629503')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('296748220')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0629503')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059260)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3059274)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('388')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1840')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('396')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('456')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('420')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~116)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('156')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))()]))())
煌煌驨睉鐺煌睉驨氡驨鐺鐺鐺睉变鐺变 = 0
while 煌煌驨睉鐺煌睉驨氡驨鐺鐺鐺睉变鐺变 != 2:
    煌煌驨睉鐺煌睉驨氡驨鐺鐺鐺睉变鐺变 += 1
    try:
        raise VELIMATIX(煌煌驨睉鐺煌睉驨氡驨鐺鐺鐺睉变鐺变)
    except VELIMATIX as 氡氡氡睉煌煌变氡变煌驨睉氡煌煌睉鐺:
        if 氡氡氡睉煌煌变氡变煌驨睉氡煌煌睉鐺.args[0] == 1:
            閒肚迆入姼錤()['尹烚遒敇蔭爑'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('86628321')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9321222')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('86628321')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9321222')")[::-1])))()]))())
        if 氡氡氡睉煌煌变氡变煌驨睉氡煌煌睉鐺.args[0] == 3:
            煌煌变鐺鐺睉驨驨鐺氡睉氡煌氡变驨氡 = 131035008192933
        if 氡氡氡睉煌煌变氡变煌驨睉氡煌煌睉鐺.args[0] == 4:
            鐺变变睉睉氡变驨鐺变煌煌鐺煌鐺驨鐺 = 163234368947458
        if 氡氡氡睉煌煌变氡变煌驨睉氡煌煌睉鐺.args[0] == 5:
            变驨驨睉驨睉鐺睉煌鐺煌鐺鐺煌驨睉氡 = 153047112794255
煌睉鐺鐺煌睉睉睉鐺驨驨煌鐺煌氡变睉 = 0
while 煌睉鐺鐺煌睉睉睉鐺驨驨煌鐺煌氡变睉 != 2:
    煌睉鐺鐺煌睉睉睉鐺驨驨煌鐺煌氡变睉 += 1
    try:
        raise VELIMATIX(煌睉鐺鐺煌睉睉睉鐺驨驨煌鐺煌氡变睉)
    except VELIMATIX as 睉鐺变煌驨鐺鐺睉鐺煌鐺鐺氡氡睉鐺氡:
        if 睉鐺变煌驨鐺鐺睉鐺煌鐺鐺氡氡睉鐺氡.args[0] == 3:
            变变氡氡驨驨变煌煌驨煌煌煌睉驨氡煌 = 141797048282038
        if 睉鐺变煌驨鐺鐺睉鐺煌鐺鐺氡氡睉鐺氡.args[0] == 1:
            閒肚迆入姼錤()['嵉攖猻忩蔵崴'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('230044347')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898682')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5898573)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5898536)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898688')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898688')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898670')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898676')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('595755873')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5898631')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('188754336')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3758985')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('644')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('272')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2688')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('369')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~85)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('828')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))()]))())
氡睉驨变驨鐺氡驨睉驨氡变变氡睉鐺驨 = 0
while 氡睉驨变驨鐺氡驨睉驨氡变变氡睉鐺驨 != 2:
    氡睉驨变驨鐺氡驨睉驨氡变变氡睉鐺驨 += 1
    try:
        raise VELIMATIX(氡睉驨变驨鐺氡驨睉驨氡变变氡睉鐺驨)
    except VELIMATIX as 鐺变变鐺氡睉鐺鐺氡煌鐺煌鐺睉煌煌驨:
        if 鐺变变鐺氡睉鐺鐺氡煌鐺煌鐺睉煌煌驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9109112)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9081432)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9109112)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9072590)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('84256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~25426)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4560388096')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('389424')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14417920')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3112960')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49152')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1556480')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('63')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~81)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('69')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1330')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3735552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('458752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('778240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~53)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1235')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('364')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1556480')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('458752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('559')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('225280')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~60)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~83)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1140')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('660')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('389120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('684')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~90)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7168')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~88)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('59')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('665')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~51)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~88)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('385')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~46)'))))()]))())
        if 鐺变变鐺氡睉鐺鐺氡煌鐺煌鐺睉煌煌驨.args[0] == 3:
            睉鐺睉驨驨睉氡鐺氡变睉睉驨鐺氡煌变 = 228937721426090
        if 鐺变变鐺氡睉鐺鐺氡煌鐺煌鐺睉煌煌驨.args[0] == 4:
            睉煌睉氡氡氡煌变睉鐺氡睉变睉鐺煌睉 = 48037629047906
        if 鐺变变鐺氡睉鐺鐺氡煌鐺煌鐺睉煌煌驨.args[0] == 5:
            变驨氡变驨驨鐺鐺驨煌氡氡鐺鐺睉煌氡 = 203900921082473
驨睉变睉变睉鐺变鐺睉驨睉氡煌睉睉煌 = 0
while 驨睉变睉变睉鐺变鐺睉驨睉氡煌睉睉煌 != 2:
    驨睉变睉变睉鐺变鐺睉驨睉氡煌睉睉煌 += 1
    try:
        raise VELIMATIX(驨睉变睉变睉鐺变鐺睉驨睉氡煌睉睉煌)
    except VELIMATIX as 变驨睉驨驨睉煌睉鐺氡变睉鐺氡鐺鐺氡:
        if 变驨睉驨驨睉煌睉鐺氡变睉鐺氡鐺鐺氡.args[0] == 3:
            鐺鐺驨鐺变睉驨煌驨鐺鐺氡氡煌煌睉氡 = 192729468665087
        if 变驨睉驨驨睉煌睉鐺氡变睉鐺氡鐺鐺氡.args[0] == 4:
            变鐺氡氡变氡氡氡氡变鐺煌变氡氡变驨 = 86928253384230
        if 变驨睉驨驨睉煌睉鐺氡变睉鐺氡鐺鐺氡.args[0] == 1:
            閒肚迆入姼錤()['携詈齏莧斲騖'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('322938603')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7740828')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('76800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1040')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('254')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1160')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('30208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('512')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60817408')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1976')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32133120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7929856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~48)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7471104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2007296')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('256')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('928')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('832')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('233')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('256')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('860160')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1391')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('46')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))()]))())
鐺睉鐺变氡氡驨煌鐺驨氡驨驨睉驨煌氡 = 0
while 鐺睉鐺变氡氡驨煌鐺驨氡驨驨睉驨煌氡 != 2:
    鐺睉鐺变氡氡驨煌鐺驨氡驨驨睉驨煌氡 += 1
    try:
        raise VELIMATIX(鐺睉鐺变氡氡驨煌鐺驨氡驨驨睉驨煌氡)
    except VELIMATIX as 鐺驨驨睉煌驨驨鐺煌氡鐺驨驨驨睉变鐺:
        if 鐺驨驨睉煌驨驨鐺煌氡鐺驨驨驨睉变鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13347323904')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('280928256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37347)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49471488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11629232128')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('587442')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('638976')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('546')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))()]))())
氡鐺驨煌睉氡驨变氡煌鐺变煌煌睉变鐺 = 0
while 氡鐺驨煌睉氡驨变氡煌鐺变煌煌睉变鐺 != 2:
    氡鐺驨煌睉氡驨变氡煌鐺变煌煌睉变鐺 += 1
    try:
        raise VELIMATIX(氡鐺驨煌睉氡驨变氡煌鐺变煌煌睉变鐺)
    except VELIMATIX as 煌煌睉睉鐺鐺氡驨煌驨煌煌氡变驨鐺驨:
        if 煌煌睉睉鐺鐺氡驨煌驨煌煌氡变驨鐺驨.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1556893')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9979151')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2229927936')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('34330')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('22412')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('409216')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('78432256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1858446')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7048581')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1858407)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1858310)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1858407)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1858368)'))))()]))())
睉氡驨变氡变氡驨驨变睉驨变氡驨变驨 = 0
while 睉氡驨变氡变氡驨驨变睉驨变氡驨变驨 != 2:
    睉氡驨变氡变氡驨驨变睉驨变氡驨变驨 += 1
    try:
        raise VELIMATIX(睉氡驨变氡变氡驨驨变睉驨变氡驨变驨)
    except VELIMATIX as 氡鐺驨鐺氡变煌变变变睉睉氡氡鐺煌睉:
        if 氡鐺驨鐺氡变煌变变变睉睉氡氡鐺煌睉.args[0] == 3:
            鐺变变鐺变鐺煌煌鐺睉煌煌氡变变煌鐺 = 135203086793192
        if 氡鐺驨鐺氡变煌变变变睉睉氡氡鐺煌睉.args[0] == 1:
            閒肚迆入姼錤()['棏祂脍橂汿茥'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8569414')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5739658')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1054033125')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5739658')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1071171875')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5739658')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8569498')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5739658')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1071171875')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5739658')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('319488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))()]))())
煌鐺氡睉变氡驨煌驨煌鐺睉驨睉睉睉驨 = 0
while 煌鐺氡睉变氡驨煌驨煌鐺睉驨睉睉睉驨 != 2:
    煌鐺氡睉变氡驨煌驨煌鐺睉驨睉睉睉驨 += 1
    try:
        raise VELIMATIX(煌鐺氡睉变氡驨煌驨煌鐺睉驨睉睉睉驨)
    except VELIMATIX as 变变煌驨煌睉氡睉煌变鐺驨煌氡睉氡氡:
        if 变变煌驨煌睉氡睉煌变鐺驨煌氡睉氡氡.args[0] == 3:
            睉煌氡变鐺驨煌睉睉变煌氡煌煌氡鐺睉 = 177270751871581
        if 变变煌驨煌睉氡睉煌变鐺驨煌氡睉氡氡.args[0] == 4:
            氡睉驨驨睉煌氡变变变睉变氡氡驨鐺变 = 15607403171358
        if 变变煌驨煌睉氡睉煌变鐺驨煌氡睉氡氡.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9172520')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0637419')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('237922833600')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('0637419')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1530593280')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('581264')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~23621)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65884')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('156')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('195')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))()]))())
驨氡煌睉睉鐺氡驨鐺氡氡鐺变变驨鐺煌 = 0
while 驨氡煌睉睉鐺氡驨鐺氡氡鐺变变驨鐺煌 != 2:
    驨氡煌睉睉鐺氡驨鐺氡氡鐺变变驨鐺煌 += 1
    try:
        raise VELIMATIX(驨氡煌睉睉鐺氡驨鐺氡氡鐺变变驨鐺煌)
    except VELIMATIX as 鐺煌驨氡鐺煌鐺氡变氡鐺驨睉变氡变氡:
        if 鐺煌驨氡鐺煌鐺氡变氡鐺驨睉变氡变氡.args[0] == 3:
            鐺氡氡煌煌氡变鐺变煌变睉氡氡变驨驨 = 196634529927537
        if 鐺煌驨氡鐺煌鐺氡变氡鐺驨睉变氡变氡.args[0] == 4:
            变睉氡煌鐺氡变氡鐺睉鐺鐺鐺变变鐺煌 = 210378116063814
        if 鐺煌驨氡鐺煌鐺氡变氡鐺驨睉变氡变氡.args[0] == 1:
            閒肚迆入姼錤()['灡箟赠激啀耺'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104830284')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6597862')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('215036480')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6597862')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2688028')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6597862')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2621440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~92)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~74)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('339968')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('95')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~69)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('136')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1998848')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~63)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~60)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1530')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1545')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1664')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1808')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~52)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~112)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1736704')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('765')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('216')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('194')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('224')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('108')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~59)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('117')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~57)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('16777216')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2223')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2185')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('413696')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~126)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1164')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1236')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('113')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('220')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('249856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1344')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('348')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('216')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('101')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~83)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('124')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15073280')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91136')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('830')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('229376')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('392')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~79)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('318')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~66)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('843776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~118)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57671680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~39)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1501')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2299')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('528')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('69')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1785856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('96')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1694')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13824')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('80')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~66)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('15597568')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~94)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~104)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~83)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~93)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~90)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~66)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('17301504')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1782')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~90)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~80)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('29440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('184320')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~93)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~111)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2916352')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109568')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3801088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1680')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1500')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1005')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~55)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('735')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1155')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1584')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('239616')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('88')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1342')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('979')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('825')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~78)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1276')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('84')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('97')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50176')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~71)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('38912')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('603')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8650752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~112)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~70)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1900544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1512')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('87')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~14)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~75)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1400')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('864')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('92')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('348')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('225')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~80)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~65)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~71)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('291')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('216')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('222')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('354')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6272')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2784')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~80)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('82')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~81)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1196032')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('62')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1064')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8519680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('134')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1261568')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4390912')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('68')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1904')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('89')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~85)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~33)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('134')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~73)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28573696')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2070')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~72)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1494')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135168')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('924')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('729088')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('178176')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('101')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54525952')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1881')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1712')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('82')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('86016')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39424')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('85')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~99)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('308')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('100')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48640')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('873')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('909')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('396')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31981568')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4928')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('630')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~64)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('59')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('184')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~50)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('74')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~48)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('96')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('80')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~78)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('102')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('132')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51200')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12288')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('520')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6553600')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1776')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3440640')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1500')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('63')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~62)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('786432')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('518')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('714')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('80')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75776')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~11)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~57)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('528')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('825')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('52')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('550')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('59')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('76')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1792')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('448')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1728')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('404')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('348')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('300')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('109')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('350')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('490')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('371')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13369344')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56320')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('460')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('510')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('540')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('47')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('60')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('96')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1310720')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~68)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('589824')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1092')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1001')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39845888')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9472')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('400')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~75)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('400')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~109)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('303104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('650')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~61)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('923')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('792')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('856')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('333')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('44')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('800')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~52)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~71)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~108)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('456')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~107)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('404')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('592')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('280')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('196')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('26214400')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('874')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1536')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~5)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~53)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('230')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('350')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('24576')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('19712')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('784')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('840')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13238272')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('629')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('850')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('816')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('169984')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1067')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3342336')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49664')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1026')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('114')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('46')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1638400')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('85')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('795')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('765')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('901120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('47104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('510')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('590')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))()]))())
煌睉鐺睉驨氡睉变鐺煌睉氡煌睉鐺煌睉 = 0
while 煌睉鐺睉驨氡睉变鐺煌睉氡煌睉鐺煌睉 != 2:
    煌睉鐺睉驨氡睉变鐺煌睉氡煌睉鐺煌睉 += 1
    try:
        raise VELIMATIX(煌睉鐺睉驨氡睉变鐺煌睉氡煌睉鐺煌睉)
    except VELIMATIX as 煌驨睉鐺驨驨驨变驨煌鐺驨变驨鐺睉煌:
        if 煌驨睉鐺驨驨驨变驨煌鐺驨变驨鐺睉煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110620672')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~31923)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('288492')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~38709)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('10402560')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5220480')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('294213348')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2393457')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7543932)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7543870)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('59151970812')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2393457')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('829832520')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2393457')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7543964')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2393457')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50688')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7872)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~41)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('282')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~441)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32387072')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1188')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('16777216')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('464')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('116')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('242')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('198')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7855')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1638400')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('110362')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1386')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27262976')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('576')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2124')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7927)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~50)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1962')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7883)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('134')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28311552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('141246')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1980')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
        if 煌驨睉鐺驨驨驨变驨煌鐺驨变驨鐺睉煌.args[0] == 3:
            睉变变煌煌睉鐺煌鐺氡睉氡煌睉鐺睉睉 = 179621500654506
变氡驨变氡煌变睉氡睉氡氡鐺氡煌鐺变 = 0
while 变氡驨变氡煌变睉氡睉氡氡鐺氡煌鐺变 != 2:
    变氡驨变氡煌变睉氡睉氡氡鐺氡煌鐺变 += 1
    try:
        raise VELIMATIX(变氡驨变氡煌变睉氡睉氡氡鐺氡煌鐺变)
    except VELIMATIX as 鐺驨氡驨鐺鐺鐺睉煌氡驨驨睉氡驨变鐺:
        if 鐺驨氡驨鐺鐺鐺睉煌氡驨驨睉氡驨变鐺.args[0] == 3:
            煌鐺氡睉睉睉驨煌鐺鐺氡变睉氡驨睉变 = 102273938842072
        if 鐺驨氡驨鐺鐺鐺睉煌氡驨驨睉氡驨变鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6024409')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9936995')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6034426')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9936995')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6026707')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9936995')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('189881970734')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9936995')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('158113048832')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9936995')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4628807680')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2496')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('134')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('112')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('105')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('33')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('104')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('245')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('111')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~102)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8388608')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('122')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7925')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('917504')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('416')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8068096')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('262144')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~98)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7876')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~110)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1287')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1352')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('445')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1261')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~13)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3549')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('272')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('52736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('288')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~103)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~97)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32165888')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~124)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('384')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2808')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('901120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('45')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('238')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('101')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1605632')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('942080')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('53760')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3232')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('262144')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4325376')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('663')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))())
变氡氡鐺煌鐺变氡变变变氡变氡氡煌驨 = 0
while 变氡氡鐺煌鐺变氡变变变氡变氡氡煌驨 != 2:
    变氡氡鐺煌鐺变氡变变变氡变氡氡煌驨 += 1
    try:
        raise VELIMATIX(变氡氡鐺煌鐺变氡变变变氡变氡氡煌驨)
    except VELIMATIX as 变变变煌睉睉变鐺睉煌变变变驨驨鐺鐺:
        if 变变变煌睉睉变鐺睉煌变变变驨驨鐺鐺.args[0] == 1:
            閒肚迆入姼錤()['芨噀齸讍淩邞'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1448318')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9728441')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('121655436')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9728441')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56832')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~101)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~41)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('234')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('204')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('33')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('19922944')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('210')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('107')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('102')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('256')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('154')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('55050240')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7894)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~125)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('512')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~84)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('416')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~4)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~233)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('43')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))()]))())
驨睉变变变睉变鐺氡煌鐺睉变驨睉鐺睉 = 0
while 驨睉变变变睉变鐺氡煌鐺睉变驨睉鐺睉 != 2:
    驨睉变变变睉变鐺氡煌鐺睉变驨睉鐺睉 += 1
    try:
        raise VELIMATIX(驨睉变变变睉变鐺氡煌鐺睉变驨睉鐺睉)
    except VELIMATIX as 变氡煌驨睉驨氡变变煌氡氡睉驨煌煌变:
        if 变氡煌驨睉驨氡变变煌氡氡睉驨煌煌变.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91676672')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32132)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('34358')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~12)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~35615)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('299991040')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('38612')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3821244')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5021283')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('149026995')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5021283')")[::-1])))()]))())
        if 变氡煌驨睉驨氡变变煌氡氡睉驨煌煌变.args[0] == 3:
            氡变睉氡煌氡氡驨变鐺鐺睉驨驨鐺变煌 = 213661420032285
        if 变氡煌驨睉驨氡变变煌氡氡睉驨煌煌变.args[0] == 4:
            煌氡鐺氡鐺煌鐺驨鐺睉鐺睉驨氡变驨煌 = 242173974914196
        if 变氡煌驨睉驨氡变变煌氡氡睉驨煌煌变.args[0] == 5:
            驨睉氡变氡鐺煌煌睉鐺煌变变驨煌驨变 = 88920185536695
鐺鐺睉睉煌睉变变煌煌驨驨睉变鐺变驨 = 0
while 鐺鐺睉睉煌睉变变煌煌驨驨睉变鐺变驨 != 2:
    鐺鐺睉睉煌睉变变煌煌驨驨睉变鐺变驨 += 1
    try:
        raise VELIMATIX(鐺鐺睉睉煌睉变变煌煌驨驨睉变鐺变驨)
    except VELIMATIX as 煌煌煌变煌鐺鐺变鐺煌鐺煌驨鐺氡氡氡:
        if 煌煌煌变煌鐺鐺变鐺煌鐺煌驨鐺氡氡氡.args[0] == 1:
            閒肚迆入姼錤()['擹迹莴雃瑗佽'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1475526)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1475553)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('115091028')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6255741')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1475526)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~1475502)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1029308416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1904')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('49')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('19136512')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1224')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('576')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1764')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4032')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~123)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('136')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('430080')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('94452')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('21')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1900544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('812')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('64')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))())
        if 煌煌煌变煌鐺鐺变鐺煌鐺煌驨鐺氡氡氡.args[0] == 3:
            睉氡煌变煌鐺变煌氡变氡睉氡驨氡鐺变 = 124428572989756
鐺煌驨氡氡鐺鐺鐺鐺睉驨鐺鐺鐺驨鐺变 = 0
while 鐺煌驨氡氡鐺鐺鐺鐺睉驨鐺鐺鐺驨鐺变 != 2:
    鐺煌驨氡氡鐺鐺鐺鐺睉驨鐺鐺鐺驨鐺变 += 1
    try:
        raise VELIMATIX(鐺煌驨氡氡鐺鐺鐺鐺睉驨鐺鐺鐺驨鐺变)
    except VELIMATIX as 煌驨煌氡驨睉鐺氡变煌睉氡氡睉驨煌鐺:
        if 煌驨煌氡驨睉鐺氡变煌睉氡氡睉驨煌鐺.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8961379)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8922522)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9000639')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9731698')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2833536')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('143731')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('237678')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5211553792')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('5111808')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('103')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~100)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27525120')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('65536')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('11')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7077888')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('258')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('126')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('119')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~48)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('440')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7855')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~114)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~34)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('75')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('70')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('16777216')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~113)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('243')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~122)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~51)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('137')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1995')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7890')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('135')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~51)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('123')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('150233')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1792')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4194304')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('125')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('71')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~17)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7894)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8650752')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))()]))())
氡煌驨睉变驨煌煌氡鐺煌煌鐺驨驨变驨 = 0
while 氡煌驨睉变驨煌煌氡鐺煌煌鐺驨驨变驨 != 2:
    氡煌驨睉变驨煌煌氡鐺煌煌鐺驨驨变驨 += 1
    try:
        raise VELIMATIX(氡煌驨睉变驨煌煌氡鐺煌煌鐺驨驨变驨)
    except VELIMATIX as 驨睉鐺氡睉变睉变鐺氡睉鐺煌变睉氡煌:
        if 驨睉鐺氡睉变睉变鐺氡睉鐺煌变睉氡煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6735127)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6720472)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6735127)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~6733527)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('975732736')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~37646)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~15)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~32464)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('310155')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('51')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('305309082')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8348287')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7828521')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8348287')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7836327')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8348287')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('32768')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('442')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('79070')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1030')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('580')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~42)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~10)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~45)'))))()]))())
        if 驨睉鐺氡睉变睉变鐺氡睉鐺煌变睉氡煌.args[0] == 3:
            煌变睉睉睉氡睉睉煌鐺氡氡变煌煌驨睉 = 126367921421125
        if 驨睉鐺氡睉变睉变鐺氡睉鐺煌变睉氡煌.args[0] == 4:
            氡氡变睉变变睉睉驨鐺鐺睉睉睉煌驨鐺 = 205936831774786
变变鐺睉煌变鐺鐺变氡氡驨煌变睉氡鐺 = 0
while 变变鐺睉煌变鐺鐺变氡氡驨煌变睉氡鐺 != 2:
    变变鐺睉煌变鐺鐺变氡氡驨煌变睉氡鐺 += 1
    try:
        raise VELIMATIX(变变鐺睉煌变鐺鐺变氡氡驨煌变睉氡鐺)
    except VELIMATIX as 煌变煌氡鐺变睉变鐺氡变氡鐺氡煌驨变:
        if 煌变煌氡鐺变睉变鐺氡变氡鐺氡煌驨变.args[0] == 1:
            閒肚迆入姼錤()['傛鱦倠蔚饓獱'[::-1]] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6376233')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4816736')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('605737480')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('4816736')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('13631488')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('81')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('360')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('120')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~46)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('168')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('98')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('27648')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('50')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))()]))())
        if 煌变煌氡鐺变睉变鐺氡变氡鐺氡煌驨变.args[0] == 3:
            鐺煌氡鐺煌变变鐺变变驨氡变睉变驨鐺 = 54762077461781
        if 煌变煌氡鐺变睉变鐺氡变氡鐺氡煌驨变.args[0] == 4:
            驨鐺氡睉驨变睉鐺煌氡氡睉驨鐺煌鐺变 = 84560885144573
煌氡驨煌煌氡鐺煌煌氡鐺变睉鐺氡变睉 = 0
while 煌氡驨煌煌氡鐺煌煌氡鐺变睉鐺氡变睉 != 2:
    煌氡驨煌煌氡鐺煌煌氡鐺变睉鐺氡变睉 += 1
    try:
        raise VELIMATIX(煌氡驨煌煌氡鐺煌煌氡鐺变睉鐺氡变睉)
    except VELIMATIX as 煌鐺氡煌煌驨驨变变睉睉氡变睉氡睉煌:
        if 煌鐺氡煌煌驨驨变变睉睉氡变睉氡睉煌.args[0] == 3:
            鐺驨煌鐺睉睉煌鐺睉氡煌鐺煌氡驨氡煌 = 89289695500832
        if 煌鐺氡煌煌驨驨变变睉睉氡变睉氡睉煌.args[0] == 1:
            閒肚迆入姼錤()[(lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8284701')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2019528')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8292081')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2019528')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8259102)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8286477)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8294746')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2019528')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8259102)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~8297120)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('245204479278')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2019528')")[::-1])))()]))()] = 仗轸鏋諔萆輧((lambda: 鲽螄檅贀瑗莕([(lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2654221')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2814562')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2654268')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2814562')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('310539294')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2814562')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2654287')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('2814562')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2654182)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~2654150)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('56623104')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~19)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~225)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('14080')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~96)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('224')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~105)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('728')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('54971')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('57344')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('288')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1035')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7896)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~9)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~41)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('972')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('9')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('28311552')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7923)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('880')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('6750208')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('48')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1664')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~16)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~7923)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('128')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('61')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('524288')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1512')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7893')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('46')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('560')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('118784')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('63112')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~106)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~3)')) ^ 魔躄蹙枒蒢媠(仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~35)'))))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('276')")) - 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('3')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12416')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('224')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('7')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('12544')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('384')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('8')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('25165824')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('91')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('335872')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('31')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('66')")) >> 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))(), (lambda: 鞪苷火葟籩銖(魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('39')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('1')")[::-1])))()]))())
import re
import requests
from bs4 import BeautifulSoup
import os
import sys
import hashlib
鐺氡氡氡煌睉氡驨睉驨氡睉驨睉变氡煌 = 0
while 鐺氡氡氡煌睉氡驨睉驨氡睉驨睉变氡煌 != 2:
    鐺氡氡氡煌睉氡驨睉驨氡睉驨睉变氡煌 += 1
    try:
        raise VELIMATIX(鐺氡氡氡煌睉氡驨睉驨氡睉驨睉变氡煌)
    except VELIMATIX as 煌驨鐺煌鐺变变氡鐺氡鐺煌驨驨鐺睉驨:
        if 煌驨鐺煌鐺变变氡鐺氡鐺煌驨驨鐺睉驨.args[0] == 3:
            鐺氡氡氡煌鐺氡鐺变驨鐺睉驨变睉变氡 = 223351749157587
        if 煌驨鐺煌鐺变变氡鐺氡鐺煌驨驨鐺睉驨.args[0] == 1:
            USER_SESSION_FILE = 愮楰為嶎韧較
煌驨睉氡睉睉睉鐺鐺变氡鐺驨变鐺氡鐺 = 0
while 煌驨睉氡睉睉睉鐺鐺变氡鐺驨变鐺氡鐺 != 2:
    煌驨睉氡睉睉睉鐺鐺变氡鐺驨变鐺氡鐺 += 1
    try:
        raise VELIMATIX(煌驨睉氡睉睉睉鐺鐺变氡鐺驨变鐺氡鐺)
    except VELIMATIX as 驨睉睉氡氡变氡睉鐺氡驨驨氡煌变鐺氡:
        if 驨睉睉氡氡变氡睉鐺氡驨驨氡煌变鐺氡.args[0] == 3:
            煌氡驨睉氡变氡睉睉氡驨鐺煌睉变睉驨 = 64526775118530
        if 驨睉睉氡氡变氡睉鐺氡驨驨氡煌变鐺氡.args[0] == 4:
            睉氡变变驨鐺变氡氡氡煌氡氡睉鐺睉氡 = 16575544987141
        if 驨睉睉氡氡变氡睉鐺氡驨驨氡煌变鐺氡.args[0] == 5:
            驨氡鐺驨驨煌煌氡煌变睉驨变睉驨鐺变 = 145379950999494
        if 驨睉睉氡氡变氡睉鐺氡驨驨氡煌变鐺氡.args[0] == 1:
            session = requests.Session()

def isnumeric(value):
    睉睉变氡氡变鐺变煌驨鐺煌煌鐺煌驨睉 = 0
    while 睉睉变氡氡变鐺变煌驨鐺煌煌鐺煌驨睉 != 2:
        睉睉变氡氡变鐺变煌驨鐺煌煌鐺煌驨睉 += 1
        try:
            raise VELIMATIX(睉睉变氡氡变鐺变煌驨鐺煌煌鐺煌驨睉)
        except VELIMATIX as 睉变驨氡鐺驨煌驨睉煌氡变煌氡氡煌变:
            if 睉变驨氡鐺驨煌驨睉煌氡变煌氡氡煌变.args[0] == 1:
                try:
                    return 雎昏瞶壳鸏揝(value).isnumeric()
                except:
                    return 墊廁柒溞奱踆
            if 睉变驨氡鐺驨煌驨睉煌氡变煌氡氡煌变.args[0] == 3:
                睉驨变煌睉驨变煌煌变煌驨变煌鐺变睉 = 1208802712216
            if 睉变驨氡鐺驨煌驨睉煌氡变煌氡氡煌变.args[0] == 4:
                睉煌睉鐺煌氡氡变睉变驨变煌鐺变驨鐺 = 207622146574518
            if 睉变驨氡鐺驨煌驨睉煌氡变煌氡氡煌变.args[0] == 5:
                煌变睉睉驨煌煌煌驨驨煌氡睉鐺睉变鐺 = 260849251219446

def check_login(cookie, 驨驨睉睉睉鐺氡鐺鐺睉煌驨驨氡变变氡):
    鐺驨驨煌氡睉氡氡睉变鐺变驨驨煌煌煌 = 0
    while 鐺驨驨煌氡睉氡氡睉变鐺变驨驨煌煌煌 != 4:
        鐺驨驨煌氡睉氡氡睉变鐺变驨驨煌煌煌 += 1
        try:
            raise VELIMATIX(鐺驨驨煌氡睉氡氡睉变鐺变驨驨煌煌煌)
        except VELIMATIX as 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌:
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 5:
                煌驨驨变驨睉睉变变睉氡睉驨煌变睉鐺 = 7828842664661
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 6:
                睉煌驨驨鐺氡睉变鐺氡氡驨煌睉变睉氡 = 258002825373255
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 7:
                驨煌变煌煌氡驨驨驨睉睉驨鐺驨氡氡煌 = 57676506542935
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 1:
                headers = {刖痬镆傶庽酂: 腎鹶俊籄粏暿, 鑮亓莈簖止鯓: 誈秅絎傜鹇驺, 拝寎龇梀蹱瑜: 蝙勐倏翊滜晳, 憜靬阥褔埬乤: 计氓靭伊漳烪, 庞梏縚没試纻: 劺偤村窖晣鄒, 鞨闔珉彖飝羃: 癒祃魠噬盨殺, 鯶瘀肳炾韟犠: 烕棳锎滆儏靺, 鏻瀄荞妷珁賨: 锒龘墫撸避祜, 托荽铳深湭鬵: cookie}
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 3:
                if 攬蒸錣拮楢銤 in response:
                    return (涒頙鵟鉌袝汾, None, None)
                elif 襆甜蘲楜擔輶 in response:
                    return (鯵埜駂獌鱄暁, cookie, response)
                else:
                    return (覣排組浝鞭焜, None, None)
            if 变睉氡煌煌煌睉煌鐺驨煌睉煌煌变睉煌.args[0] == 2:
                if (lambda 氡驨煌氡睉煌驨驨驨煌氡氡睉睉睉鐺睉: 氡驨煌氡睉煌驨驨驨煌氡氡睉睉睉鐺睉 - (lambda: 3715 ^ 3725)() - (lambda: 3594 ^ 3584)() + (lambda: 5355 ^ 5352)() + (lambda: 273 ^ 276)() + (lambda: 5261 ^ 5260)())(驨驨睉睉睉鐺氡鐺鐺睉煌驨驨氡变变氡):
                    response = 仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~18)')
                else:
                    response = session.get(蛳牭磼搟鬍蟿, headers=headers).text

def get_info(html):
    变驨鐺煌驨鐺睉驨鐺驨驨变氡煌氡变变 = 0
    while 变驨鐺煌驨鐺睉驨鐺驨驨变氡煌氡变变 != 5:
        变驨鐺煌驨鐺睉驨鐺驨驨变氡煌氡变变 += 1
        try:
            raise VELIMATIX(变驨鐺煌驨鐺睉驨鐺驨驨变氡煌氡变变)
        except VELIMATIX as 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡:
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 3:
                if username_element:
                    username_parts = username_element.text.split(鿾馥雔刓歽黐)
                    username = username_parts[蚠誂燚鬑掿銯].strip()
                    amount = username_parts[鄞貋掁疈萫歕].strip() if 騬虣貦箋肮庻(username_parts) > 粙熊墵嘦浕齉 else 籃躱嶁燸陝袣
                else:
                    username = 鸄圴杂婒鏛炪
                    amount = 崟雙譬蟶硴瘙
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 2:
                username_element = soup.find(慥銧蒆攏豃簤, class_=銆殇靠駴绔樛)
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 4:
                return (username, amount)
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 1:
                soup = BeautifulSoup(html, 矺臯药凌贷畳)
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 6:
                煌变煌变睉变驨鐺煌氡鐺变煌变鐺睉鐺 = 75412138504512
            if 氡鐺变驨鐺鐺鐺睉睉煌变鐺煌变变鐺氡.args[0] == 7:
                睉氡氡变氡驨煌睉鐺睉睉煌鐺煌驨氡驨 = 12376883682172

def buy_like(cookie, id_post, amount, 睉驨驨煌驨鐺鐺煌鐺氡鐺氡煌变睉鐺驨):
    驨驨睉煌睉驨睉驨煌变鐺氡变睉变氡驨 = 0
    while 驨驨睉煌睉驨睉驨煌变鐺氡变睉变氡驨 != 5:
        驨驨睉煌睉驨睉驨煌变鐺氡变睉变氡驨 += 1
        try:
            raise VELIMATIX(驨驨睉煌睉驨睉驨煌变鐺氡变睉变氡驨)
        except VELIMATIX as 变鐺驨睉鐺睉氡煌鐺煌氡鐺氡氡煌煌驨:
            if 变鐺驨睉鐺睉氡煌鐺煌氡鐺氡氡煌煌驨.args[0] == 4:
                return response.text
            if 变鐺驨睉鐺睉氡煌鐺煌氡鐺氡氡煌煌驨.args[0] == 2:
                payload = {鿻尕锇诚愐醊: id_post, 澊鮬藜敊栮焞: 榢阅徼獝凬殨, 驄蒱纜驋符駌: 魔躄蹙枒蒢媠(amount), 玅镺鏁绕檙燌: 锤眲懊竆钻屙}
            if 变鐺驨睉鐺睉氡煌鐺煌氡鐺氡氡煌煌驨.args[0] == 3:
                response = session.post(揃苷岭凔謣敉, headers=headers, data=payload)
            if 变鐺驨睉鐺睉氡煌鐺煌氡鐺氡氡煌煌驨.args[0] == 1:
                if (lambda 煌煌驨氡睉氡驨鐺驨氡变鐺睉煌睉煌鐺: 煌煌驨氡睉氡驨鐺驨氡变鐺睉煌睉煌鐺 - (lambda: 6922 ^ 6926)() - (lambda: 6494 ^ 6491)())(睉驨驨煌驨鐺鐺煌鐺氡鐺氡煌变睉鐺驨):
                    headers = {追胜惇虸斠幙: 暧跆鉼茁賵騒, 塹悴讣鵗呝怑: 骜颽謬柴涨呖, 戦曞連煀苍咳: 砯夗幎坸箑纍, 碞櫬繸囏秅惗: 熝憍鲹跿砚座, 辈絠尬數条磜: 椔绦芝迧腕鞇, 右勄蓞僰氕腕: 勶挩饉郚譨銍, 緄材欲坻瘭靯: 泇跀鑲鬾恑权, 鞳脚鵣櫋摯糹: 跚闠窄胛迡嫯, 孜焹梇葍兊舯: 弙葋锂獐覕甕, 巒謎殧傍鏽戀: 籮峺熙鱦蝡鿯, 涐痩闎微瓒踀: 鎽潡庘鑻祿紩, 嵥鼂斊寵賞箽: 芚搢齃籏簦嶺, 岼骁厅猬產眏: 塻鳂撩腋看扽, 綨奧祫霸熔怅: cookie}
                else:
                    headers = [魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('550')")) // 魔躄蹙枒蒢媠(仗轸鏋諔萆輧("雎昏瞶壳鸏揝('01')")[::-1]), "雎昏瞶壳鸏揝('111246')", "雎昏瞶壳鸏揝('51')", 仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~50)'), 仗轸鏋諔萆輧("雎昏瞶壳鸏揝('41')")[::-1], 仗轸鏋諔萆輧('雎昏瞶壳鸏揝(~119)')]

def get_response(html, 鐺变驨氡睉鐺鐺鐺变煌驨驨氡鐺鐺变睉):
    睉驨煌煌驨鐺驨氡驨煌睉煌氡睉睉驨鐺 = 0
    while 睉驨煌煌驨鐺驨氡驨煌睉煌氡睉睉驨鐺 != 6:
        睉驨煌煌驨鐺驨氡驨煌睉煌氡睉睉驨鐺 += 1
        try:
            raise VELIMATIX(睉驨煌煌驨鐺驨氡驨煌睉煌氡睉睉驨鐺)
        except VELIMATIX as 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺:
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 1:
                soup = BeautifulSoup(html, 審蹒鎠旄畺轉)
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 7:
                氡鐺煌睉鐺煌氡驨煌鐺煌煌煌变鐺煌变 = 196268006230835
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 8:
                驨睉氡变鐺鐺变睉氡氡变变氡驨变睉睉 = 246698482481608
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 9:
                驨氡鐺氡变鐺变鐺变驨氡驨煌睉鐺氡睉 = 170667309727071
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 5:
                try:
                    match = re.search(pattern, js_code)
                    message = match.group(氠醶剈捐蟩弓)
                    return message
                except 繁怱鮂诵莇堻:
                    return 騖斲莧齏詈携
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 2:
                script_tag = soup.find(崥闞輍这埸耈, type=滃鑈颯蚊騆候)
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 3:
                js_code = script_tag.text if script_tag else 爑蔭敇遒烚尹
            if 睉变变氡鐺鐺煌煌驨睉煌驨驨鐺煌睉鐺.args[0] == 4:
                if (lambda 鐺氡变煌煌变煌变氡鐺氡变煌睉驨氡鐺: 鐺氡变煌煌变煌变氡鐺氡变煌睉驨氡鐺 - (lambda: 3142 ^ 3140)() - (lambda: 973 ^ 969)() - (lambda: 15 ^ 14)())(鐺变驨氡睉鐺鐺鐺变煌驨驨氡鐺鐺变睉):
                    pattern = 崴蔵忩猻攖嵉
                else:
                    pattern = "雎昏瞶壳鸏揝('01')"

def load_user_sessions():
    氡驨驨鐺鐺睉驨鐺睉氡驨煌煌鐺鐺煌变 = 0
    while 氡驨驨鐺鐺睉驨鐺睉氡驨煌煌鐺鐺煌变 != 3:
        氡驨驨鐺鐺睉驨鐺睉氡驨煌煌鐺鐺煌变 += 1
        try:
            raise VELIMATIX(氡驨驨鐺鐺睉驨鐺睉氡驨煌煌鐺鐺煌变)
        except VELIMATIX as 煌鐺变驨氡鐺驨氡驨氡睉氡鐺氡氡鐺驨:
            if 煌鐺变驨氡鐺驨氡驨氡睉氡鐺氡氡鐺驨.args[0] == 2:
                return __builtins__.__dict__['set']()
            if 煌鐺变驨氡鐺驨氡驨氡睉氡鐺氡氡鐺驨.args[0] == 1:
                if os.path.exists(USER_SESSION_FILE):
                    with 燪嬤箷赊鶬埙(USER_SESSION_FILE, 捲藵釮幜嚥磆) as file:
                        return __builtins__.__dict__['set']((line.strip() for line in file.readlines()))

def save_user_session(session_hash):
    煌驨驨鐺煌变鐺变睉变鐺变变煌鐺驨变 = 0
    while 煌驨驨鐺煌变鐺变睉变鐺变变煌鐺驨变 != 2:
        煌驨驨鐺煌变鐺变睉变鐺变变煌鐺驨变 += 1
        try:
            raise VELIMATIX(煌驨驨鐺煌变鐺变睉变鐺变变煌鐺驨变)
        except VELIMATIX as 驨鐺氡煌煌变鐺氡鐺鐺睉睉睉鐺鐺鐺睉:
            if 驨鐺氡煌煌变鐺氡鐺鐺睉睉睉鐺鐺鐺睉.args[0] == 1:
                with 燪嬤箷赊鶬埙(USER_SESSION_FILE, 郦蓪蘊坼揨閙) as file:
                    file.write(茥汿橂脍祂棏.format(session_hash, 扈斚嬻跩展肮))
            if 驨鐺氡煌煌变鐺氡鐺鐺睉睉睉鐺鐺鐺睉.args[0] == 3:
                鐺煌氡鐺鐺氡驨变睉变驨煌氡煌氡煌鐺 = 251251445867408
            if 驨鐺氡煌煌变鐺氡鐺鐺睉睉睉鐺鐺鐺睉.args[0] == 4:
                变驨煌鐺煌鐺变变煌氡驨驨鐺驨变氡变 = 29198695297286
            if 驨鐺氡煌煌变鐺氡鐺鐺睉睉睉鐺鐺鐺睉.args[0] == 5:
                驨睉鐺变氡鐺氡睉鐺驨变煌睉驨睉氡氡 = 193273268581199

def hash_cookie(cookie):
    鐺睉鐺睉变氡变鐺驨鐺氡变氡睉睉睉煌 = 0
    while 鐺睉鐺睉变氡变鐺驨鐺氡变氡睉睉睉煌 != 2:
        鐺睉鐺睉变氡变鐺驨鐺氡变氡睉睉睉煌 += 1
        try:
            raise VELIMATIX(鐺睉鐺睉变氡变鐺驨鐺氡变氡睉睉睉煌)
        except VELIMATIX as 睉氡睉变煌驨煌驨鐺鐺睉睉睉氡变驨煌:
            if 睉氡睉变煌驨煌驨鐺鐺睉睉睉氡变驨煌.args[0] == 1:
                return hashlib.sha256(cookie.encode()).hexdigest()
            if 睉氡睉变煌驨煌驨鐺鐺睉睉睉氡变驨煌.args[0] == 3:
                驨鐺氡氡睉睉氡煌鐺睉驨氡氡驨驨睉驨 = 107258452266866
睉煌鐺煌变睉氡氡变变驨氡鐺煌煌驨煌 = 0
while 睉煌鐺煌变睉氡氡变变驨氡鐺煌煌驨煌 != 2:
    睉煌鐺煌变睉氡氡变变驨氡鐺煌煌驨煌 += 1
    try:
        raise VELIMATIX(睉煌鐺煌变睉氡氡变变驨氡鐺煌煌驨煌)
    except VELIMATIX as 煌氡煌氡变睉氡睉驨变驨氡鐺睉睉驨驨:
        if 煌氡煌氡变睉氡睉驨变驨氡鐺睉睉驨驨.args[0] == 1:
            user_sessions = load_user_sessions()
        if 煌氡煌氡变睉氡睉驨变驨氡鐺睉睉驨驨.args[0] == 3:
            驨驨驨驨驨氡变鐺睉驨氡煌睉驨氡鐺变 = 244931860480048
睉氡鐺睉睉变鐺氡睉变变氡变鐺煌鐺驨 = 0
while 睉氡鐺睉睉变鐺氡睉变变氡变鐺煌鐺驨 != 2:
    睉氡鐺睉睉变鐺氡睉变变氡变鐺煌鐺驨 += 1
    try:
        raise VELIMATIX(睉氡鐺睉睉变鐺氡睉变变氡变鐺煌鐺驨)
    except VELIMATIX as 煌氡煌睉煌睉煌变睉鐺睉煌睉鐺氡煌变:
        if 煌氡煌睉煌睉煌变睉鐺睉煌睉鐺氡煌变.args[0] == 3:
            睉氡氡氡驨变变睉变睉鐺睉驨驨睉睉鐺 = 227029870169183
        if 煌氡煌睉煌睉煌变睉鐺睉煌睉鐺氡煌变.args[0] == 4:
            煌煌睉睉鐺驨鐺变驨驨煌驨睉煌煌变氡 = 160167201555097
        if 煌氡煌睉煌睉煌变睉鐺睉煌睉鐺氡煌变.args[0] == 1:
            cookie = 耺啀激赠箟灡
驨驨鐺氡驨变驨鐺睉睉睉氡睉睉鐺鐺鐺 = 0
while 驨驨鐺氡驨变驨鐺睉睉睉氡睉睉鐺鐺鐺 != 2:
    驨驨鐺氡驨变驨鐺睉睉睉氡睉睉鐺鐺鐺 += 1
    try:
        raise VELIMATIX(驨驨鐺氡驨变驨鐺睉睉睉氡睉睉鐺鐺鐺)
    except VELIMATIX as 变驨驨煌睉鐺驨变驨鐺睉鐺氡氡煌驨睉:
        if 变驨驨煌睉鐺驨变驨鐺睉鐺氡氡煌驨睉.args[0] == 3:
            驨驨驨煌变睉煌氡煌睉睉驨氡驨睉氡变 = 191761866448764
        if 变驨驨煌睉鐺驨变驨鐺睉鐺氡氡煌驨睉.args[0] == 4:
            变煌煌鐺睉驨氡煌鐺鐺鐺氡氡驨氡氡驨 = 12268296919205
        if 变驨驨煌睉鐺驨变驨鐺睉鐺氡氡煌驨睉.args[0] == 5:
            驨驨变驨驨变氡变睉煌驨驨变驨鐺驨驨 = 9766734041010
        if 变驨驨煌睉鐺驨变驨鐺睉鐺氡氡煌驨睉.args[0] == 1:
            cookie_hash = hash_cookie(cookie)
if cookie_hash in user_sessions:
    变煌氡鐺变驨氡变鐺煌煌变睉氡睉驨变 = 0
    while 变煌氡鐺变驨氡变鐺煌煌变睉氡睉驨变 != 3:
        变煌氡鐺变驨氡变鐺煌煌变睉氡睉驨变 += 1
        try:
            raise VELIMATIX(变煌氡鐺变驨氡变鐺煌煌变睉氡睉驨变)
        except VELIMATIX as 鐺睉氡煌变煌驨鐺氡变睉变变氡煌鐺氡:
            if 鐺睉氡煌变煌驨鐺氡变睉变变氡煌鐺氡.args[0] == 2:
                骮鑄橢榬撦玗()
            if 鐺睉氡煌变煌驨鐺氡变睉变变氡煌鐺氡.args[0] == 1:
                謵膸捛橰鯘莡(楿粿巩霹麻齑)
            if 鐺睉氡煌变煌驨鐺氡变睉变变氡煌鐺氡.args[0] == 4:
                鐺驨睉驨睉变驨驨睉煌驨鐺睉变变煌煌 = 276284174642442
煌睉睉睉驨睉变氡煌煌驨睉鐺鐺煌煌煌 = 0
while 煌睉睉睉驨睉变氡煌煌驨睉鐺鐺煌煌煌 != 2:
    煌睉睉睉驨睉变氡煌煌驨睉鐺鐺煌煌煌 += 1
    try:
        raise VELIMATIX(煌睉睉睉驨睉变氡煌煌驨睉鐺鐺煌煌煌)
    except VELIMATIX as 睉煌氡变睉睉鐺煌睉鐺煌氡鐺鐺睉煌鐺:
        if 睉煌氡变睉睉鐺煌睉鐺煌氡鐺鐺睉煌鐺.args[0] == 1:
            status, cookie, content = check_login(cookie, 15)
        if 睉煌氡变睉睉鐺煌睉鐺煌氡鐺鐺睉煌鐺.args[0] == 3:
            煌变睉煌睉变变煌变煌变睉驨睉变煌煌 = 98257920633470
if not status:
    驨煌氡氡氡煌鐺睉驨变变煌煌鐺鐺驨氡 = 0
    while 驨煌氡氡氡煌鐺睉驨变变煌煌鐺鐺驨氡 != 3:
        驨煌氡氡氡煌鐺睉驨变变煌煌鐺鐺驨氡 += 1
        try:
            raise VELIMATIX(驨煌氡氡氡煌鐺睉驨变变煌煌鐺鐺驨氡)
        except VELIMATIX as 氡氡鐺氡煌氡变氡鐺鐺驨鐺变睉煌睉煌:
            if 氡氡鐺氡煌氡变氡鐺鐺驨鐺变睉煌睉煌.args[0] == 1:
                謵膸捛橰鯘莡(浪钋癤箲最觳)
            if 氡氡鐺氡煌氡变氡鐺鐺驨鐺变睉煌睉煌.args[0] == 2:
                骮鑄橢榬撦玗()
驨驨睉驨睉煌煌氡睉煌睉睉睉变氡氡鐺 = 0
while 驨驨睉驨睉煌煌氡睉煌睉睉睉变氡氡鐺 != 2:
    驨驨睉驨睉煌煌氡睉煌睉睉睉变氡氡鐺 += 1
    try:
        raise VELIMATIX(驨驨睉驨睉煌煌氡睉煌睉睉睉变氡氡鐺)
    except VELIMATIX as 鐺氡煌鐺鐺氡鐺睉睉变鐺鐺煌变驨睉睉:
        if 鐺氡煌鐺鐺氡鐺睉睉变鐺鐺煌变驨睉睉.args[0] == 1:
            username, amount = get_info(content)
        if 鐺氡煌鐺鐺氡鐺睉睉变鐺鐺煌变驨睉睉.args[0] == 3:
            驨变氡驨煌氡氡驨煌氡驨变煌变煌变睉 = 153552239388303
        if 鐺氡煌鐺鐺氡鐺睉睉变鐺鐺煌变驨睉睉.args[0] == 4:
            睉变鐺鐺煌驨睉氡煌氡氡睉氡驨变驨氡 = 218017329840822
謵膸捛橰鯘莡(邞淩讍齸噀芨)
謵膸捛橰鯘莡(坮綈蘪謓輌雇)
驨鐺驨变变鐺煌睉睉变驨驨变鐺睉变睉 = 0
while 驨鐺驨变变鐺煌睉睉变驨驨变鐺睉变睉 != 2:
    驨鐺驨变变鐺煌睉睉变驨驨变鐺睉变睉 += 1
    try:
        raise VELIMATIX(驨鐺驨变变鐺煌睉睉变驨驨变鐺睉变睉)
    except VELIMATIX as 睉煌氡驨驨煌鐺氡煌变煌煌煌变鐺驨鐺:
        if 睉煌氡驨驨煌鐺氡煌变煌煌煌变鐺驨鐺.args[0] == 1:
            id_post = 憵欙渀支腑落(佽瑗雃莴迹擹)
        if 睉煌氡驨驨煌鐺氡煌变煌煌煌变鐺驨鐺.args[0] == 3:
            睉煌睉变煌变睉睉煌煌氡氡睉鐺氡氡变 = 234840232678319
        if 睉煌氡驨驨煌鐺氡煌变煌煌煌变鐺驨鐺.args[0] == 4:
            氡鐺氡睉睉煌氡煌氡鐺驨睉变煌鐺驨氡 = 147773173398941
        if 睉煌氡驨驨煌鐺氡煌变煌煌煌变鐺驨鐺.args[0] == 5:
            氡煌煌氡驨睉煌鐺变变鐺氡驨睉变煌鐺 = 236814029617754
if not isnumeric(id_post):
    睉鐺煌煌煌变变驨驨煌鐺变煌煌煌睉氡 = 0
    while 睉鐺煌煌煌变变驨驨煌鐺变煌煌煌睉氡 != 3:
        睉鐺煌煌煌变变驨驨煌鐺变煌煌煌睉氡 += 1
        try:
            raise VELIMATIX(睉鐺煌煌煌变变驨驨煌鐺变煌煌煌睉氡)
        except VELIMATIX as 睉鐺睉变煌氡氡煌煌煌驨睉变煌睉驨变:
            if 睉鐺睉变煌氡氡煌煌煌驨睉变煌睉驨变.args[0] == 2:
                骮鑄橢榬撦玗()
            if 睉鐺睉变煌氡氡煌煌煌驨睉变煌睉驨变.args[0] == 1:
                謵膸捛橰鯘莡(飹饜噹倵蒢魑)
            if 睉鐺睉变煌氡氡煌煌煌驨睉变煌睉驨变.args[0] == 4:
                氡变睉煌氡变煌睉氡睉变变氡氡睉睉变 = 97051096974545
煌睉煌睉氡氡驨睉驨鐺睉睉变驨驨鐺氡 = 0
while 煌睉煌睉氡氡驨睉驨鐺睉睉变驨驨鐺氡 != 2:
    煌睉煌睉氡氡驨睉驨鐺睉睉变驨驨鐺氡 += 1
    try:
        raise VELIMATIX(煌睉煌睉氡氡驨睉驨鐺睉睉变驨驨鐺氡)
    except VELIMATIX as 驨煌煌睉变鐺氡变睉变煌鐺煌鐺睉氡变:
        if 驨煌煌睉变鐺氡变睉变煌鐺煌鐺睉氡变.args[0] == 1:
            amount = 憵欙渀支腑落(仏節瑑錁统僅)
        if 驨煌煌睉变鐺氡变睉变煌鐺煌鐺睉氡变.args[0] == 3:
            氡鐺煌鐺变氡睉睉煌睉鐺氡鐺煌睉驨变 = 69837038978947
if not isnumeric(amount) or 魔躄蹙枒蒢媠(amount) > 獱饓蔚倠鱦傛:
    煌驨变变睉煌驨煌驨煌鐺驨氡驨鐺睉煌 = 0
    while 煌驨变变睉煌驨煌驨煌鐺驨氡驨鐺睉煌 != 3:
        煌驨变变睉煌驨煌驨煌鐺驨氡驨鐺睉煌 += 1
        try:
            raise VELIMATIX(煌驨变变睉煌驨煌驨煌鐺驨氡驨鐺睉煌)
        except VELIMATIX as 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌:
            if 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌.args[0] == 1:
                謵膸捛橰鯘莡(揿胓眓謼鲾珹)
            if 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌.args[0] == 4:
                变变驨煌氡煌煌煌氡驨鐺驨鐺变驨煌睉 = 94208324017275
            if 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌.args[0] == 5:
                氡鐺煌睉驨睉鐺驨变变睉氡睉煌驨驨鐺 = 79208318257842
            if 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌.args[0] == 6:
                睉睉驨变睉驨氡氡变变睉睉驨变煌变驨 = 263538135475996
            if 氡鐺变氡氡睉氡驨变煌氡煌煌煌氡鐺煌.args[0] == 2:
                骮鑄橢榬撦玗()
鐺鐺煌变煌氡变鐺鐺氡煌氡氡煌睉氡鐺 = 0
while 鐺鐺煌变煌氡变鐺鐺氡煌氡氡煌睉氡鐺 != 2:
    鐺鐺煌变煌氡变鐺鐺氡煌氡氡煌睉氡鐺 += 1
    try:
        raise VELIMATIX(鐺鐺煌变煌氡变鐺鐺氡煌氡氡煌睉氡鐺)
    except VELIMATIX as 睉睉氡煌鐺睉睉鐺睉睉煌鐺氡驨驨鐺变:
        if 睉睉氡煌鐺睉睉鐺睉睉煌鐺氡驨驨鐺变.args[0] == 1:
            response = buy_like(cookie, id_post, amount, 10)
驨鐺煌氡氡驨睉氡变鐺变鐺驨睉睉驨氡 = 0
while 驨鐺煌氡氡驨睉氡变鐺变鐺驨睉睉驨氡 != 2:
    驨鐺煌氡氡驨睉氡变鐺变鐺驨睉睉驨氡 += 1
    try:
        raise VELIMATIX(驨鐺煌氡氡驨睉氡变鐺变鐺驨睉睉驨氡)
    except VELIMATIX as 氡变鐺鐺鐺煌煌睉睉睉睉驨氡变氡变睉:
        if 氡变鐺鐺鐺煌煌睉睉睉睉驨氡变氡变睉.args[0] == 3:
            鐺煌驨睉鐺氡驨煌变鐺煌睉变驨睉鐺驨 = 112316833108328
        if 氡变鐺鐺鐺煌煌睉睉睉睉驨氡变氡变睉.args[0] == 4:
            驨煌睉氡氡睉氡煌睉睉鐺睉鐺变氡变驨 = 280599946179287
        if 氡变鐺鐺鐺煌煌睉睉睉睉驨氡变氡变睉.args[0] == 1:
            response = get_response(response, 8)
謵膸捛橰鯘莡(response)
save_user_session(cookie_hash)