class VELIMATIX(MemoryError):0
__import__('builtins').屨直談巴穡謐=getattr
__import__('builtins').去镃茉鵱漳碷=dir
__import__('builtins').等籍玗孬嬆壆=__import__
__import__('builtins').絭佨栋臡蚑舜=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('eurT'[::-1])])
__import__('builtins').蔶斋耈殍爜认=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('eslaF'[::-1])])
__import__('builtins').郶趧灚茕蝡油=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('loob'[::-1])])
__import__('builtins').遚齰跢侾湒擜=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('epyt'[::-1])])
__import__('builtins').碙鼪母犘攚媟=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rts'[::-1])])
__import__('builtins').躢泤嬦鍆餚瑖=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tni'[::-1])])
__import__('builtins').緧衏豔掹幺挣=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('cexe'[::-1])])
__import__('builtins').苂蒔铷鄦詍籀=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tnirp'[::-1])])
__import__('builtins').讴璩覾魮憔槁=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rttates'[::-1])])
__import__('builtins').礟絩嚭榽啓鶥=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('srav'[::-1])])
__import__('builtins').獒霯鹲妞瞣瀷=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rhc'[::-1])])
__import__('builtins').郸萠嵶妡蓦埗=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tsil'[::-1])])
__import__('builtins').崦砋荵橖糓甓=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('nepo'[::-1])])
__import__('builtins').去镃茉鵱漳碷=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rid'[::-1])])
__import__('builtins').熱秆挟棒蛣崼=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tcid'[::-1])])
__import__('builtins').塨函东仸记撚=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('elput'[::-1])])
__import__('builtins').釬鴊禭劗壖緿=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('mus'[::-1])])
__import__('builtins').粸瀩桂暘皇伔=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('detros'[::-1])])
__import__('builtins').衆当売腳薓墭=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('dnuor'[::-1])])
__import__('builtins').薅岮渉鱷泌鶐=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rper'[::-1])])
__import__('builtins').拐搫凸籇煁豌=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('wop'[::-1])])
__import__('builtins').蟒鑜鷎嫈枣夢=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tco'[::-1])])
__import__('builtins').嫃竢砥却脢矕=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('txena'[::-1])])
__import__('builtins').麶逬绰諾鈆肦=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('txen'[::-1])])
__import__('builtins').緑蓶趈鰟镇矅=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('nim'[::-1])])
__import__('builtins').畞騟熇焬駑壚=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('xam'[::-1])])
__import__('builtins').癹粿諶陥欗頎=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('slacol'[::-1])])
__import__('builtins').珴鿐峎嘏滩蝸=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('reti'[::-1])])
__import__('builtins').铌啣鐝萬幓瞌=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('ssalcbussi'[::-1])])
__import__('builtins').灡蕶菅畫岮篐=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrElacoLdnuobnU'[::-1])])
__import__('builtins').弌鳱珄秷凛馂=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('di'[::-1])])
__import__('builtins').醄濽癮袔鳻箴=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('hsah'[::-1])])
__import__('builtins').驐琀殒焿嗌訞=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rttasah'[::-1])])
__import__('builtins').坲惎贂宰叫杮=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tamrof'[::-1])])
__import__('builtins').瓨櫮榧炦藀璇=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('domvid'[::-1])])
__import__('builtins').筻鮭處艢冞綔=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rttaled'[::-1])])
__import__('builtins').屚舶磇豌迟愺=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('elballac'[::-1])])
__import__('builtins').輞餎羄惽抇渤=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tniopkaerb'[::-1])])
__import__('builtins').鮙狾鰵芖踗伶=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('nib'[::-1])])
__import__('builtins').倶種膫擘馵輔=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('iicsa'[::-1])])
__import__('builtins').闕趯塃鑷鞇諚=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('yna'[::-1])])
__import__('builtins').赁噡簉佩擠礡=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('lla'[::-1])])
__import__('builtins').脃溦閬駋玭褸=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('sba'[::-1])])
__import__('builtins').魓鮑锨雭蟂块=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('xeh'[::-1])])
__import__('builtins').敐磨闓硘鳊祻=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('desrever'[::-1])])
__import__('builtins').痆棖盌鲈河袴=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('dro'[::-1])])
__import__('builtins').葱艨犑侫鄝身=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tiuq'[::-1])])
__import__('builtins').崷沓偑眇蚧燢=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tixe'[::-1])])
__import__('builtins').曍漉矵弑疣嬾=屨直談巴穡謐(等籍玗孬嬆壆('stseuqer'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('stseuqer'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('stseuqer'[::-1])).index('teg'[::-1])])
__import__('builtins').鶎夌杄貔夯酀=屨直談巴穡謐(等籍玗孬嬆壆('stseuqer'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('stseuqer'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('stseuqer'[::-1])).index('tsop'[::-1])])
__import__('builtins').尜企缰勅誠燄=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('etaremune'[::-1])])
__import__('builtins').砢煠猷瘓幚顸=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('pam'[::-1])])
__import__('builtins').渐硍刌汯同霽=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrExatnyS'[::-1])])
__import__('builtins').燠榤愋揪侺笚=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEemaN'[::-1])])
__import__('builtins').駑裬探縡癳媝=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEdnuoFtoNeliF'[::-1])])
__import__('builtins').棷砘敍鸾霢葯=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEnoissimreP'[::-1])])
__import__('builtins').晹稝曯鶩腋連=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrESO'[::-1])])
__import__('builtins').铀漬婷藱坥孳=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEedocnEedocinU'[::-1])])
__import__('builtins').洺膐肺軌躴貲=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEtropmI'[::-1])])
__import__('builtins').臟鐾廂徝罓趗=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEedoceDedocinU'[::-1])])
__import__('builtins').栾塀淹遤禄鉐=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('egnar'[::-1])])
__import__('builtins').檶玠忆饈韖鱝=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('elipmoc'[::-1])])
__import__('builtins').肿铠壵毨诳篐=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('slabolg'[::-1])])
__import__('builtins').榐珊题酁产溏=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEetubirttA'[::-1])])
__import__('builtins').涟晊赱猵啾翿=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEdnuoFtoNeludoM'[::-1])])
__import__('builtins').荀凐蟅跟帻當=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('noitpecxE'[::-1])])
__import__('builtins').禉鷨蘬謆伞隸=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEeulaV'[::-1])])
__import__('builtins').寤垮怖缕蹤臀=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrExednI'[::-1])])
__import__('builtins').晔蟆惹考或潲=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tpurretnIdraobyeK'[::-1])])
__import__('builtins').沦傃諬凬寅滛=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('ecnatsnisi'[::-1])])
__import__('builtins').廸俟鈟鱔頇蛽=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('nel'[::-1])])
__import__('builtins').簛恕欀挐崗竲=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('tupni'[::-1])])
__import__('builtins').馚嬴襄謴糭蓳=屨直談巴穡謐(等籍玗孬嬆壆('lahsram'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('lahsram'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('lahsram'[::-1])).index('sdaol'[::-1])])
__import__('builtins').五檍秲悀愊為=馚嬴襄謴糭蓳(b'\xda\x00').join
__import__('builtins').柨靀枣颺運衻=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('taolf'[::-1])])
__import__('builtins').鍮货宏蚸欁鄨=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('rorrEFOE'[::-1])])
__import__('builtins').暗惷琕鏱儸慞=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('setyb'[::-1])])
__import__('builtins').翞蠰幮殶艦畇=屨直談巴穡謐(等籍玗孬嬆壆('sys'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('sys'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('sys'[::-1])).index('tixe'[::-1])])
__import__('builtins').隳泾馊腈珸譌=屨直談巴穡謐(等籍玗孬嬆壆('snitliub'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('snitliub'[::-1])).index('lave'[::-1])])
__import__('builtins').式郋璸彂佧箶=屨直談巴穡謐(等籍玗孬嬆壆('bilz'[::-1]),去镃茉鵱漳碷(等籍玗孬嬆壆('bilz'[::-1]))[去镃茉鵱漳碷(等籍玗孬嬆壆('bilz'[::-1])).index('sserpmoced'[::-1])])
驋庄驋睇壠郚痄痄驋郚壠郚睇痄睇睇驋 = 0
while 驋庄驋睇壠郚痄痄驋郚壠郚睇痄睇睇驋 != 2:
    驋庄驋睇壠郚痄痄驋郚壠郚睇痄睇睇驋 += 1
    try:
        raise VELIMATIX(驋庄驋睇壠郚痄痄驋郚壠郚睇痄睇睇驋)
    except VELIMATIX as 痄庄壠郚壠庄庄睇睇驋庄驋郚郚驋睇睇:
        if 痄庄壠郚壠庄庄睇睇驋庄驋郚郚驋睇睇.args[0] == 3:
            壠睇痄痄驋睇郚驋壠庄驋驋睇壠郚壠郚 = 245761855592987
        if 痄庄壠郚壠庄庄睇睇驋庄驋郚郚驋睇睇.args[0] == 4:
            壠驋驋壠庄壠壠郚庄痄痄庄壠痄睇壠痄 = 96163443809862
        if 痄庄壠郚壠庄庄睇睇驋庄驋郚郚驋睇睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106237454070')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5015604')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4065105)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4093818)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4065105)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4085126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4102705')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5015604')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('142008320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('468900')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8909464')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5249098')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56098816')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2299')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('931')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2280')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('135')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('741')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))())
睇痄睇痄睇睇驋郚壠郚驋痄壠睇庄壠驋 = 0
while 睇痄睇痄睇睇驋郚壠郚驋痄壠睇庄壠驋 != 2:
    睇痄睇痄睇睇驋郚壠郚驋痄壠睇庄壠驋 += 1
    try:
        raise VELIMATIX(睇痄睇痄睇睇驋郚壠郚驋痄壠睇庄壠驋)
    except VELIMATIX as 郚庄庄睇郚庄睇睇睇郚痄驋痄庄痄郚壠:
        if 郚庄庄睇郚庄睇睇睇郚痄驋痄庄痄郚壠.args[0] == 1:
            礟絩嚭榽啓鶥()['嵥晤谿賿渏氞'[::-1]] = not 郶趧灚茕蝡油(碙鼪母犘攚媟(蔶斋耈殍爜认))
痄壠壠壠痄庄睇郚痄驋睇郚郚庄睇庄驋 = 0
while 痄壠壠壠痄庄睇郚痄驋睇郚郚庄睇庄驋 != 2:
    痄壠壠壠痄庄睇郚痄驋睇郚郚庄睇庄驋 += 1
    try:
        raise VELIMATIX(痄壠壠壠痄庄睇郚痄驋睇郚郚庄睇庄驋)
    except VELIMATIX as 郚睇壠壠壠庄庄壠壠驋郚郚壠驋庄痄壠:
        if 郚睇壠壠壠庄庄壠壠驋郚郚壠驋庄痄壠.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('18455552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('304587')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35153)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1333526528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('34621440')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2819489792')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3081737')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8961803')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3081698)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3081635)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('305088102')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8961803')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12672')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))()]))())
睇庄睇郚痄壠壠痄郚庄郚睇驋驋郚痄庄 = 0
while 睇庄睇郚痄壠壠痄郚庄郚睇驋驋郚痄庄 != 2:
    睇庄睇郚痄壠壠痄郚庄郚睇驋驋郚痄庄 += 1
    try:
        raise VELIMATIX(睇庄睇郚痄壠壠痄郚庄郚睇驋驋郚痄庄)
    except VELIMATIX as 壠睇睇驋庄郚驋庄郚睇庄睇痄睇郚庄痄:
        if 壠睇睇驋庄郚驋庄郚睇庄睇痄睇郚庄痄.args[0] == 3:
            痄庄郚郚痄庄郚郚壠壠驋睇睇壠驋郚驋 = 15433469082353
        if 壠睇睇驋庄郚驋庄郚睇庄睇痄睇郚庄痄.args[0] == 4:
            壠郚庄郚壠壠痄痄睇痄睇驋痄壠睇郚睇 = 174899922682743
        if 壠睇睇驋庄郚驋庄郚睇庄睇痄睇郚庄痄.args[0] == 1:
            礟絩嚭榽啓鶥()['纽艊區嶼礨墍'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('146342391')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9632573')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3752485')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9632573')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3752369)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3752404)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7864320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('132')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~63)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('132')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27904')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('864')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('776')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14680064')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1904')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('210')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('100')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('97')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6912')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2818048')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~124)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('720896')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~111)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('917504')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('525')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('430080')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('708')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1356')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1998848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~63)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~54)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1575')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14286848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1649')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('64')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2006')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('485')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('595')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('505')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('220')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('545')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6592')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('606')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('282')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('672')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('50')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('282')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('252')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('354')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~119)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('366')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12582912')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('828')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1008')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11534336')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('126')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101376')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1160')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1050')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1050')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1030')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11796480')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1818')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2160')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1782')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1872')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49664')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('990')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('909')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('531')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1933312')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('75')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1372')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('714')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('30932992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1808')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('23552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('450560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('507')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
郚驋睇驋驋郚庄壠壠睇庄痄庄睇痄郚驋 = 0
while 郚驋睇驋驋郚庄壠壠睇庄痄庄睇痄郚驋 != 2:
    郚驋睇驋驋郚庄壠壠睇庄痄庄睇痄郚驋 += 1
    try:
        raise VELIMATIX(郚驋睇驋驋郚庄壠壠睇庄痄庄睇痄郚驋)
    except VELIMATIX as 郚庄驋庄痄庄痄庄睇睇庄郚驋驋睇痄睇:
        if 郚庄驋庄痄庄痄庄睇睇庄郚驋驋睇痄睇.args[0] == 3:
            睇郚庄郚驋睇驋睇壠睇郚睇驋睇郚郚痄 = 91809923314153
        if 郚庄驋庄痄庄痄庄睇睇庄郚驋驋睇痄睇.args[0] == 4:
            痄庄庄壠睇郚睇睇驋庄郚痄睇壠睇壠睇 = 65701469549329
        if 郚庄驋庄痄庄痄庄睇睇庄郚驋驋睇痄睇.args[0] == 5:
            郚驋睇驋壠壠睇驋驋郚壠郚痄郚郚驋壠 = 264484052835997
        if 郚庄驋庄痄庄痄庄睇睇庄郚驋驋睇痄睇.args[0] == 1:
            礟絩嚭榽啓鶥()['椱褑鐹胋磻堝'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9814403)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9814436)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9814518')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3044189')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3244032')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1560')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~122)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3136')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2555904')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))()]))())
庄驋壠郚郚睇驋痄庄郚痄壠驋睇壠痄睇 = 0
while 庄驋壠郚郚睇驋痄庄郚痄壠驋睇壠痄睇 != 2:
    庄驋壠郚郚睇驋痄庄郚痄壠驋睇壠痄睇 += 1
    try:
        raise VELIMATIX(庄驋壠郚郚睇驋痄庄郚痄壠驋睇壠痄睇)
    except VELIMATIX as 壠驋驋庄痄驋壠庄驋庄庄驋郚郚郚庄壠:
        if 壠驋驋庄痄驋壠庄驋庄庄驋郚郚郚庄壠.args[0] == 1:
            礟絩嚭榽啓鶥()['齞姊韩嵡踾巠'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2555904')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4128768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~55)'))))()]))())
        if 壠驋驋庄痄驋壠庄驋庄庄驋郚郚郚庄壠.args[0] == 3:
            庄睇郚壠壠壠庄庄睇痄驋庄庄痄痄壠痄 = 234138067306319
        if 壠驋驋庄痄驋壠庄驋庄庄驋郚郚郚庄壠.args[0] == 4:
            壠驋痄痄驋郚庄睇睇驋痄壠壠壠庄驋郚 = 157721793650701
        if 壠驋驋庄痄驋壠庄驋庄庄驋郚郚郚庄壠.args[0] == 5:
            驋驋郚壠痄痄壠痄驋庄痄庄驋壠壠壠壠 = 38345928390336
驋痄睇壠痄郚痄壠驋睇睇痄庄庄庄庄睇 = 0
while 驋痄睇壠痄郚痄壠驋睇睇痄庄庄庄庄睇 != 2:
    驋痄睇壠痄郚痄壠驋睇睇痄庄庄庄庄睇 += 1
    try:
        raise VELIMATIX(驋痄睇壠痄郚痄壠驋睇睇痄庄庄庄庄睇)
    except VELIMATIX as 痄郚郚驋壠壠郚壠睇驋痄壠庄壠痄痄郚:
        if 痄郚郚驋壠壠郚壠睇驋痄壠庄壠痄痄郚.args[0] == 1:
            礟絩嚭榽啓鶥()['贉猚翵綯廳籡'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122425992')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8219313')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3139128)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3139147)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3139128)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3139165)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('202752')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6815744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('360')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('291')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('432')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118784')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26738688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2052')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('702')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))()]))())
痄驋壠郚痄郚驋庄庄睇驋庄壠痄睇壠庄 = 0
while 痄驋壠郚痄郚驋庄庄睇驋庄壠痄睇壠庄 != 2:
    痄驋壠郚痄郚驋庄庄睇驋庄壠痄睇壠庄 += 1
    try:
        raise VELIMATIX(痄驋壠郚痄郚驋庄庄睇驋庄壠痄睇壠庄)
    except VELIMATIX as 驋驋痄痄痄壠痄睇壠睇痄庄壠庄痄驋郚:
        if 驋驋痄痄痄壠痄睇壠睇痄庄壠庄痄驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()['廘倦蝐酅恲钤'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('192955698')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2857494')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('168217788')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2857494')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4947582)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4947519)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4947582)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4947472)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('494758200')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2857494')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('564024348')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2857494')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29097984')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1680')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('38')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('43')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))()]))())
痄痄睇睇睇睇痄壠驋痄睇壠痄庄痄痄驋 = 0
while 痄痄睇睇睇睇痄壠驋痄睇壠痄庄痄痄驋 != 2:
    痄痄睇睇睇睇痄壠驋痄睇壠痄庄痄痄驋 += 1
    try:
        raise VELIMATIX(痄痄睇睇睇睇痄壠驋痄睇壠痄庄痄痄驋)
    except VELIMATIX as 睇郚郚壠郚睇痄庄驋痄郚驋郚郚庄驋痄:
        if 睇郚郚壠郚睇痄庄驋痄郚驋郚郚庄驋痄.args[0] == 1:
            礟絩嚭榽啓鶥()['萱芔蒠沭晪鵏'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2928330)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2928365)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1916928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('448')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('194')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('200')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('202')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('210')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('198')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~119)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('808')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('135')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('808')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('351')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('124')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~122)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))())
        if 睇郚郚壠郚睇痄庄驋痄郚驋郚郚庄驋痄.args[0] == 3:
            驋壠郚庄壠痄痄痄郚郚睇郚痄庄驋庄痄 = 83570273694729
郚郚壠睇驋壠睇郚庄壠郚痄驋睇庄痄睇 = 0
while 郚郚壠睇驋壠睇郚庄壠郚痄驋睇庄痄睇 != 2:
    郚郚壠睇驋壠睇郚庄壠郚痄驋睇庄痄睇 += 1
    try:
        raise VELIMATIX(郚郚壠睇驋壠睇郚庄壠郚痄驋睇庄痄睇)
    except VELIMATIX as 庄庄睇壠驋驋睇庄庄睇睇壠郚驋驋驋郚:
        if 庄庄睇壠驋驋睇庄庄睇睇壠郚驋驋驋郚.args[0] == 3:
            驋睇睇痄睇睇壠庄郚壠郚壠痄睇痄睇痄 = 209498070922657
        if 庄庄睇壠驋驋睇庄庄睇睇壠郚驋驋驋郚.args[0] == 4:
            驋痄痄郚壠睇痄驋驋壠驋庄睇痄睇壠庄 = 61285768417245
        if 庄庄睇壠驋驋睇庄庄睇睇壠郚驋驋驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('148070400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21661696')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25015')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~31219)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26342400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~24435)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('638976')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('686')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))()]))())
痄庄郚庄痄驋睇驋睇郚壠庄痄痄睇睇痄 = 0
while 痄庄郚庄痄驋睇驋睇郚壠庄痄痄睇睇痄 != 2:
    痄庄郚庄痄驋睇驋睇郚壠庄痄痄睇睇痄 += 1
    try:
        raise VELIMATIX(痄庄郚庄痄驋睇驋睇郚壠庄痄痄睇睇痄)
    except VELIMATIX as 郚痄驋壠庄睇睇壠壠睇庄驋壠驋庄睇睇:
        if 郚痄驋壠庄睇睇壠壠睇庄驋壠驋庄睇睇.args[0] == 3:
            睇壠庄庄睇郚驋郚睇庄痄壠庄壠郚痄睇 = 113486088429370
        if 郚痄驋壠庄睇睇壠壠睇庄驋壠驋庄睇睇.args[0] == 4:
            睇痄郚驋郚痄驋壠睇庄驋痄壠驋睇郚郚 = 79832664090481
        if 郚痄驋壠庄睇睇壠壠睇庄驋壠驋庄睇睇.args[0] == 1:
            礟絩嚭榽啓鶥()['妌辉訢鄣牱寋'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3566354)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3566389)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7536640')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('297')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('230')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('475136')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))()]))())
睇庄郚庄痄郚庄壠驋睇壠壠痄睇驋庄壠 = 0
while 睇庄郚庄痄郚庄壠驋睇壠壠痄睇驋庄壠 != 2:
    睇庄郚庄痄郚庄壠驋睇壠壠痄睇驋庄壠 += 1
    try:
        raise VELIMATIX(睇庄郚庄痄郚庄壠驋睇壠壠痄睇驋庄壠)
    except VELIMATIX as 壠郚睇壠壠痄痄痄痄痄郚驋驋驋痄壠驋:
        if 壠郚睇壠壠痄痄痄痄痄郚驋驋驋痄壠驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('165769938553')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3293614')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4163923)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4133393)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133503699226')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3293614')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1450048')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20395')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33609)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('40620333')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041547)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041656)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101030059')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041547)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041638)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1041648')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46869615')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115611717')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1041661')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1041652')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041547)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1041644)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1041652')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1041657')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7451401')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2555904')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))()]))())
        if 壠郚睇壠壠痄痄痄痄痄郚驋驋驋痄壠驋.args[0] == 3:
            驋壠庄庄郚驋郚庄庄郚痄睇郚壠睇睇庄 = 174901770038191
痄睇郚郚庄壠驋痄郚郚壠睇驋驋郚睇郚 = 0
while 痄睇郚郚庄壠驋痄郚郚壠睇驋驋郚睇郚 != 2:
    痄睇郚郚庄壠驋痄郚郚壠睇驋驋郚睇郚 += 1
    try:
        raise VELIMATIX(痄睇郚郚庄壠驋痄郚郚壠睇驋驋郚睇郚)
    except VELIMATIX as 郚庄庄庄睇驋驋痄驋睇痄壠驋壠庄郚驋:
        if 郚庄庄庄睇驋驋痄驋睇痄壠驋壠庄郚驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3110950)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3081751)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3133637')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0590113')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118141437200')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0590113')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3110950)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3086800)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3110950)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3142999)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3110950)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3138229)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('89343774')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6680922')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2290866)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2290881)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~47)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1584')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('180')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('28416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))()]))())
睇庄驋驋庄睇壠睇郚睇壠壠郚睇睇壠驋 = 0
while 睇庄驋驋庄睇壠睇郚睇壠壠郚睇睇壠驋 != 2:
    睇庄驋驋庄睇壠睇郚睇壠壠郚睇睇壠驋 += 1
    try:
        raise VELIMATIX(睇庄驋驋庄睇壠睇郚睇壠壠郚睇睇壠驋)
    except VELIMATIX as 驋驋驋睇郚驋庄壠痄驋睇郚痄庄睇庄驋:
        if 驋驋驋睇郚驋庄壠痄驋睇郚痄庄睇庄驋.args[0] == 1:
            礟絩嚭榽啓鶥()['翘莮氭瀟愕抧'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4749302')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3629474')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4749263)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4749217)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25427968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2124')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1890')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~117)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))()]))())
郚睇驋睇庄郚痄痄痄庄驋壠郚驋驋庄睇 = 0
while 郚睇驋睇庄郚痄痄痄庄驋壠郚驋驋庄睇 != 2:
    郚睇驋睇庄郚痄痄痄庄驋壠郚驋驋庄睇 += 1
    try:
        raise VELIMATIX(郚睇驋睇庄郚痄痄痄庄驋壠郚驋驋庄睇)
    except VELIMATIX as 驋痄痄痄壠痄痄郚睇驋驋驋庄庄驋痄驋:
        if 驋痄痄痄壠痄痄郚睇驋驋驋庄庄驋痄驋.args[0] == 3:
            壠驋郚壠庄驋痄痄壠庄睇睇郚壠壠睇庄 = 156482937756177
        if 驋痄痄痄壠痄痄郚睇驋驋驋庄庄驋痄驋.args[0] == 4:
            庄驋痄睇驋痄郚痄驋壠睇驋痄痄睇壠郚 = 219519481189267
        if 驋痄痄痄壠痄痄郚睇驋驋驋庄庄驋痄驋.args[0] == 5:
            庄睇驋庄痄睇驋庄壠壠庄痄庄睇庄驋郚 = 182735503915197
        if 驋痄痄痄壠痄痄郚睇驋驋驋庄庄驋痄驋.args[0] == 1:
            礟絩嚭榽啓鶥()['扗猖喑甴蚯蟩'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7427052')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3107247')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7427013)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7426998)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7427013)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7426976)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('735274287')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3107247')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7427058')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3107247')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('757555326')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3107247')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7427013)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7426976)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59392')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('936')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('909')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~122)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1044')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))())
庄郚驋庄驋庄壠睇庄郚郚庄郚郚驋睇郚 = 0
while 庄郚驋庄驋庄壠睇庄郚郚庄郚郚驋睇郚 != 2:
    庄郚驋庄驋庄壠睇庄郚郚庄郚郚驋睇郚 += 1
    try:
        raise VELIMATIX(庄郚驋庄驋庄壠睇庄郚郚庄郚郚驋睇郚)
    except VELIMATIX as 庄痄痄痄痄郚郚痄痄睇驋睇驋痄壠壠睇:
        if 庄痄痄痄痄郚郚痄痄睇驋睇驋痄壠壠睇.args[0] == 3:
            壠郚驋庄痄庄睇郚驋睇驋睇郚痄痄庄庄 = 163251070150454
        if 庄痄痄痄痄郚郚痄痄睇驋睇驋痄壠壠睇.args[0] == 4:
            睇驋庄驋睇郚庄壠郚庄睇壠睇郚庄睇壠 = 86834032356451
        if 庄痄痄痄痄郚郚痄痄睇驋睇驋痄壠壠睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7953167)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7930720)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('228534253745')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7613597')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7980876')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7613597')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('10076160')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21303918592')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('605549')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('146485365')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5306573')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('375603500')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5306573')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58195968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('234')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))()]))())
郚驋壠郚壠壠驋庄驋睇壠壠郚痄睇郚痄 = 0
while 郚驋壠郚壠壠驋庄驋睇壠壠郚痄睇郚痄 != 2:
    郚驋壠郚壠壠驋庄驋睇壠壠郚痄睇郚痄 += 1
    try:
        raise VELIMATIX(郚驋壠郚壠壠驋庄驋睇壠壠郚痄睇郚痄)
    except VELIMATIX as 庄驋庄庄驋睇睇郚壠壠郚郚郚庄睇睇庄:
        if 庄驋庄庄驋睇睇郚壠壠郚郚郚庄睇睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2476734')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1289342')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2460974')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1289342')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2468163')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1289342')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90968725985')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1289342')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('657760')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32661)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('298594647')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3726567')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7656370')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3726567')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12672')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('784')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('812')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1474560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1620')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('794624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1339')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('479232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6592')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('43')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))()]))())
壠睇睇庄驋驋驋壠痄睇壠睇驋痄睇庄痄 = 0
while 壠睇睇庄驋驋驋壠痄睇壠睇驋痄睇庄痄 != 2:
    壠睇睇庄驋驋驋壠痄睇壠睇驋痄睇庄痄 += 1
    try:
        raise VELIMATIX(壠睇睇庄驋驋驋壠痄睇壠睇驋痄睇庄痄)
    except VELIMATIX as 痄郚痄郚睇庄壠驋痄庄驋郚睇驋睇睇痄:
        if 痄郚痄郚睇庄壠驋痄庄驋郚睇驋睇睇痄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6173753344')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('308420608')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~21402)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33349)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('510510')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('24715')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3931708)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3931675)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3931708)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3931722)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('412829340')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8071393')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2880')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('516')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('468')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~42)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('708')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1130')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~58)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1507328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3648')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('88')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('102')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~44)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~71)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('83')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~58)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('62')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~49)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('226')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1536')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~43)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('880')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('450560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1020')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~95)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~55)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('73')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3072')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~40)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('884736')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('616')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('124')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~53)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('75')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12582912')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12058624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('702')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))()]))())
郚睇睇郚庄郚睇痄痄壠驋驋壠驋驋睇痄 = 0
while 郚睇睇郚庄郚睇痄痄壠驋驋壠驋驋睇痄 != 2:
    郚睇睇郚庄郚睇痄痄壠驋驋壠驋驋睇痄 += 1
    try:
        raise VELIMATIX(郚睇睇郚庄郚睇痄痄壠驋驋壠驋驋睇痄)
    except VELIMATIX as 郚痄痄睇驋驋郚睇郚壠睇驋睇郚睇庄驋:
        if 郚痄痄睇驋驋郚睇郚壠睇驋睇郚睇庄驋.args[0] == 1:
            礟絩嚭榽啓鶥()['桨躒袐翛涡灒'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13696')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('735')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))()]))())
        if 郚痄痄睇驋驋郚睇郚壠睇驋睇郚睇庄驋.args[0] == 3:
            庄郚郚痄睇壠郚驋庄痄驋郚睇郚痄痄驋 = 206407655773856
睇痄壠痄壠睇郚驋驋睇郚郚驋睇郚壠郚 = 0
while 睇痄壠痄壠睇郚驋驋睇郚郚驋睇郚壠郚 != 2:
    睇痄壠痄壠睇郚驋驋睇郚郚驋睇郚壠郚 += 1
    try:
        raise VELIMATIX(睇痄壠痄壠睇郚驋驋睇郚郚驋睇郚壠郚)
    except VELIMATIX as 痄驋睇庄驋庄睇痄庄痄驋痄睇郚壠郚痄:
        if 痄驋睇庄驋庄睇痄庄痄驋痄睇郚壠郚痄.args[0] == 1:
            礟絩嚭榽啓鶥()['淧揂爗傈徔心'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('784')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('805')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7602176')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~62)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('799')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120832')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('491520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1464')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6553600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3360')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('210944')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1030')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('390')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))()]))())
        if 痄驋睇庄驋庄睇痄庄痄驋痄睇郚壠郚痄.args[0] == 3:
            睇痄壠郚壠庄庄壠驋驋郚驋壠庄庄庄驋 = 97922021554179
        if 痄驋睇庄驋庄睇痄庄痄驋痄睇郚壠郚痄.args[0] == 4:
            庄睇痄郚驋郚痄郚驋痄壠睇痄壠驋睇郚 = 168297676708970
        if 痄驋睇庄驋庄睇痄庄痄驋痄睇郚壠郚痄.args[0] == 5:
            庄痄庄睇郚壠壠痄壠驋壠驋痄壠郚郚驋 = 230991568568001
痄驋痄痄痄庄郚壠痄驋驋郚壠郚睇壠驋 = 0
while 痄驋痄痄痄庄郚壠痄驋驋郚壠郚睇壠驋 != 2:
    痄驋痄痄痄庄郚壠痄驋驋郚壠郚睇壠驋 += 1
    try:
        raise VELIMATIX(痄驋痄痄痄庄郚壠痄驋驋郚壠郚睇壠驋)
    except VELIMATIX as 痄痄驋郚庄庄郚驋驋睇驋驋郚痄驋郚郚:
        if 痄痄驋郚庄庄郚驋驋睇驋驋郚痄驋郚郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6547139)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6523038)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6547139)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6512788)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6547139)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6521397)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6576912')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9317456')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6573942')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9317456')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('171934417279')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9317456')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1088')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14720')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3309568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1260')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1160')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('160')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('204')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~119)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6336')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('950272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1443')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1430')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('533')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~40)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('792')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('950272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1443')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1352')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26738688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('576')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('96')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('42')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('94')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('156')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~34)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('50')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('43')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~57)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('68')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))()]))())
驋睇壠睇驋驋壠驋驋壠郚睇痄壠庄壠庄 = 0
while 驋睇壠睇驋驋壠驋驋壠郚睇痄壠庄壠庄 != 2:
    驋睇壠睇驋驋壠驋驋壠郚睇痄壠庄壠庄 += 1
    try:
        raise VELIMATIX(驋睇壠睇驋驋壠驋驋壠郚睇痄壠庄壠庄)
    except VELIMATIX as 壠庄庄睇睇庄壠壠痄庄驋痄睇庄郚痄驋:
        if 壠庄庄睇睇庄壠壠痄庄驋痄睇庄郚痄驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8041960)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8045007)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8041960)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8010500)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('167538152680')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0691408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('182745499040')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0691408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8041960)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8007068)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8079824')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0691408')")[::-1])))()]))()] = not 郶趧灚茕蝡油(碙鼪母犘攚媟(蔶斋耈殍爜认))
痄郚壠驋睇痄睇痄睇壠睇睇郚郚睇壠庄 = 0
while 痄郚壠驋睇痄睇痄睇壠睇睇郚郚睇壠庄 != 2:
    痄郚壠驋睇痄睇痄睇壠睇睇郚郚睇壠庄 += 1
    try:
        raise VELIMATIX(痄郚壠驋睇痄睇痄睇壠睇睇郚郚睇壠庄)
    except VELIMATIX as 壠郚郚庄睇庄壠郚庄睇痄壠壠睇痄驋郚:
        if 壠郚郚庄睇庄壠郚庄睇痄壠壠睇痄驋郚.args[0] == 3:
            庄驋痄睇庄驋睇睇壠郚痄庄庄睇壠驋驋 = 82997830880274
        if 壠郚郚庄睇庄壠郚庄睇痄壠壠睇痄驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('228674507448')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6518238')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('294841706868')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6518238')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8328156)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8351088)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('319584658344')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6518238')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8359826')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6518238')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5404622848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('279')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1813')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('721')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4194304')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('30670848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7863')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('319488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
睇痄郚庄庄痄驋睇睇壠痄郚壠庄郚痄睇 = 0
while 睇痄郚庄庄痄驋睇睇壠痄郚壠庄郚痄睇 != 2:
    睇痄郚庄庄痄驋睇睇壠痄郚壠庄郚痄睇 += 1
    try:
        raise VELIMATIX(睇痄郚庄庄痄驋睇睇壠痄郚壠庄郚痄睇)
    except VELIMATIX as 庄郚驋睇痄驋郚睇郚痄驋睇庄郚郚庄郚:
        if 庄郚驋睇痄驋郚睇郚痄驋睇庄郚郚庄郚.args[0] == 1:
            礟絩嚭榽啓鶥()['鍖戧鉺扼旄臮'[::-1]] = 郶趧灚茕蝡油(~蔶斋耈殍爜认 or (絭佨栋臡蚑舜 and 蔶斋耈殍爜认))
驋庄睇睇痄驋壠驋驋庄郚郚庄庄痄睇驋 = 0
while 驋庄睇睇痄驋壠驋驋庄郚郚庄庄痄睇驋 != 2:
    驋庄睇睇痄驋壠驋驋庄郚郚庄庄痄睇驋 += 1
    try:
        raise VELIMATIX(驋庄睇睇痄驋壠驋驋庄郚郚庄庄痄睇驋)
    except VELIMATIX as 驋庄睇庄庄壠睇壠庄庄驋痄郚庄驋庄壠:
        if 驋庄睇庄庄壠睇壠庄庄驋痄郚庄驋庄壠.args[0] == 1:
            礟絩嚭榽啓鶥()['鍚蓟嵩狑啲淿'[::-1]] = not 郶趧灚茕蝡油(碙鼪母犘攚媟(蔶斋耈殍爜认))
        if 驋庄睇庄庄壠睇壠庄庄驋痄郚庄驋庄壠.args[0] == 3:
            庄睇庄驋庄壠痄驋壠睇睇壠壠郚庄郚睇 = 197126398467474
        if 驋庄睇庄庄壠睇壠庄庄驋痄郚庄驋庄壠.args[0] == 4:
            睇庄壠睇壠庄睇壠痄睇睇郚驋庄痄郚庄 = 118331721094757
        if 驋庄睇庄庄壠睇壠庄庄驋痄郚庄驋庄壠.args[0] == 5:
            驋郚驋庄庄郚驋痄壠壠郚驋痄睇郚壠痄 = 154741095652788
郚庄驋痄痄壠驋郚痄驋驋庄痄痄壠壠睇 = 0
while 郚庄驋痄痄壠驋郚痄驋驋庄痄痄壠壠睇 != 2:
    郚庄驋痄痄壠驋郚痄驋驋庄痄痄壠壠睇 += 1
    try:
        raise VELIMATIX(郚庄驋痄痄壠驋郚痄驋驋庄痄痄壠壠睇)
    except VELIMATIX as 壠庄睇郚郚驋庄庄驋痄睇睇睇庄驋庄睇:
        if 壠庄睇郚郚驋庄庄驋痄睇睇睇庄驋庄睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('210118736512')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2526347')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7436252)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7409485)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7464957')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2526347')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7464707')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2526347')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7436252)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7412776)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7436252)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7409246)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('300485445')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5574077')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7704859')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5574077')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('893751580')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5574077')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7704864')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5574077')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1769472')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('644')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('126')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('570')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('505')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29884416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))()]))())
        if 壠庄睇郚郚驋庄庄驋痄睇睇睇庄驋庄睇.args[0] == 3:
            痄睇郚驋痄驋壠庄驋郚壠驋壠痄庄庄庄 = 107894898618436
庄壠壠壠睇庄庄驋痄痄郚睇郚壠郚痄痄 = 0
while 庄壠壠壠睇庄庄驋痄痄郚睇郚壠郚痄痄 != 2:
    庄壠壠壠睇庄庄驋痄痄郚睇郚壠郚痄痄 += 1
    try:
        raise VELIMATIX(庄壠壠壠睇庄庄驋痄痄郚睇郚壠郚痄痄)
    except VELIMATIX as 驋痄痄驋庄庄驋壠郚驋痄痄睇郚郚壠痄:
        if 驋痄痄驋庄庄驋壠郚驋痄痄睇郚郚壠痄.args[0] == 1:
            礟絩嚭榽啓鶥()['计孡曛珩郱骰'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7146118)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7146145)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7146222')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8116417')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7146171')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8116417')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7146157')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8116417')")[::-1])))()]))())
驋睇睇庄睇庄庄痄庄壠痄郚痄郚驋壠郚 = 0
while 驋睇睇庄睇庄庄痄庄壠痄郚痄郚驋壠郚 != 2:
    驋睇睇庄睇庄庄痄庄壠痄郚痄郚驋壠郚 += 1
    try:
        raise VELIMATIX(驋睇睇庄睇庄庄痄庄壠痄郚痄郚驋壠郚)
    except VELIMATIX as 痄睇壠睇壠郚郚壠郚壠郚驋壠壠郚驋驋:
        if 痄睇壠睇壠郚郚壠郚壠郚驋壠壠郚驋驋.args[0] == 1:
            礟絩嚭榽啓鶥()['紇彇醘煪畱忙'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2992715')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6762992')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3375104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1710')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~114)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2949120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('600')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('44')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))()]))())
        if 痄睇壠睇壠郚郚壠郚壠郚驋壠壠郚驋驋.args[0] == 3:
            壠睇庄驋郚睇庄痄庄壠郚睇睇郚庄郚驋 = 147828942042480
郚睇驋驋睇驋睇驋郚郚睇睇睇壠睇壠驋 = 0
while 郚睇驋驋睇驋睇驋郚郚睇睇睇壠睇壠驋 != 2:
    郚睇驋驋睇驋睇驋郚郚睇睇睇壠睇壠驋 += 1
    try:
        raise VELIMATIX(郚睇驋驋睇驋睇驋郚郚睇睇睇壠睇壠驋)
    except VELIMATIX as 壠睇壠痄驋痄壠驋驋痄驋郚痄睇壠郚驋:
        if 壠睇壠痄驋痄壠驋驋痄驋郚痄睇壠郚驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5693240')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8418565')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5691631')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8418565')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5658148)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5685650)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2904162304')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('639319')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2472768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2765139')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0015672')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65011712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))())
        if 壠睇壠痄驋痄壠驋驋痄驋郚痄睇壠郚驋.args[0] == 3:
            庄庄壠庄驋痄郚睇痄驋庄驋壠驋驋郚郚 = 94372530677111
        if 壠睇壠痄驋痄壠驋驋痄驋郚痄睇壠郚驋.args[0] == 4:
            驋睇驋痄痄睇壠庄壠痄郚睇郚郚郚庄痄 = 982813753581
睇驋睇庄庄睇睇驋睇壠痄庄睇睇痄壠睇 = 0
while 睇驋睇庄庄睇睇驋睇壠痄庄睇睇痄壠睇 != 2:
    睇驋睇庄庄睇睇驋睇壠痄庄睇睇痄壠睇 += 1
    try:
        raise VELIMATIX(睇驋睇庄庄睇睇驋睇壠痄庄睇睇痄壠睇)
    except VELIMATIX as 痄驋郚郚壠壠驋壠驋睇壠壠郚睇庄睇壠:
        if 痄驋郚郚壠壠驋壠驋睇壠壠郚睇庄睇壠.args[0] == 1:
            礟絩嚭榽啓鶥()['璷咷徐鉟橏翻'[::-1]] = 隳泾馊腈珸譌(')1_5_0_6_6_5_6_3_6_9-(+1_5_0_6_6_5_6_3_6_9'[::-1])
痄庄痄壠驋壠壠壠郚郚庄壠郚睇睇痄驋 = 0
while 痄庄痄壠驋壠壠壠郚郚庄壠郚睇睇痄驋 != 2:
    痄庄痄壠驋壠壠壠郚郚庄壠郚睇睇痄驋 += 1
    try:
        raise VELIMATIX(痄庄痄壠驋壠壠壠郚郚庄壠郚睇睇痄驋)
    except VELIMATIX as 睇庄郚睇驋庄壠痄郚壠痄壠睇驋庄壠壠:
        if 睇庄郚睇驋庄壠痄郚壠痄壠睇驋庄壠壠.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8682685')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2755568')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('145880')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48058')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~20302)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~24197)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~26899)'))))()]))()] = 隳泾馊腈珸譌(')7_2_3_2_9_1_0_5_0_5-(+8_2_3_2_9_1_0_5_0_5'[::-1])
睇庄庄痄壠痄驋壠驋郚壠痄驋壠睇郚睇 = 0
while 睇庄庄痄壠痄驋壠驋郚壠痄驋壠睇郚睇 != 2:
    睇庄庄痄壠痄驋壠驋郚壠痄驋壠睇郚睇 += 1
    try:
        raise VELIMATIX(睇庄庄痄壠痄驋壠驋郚壠痄驋壠睇郚睇)
    except VELIMATIX as 庄庄郚睇庄郚痄郚郚庄痄睇睇庄壠睇驋:
        if 庄庄郚睇庄郚痄郚郚庄痄睇睇庄壠睇驋.args[0] == 3:
            庄庄庄睇郚驋睇庄驋驋庄痄痄驋庄郚郚 = 93009403577611
        if 庄庄郚睇庄郚痄郚郚庄痄睇睇庄壠睇驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('159968003565')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7103874')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4092928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36948)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('28822')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33342)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20490')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))()]))()] = 隳泾馊腈珸譌(')0_9_1_3_2_9_2_6_4_9-(+1_9_1_3_2_9_2_6_4_9'[::-1])
庄郚郚壠郚郚驋痄痄壠痄壠睇睇庄驋庄 = 0
while 庄郚郚壠郚郚驋痄痄壠痄壠睇睇庄驋庄 != 2:
    庄郚郚壠郚郚驋痄痄壠痄壠睇睇庄驋庄 += 1
    try:
        raise VELIMATIX(庄郚郚壠郚郚驋痄痄壠痄壠睇睇庄驋庄)
    except VELIMATIX as 壠睇庄驋郚睇郚驋郚郚痄驋驋庄痄驋庄:
        if 壠睇庄驋郚睇郚驋郚郚痄驋驋庄痄驋庄.args[0] == 1:
            礟絩嚭榽啓鶥()['憈蒇木惬唶鄃'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('251')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~39)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~235)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7853)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('968')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('312')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))()]))())
        if 壠睇庄驋郚睇郚驋郚郚痄驋驋庄痄驋庄.args[0] == 3:
            庄郚庄痄庄郚庄痄痄驋壠痄壠郚壠郚睇 = 193454370311006
痄驋驋痄睇驋庄睇睇睇痄睇郚睇郚壠驋 = 0
while 痄驋驋痄睇驋庄睇睇睇痄睇郚睇郚壠驋 != 2:
    痄驋驋痄睇驋庄睇睇睇痄睇郚睇郚壠驋 += 1
    try:
        raise VELIMATIX(痄驋驋痄睇驋庄睇睇睇痄睇郚睇郚壠驋)
    except VELIMATIX as 郚驋痄郚痄驋痄睇驋驋睇庄郚壠睇郚壠:
        if 郚驋痄郚痄驋痄睇驋驋睇庄郚壠睇郚壠.args[0] == 1:
            礟絩嚭榽啓鶥()['鯳飵纥麱闤讻'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8183417')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8733818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8183453')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8733818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8183378)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8183354)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1952')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('330')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('348')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15466496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~48)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1900544')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('212992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7854)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1331')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('429')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))()]))())
        if 郚驋痄郚痄驋痄睇驋驋睇庄郚壠睇郚壠.args[0] == 3:
            庄驋睇庄庄痄驋庄郚郚睇痄壠庄壠驋睇 = 101927832656593
庄壠睇驋郚驋痄壠睇驋庄痄痄庄驋驋郚 = 0
while 庄壠睇驋郚驋痄壠睇驋庄痄痄庄驋驋郚 != 2:
    庄壠睇驋郚驋痄壠睇驋庄痄痄庄驋驋郚 += 1
    try:
        raise VELIMATIX(庄壠睇驋郚驋痄壠睇驋庄痄痄庄驋驋郚)
    except VELIMATIX as 睇痄壠壠痄庄庄睇壠郚壠壠郚睇驋痄庄:
        if 睇痄壠壠痄庄庄睇壠郚壠壠郚睇驋痄庄.args[0] == 1:
            礟絩嚭榽啓鶥()['竡嫳響洢臥剮'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7153560)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7153599)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('38400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15616')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('262144')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1508')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('249')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('45')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7858')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~42)'))))()]))())
        if 睇痄壠壠痄庄庄睇壠郚壠壠郚睇驋痄庄.args[0] == 3:
            痄痄郚痄驋痄驋庄痄睇痄庄郚壠痄庄庄 = 236947414762799
        if 睇痄壠壠痄庄庄睇壠郚壠壠郚睇驋痄庄.args[0] == 4:
            壠驋驋痄壠壠郚郚睇壠痄壠驋痄壠驋驋 = 267402720809446
庄壠痄痄庄郚痄庄睇驋痄庄壠壠驋驋痄 = 0
while 庄壠痄痄庄郚痄庄睇驋痄庄壠壠驋驋痄 != 2:
    庄壠痄痄庄郚痄庄睇驋痄庄壠壠驋驋痄 += 1
    try:
        raise VELIMATIX(庄壠痄痄庄郚痄庄睇驋痄庄壠壠驋驋痄)
    except VELIMATIX as 痄睇郚驋痄郚睇郚睇郚痄庄庄壠庄睇壠:
        if 痄睇郚驋痄郚睇郚睇郚痄庄庄壠庄睇壠.args[0] == 1:
            礟絩嚭榽啓鶥()['瞍亀髳魼潘烫'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('338038155')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5467668')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8667645)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8667580)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6336')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('594')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3309568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('131')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~40)'))))()]))())
        if 痄睇郚驋痄郚睇郚睇郚痄庄庄壠庄睇壠.args[0] == 3:
            痄痄壠壠驋睇痄壠壠壠庄睇睇睇睇睇痄 = 281095243786402
痄睇壠郚驋郚郚庄庄庄驋庄痄壠痄庄庄 = 0
while 痄睇壠郚驋郚郚庄庄庄驋庄痄壠痄庄庄 != 2:
    痄睇壠郚驋郚郚庄庄庄驋庄痄壠痄庄庄 += 1
    try:
        raise VELIMATIX(痄睇壠郚驋郚郚庄庄庄驋庄痄壠痄庄庄)
    except VELIMATIX as 郚驋壠郚驋驋庄壠庄睇庄痄郚痄庄驋痄:
        if 郚驋壠郚驋驋庄壠庄睇庄痄郚痄庄驋痄.args[0] == 1:
            礟絩嚭榽啓鶥()['魨紿守流艉糴'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5149358)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5149321)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5149474')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8539415')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('520085158')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8539415')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5149358)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5149398)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('950272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('950272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1728')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3440640')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1485')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15204352')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1785')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('235')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('600')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('851968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('436')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('86')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7864320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('432')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25427968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('130')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('405504')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1392')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1966080')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3571712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1130')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~58)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3014656')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('73')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('704')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1680')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14286848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1751')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1717')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('799')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1649')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1785')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~119)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('748')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('872')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25427968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1687552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13238272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~62)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31195136')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~119)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('130')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~62)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1962')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('194')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('47')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('98')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('45')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('42')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('192512')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~55)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~49)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('576')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('736')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('896')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('176')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('990')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1100')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1680')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1440')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7864320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12976128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1768')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('901120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('72')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15466496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1037')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~34)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('76')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1998848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('63')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('690')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('70')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39936')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))()]))())
        if 郚驋壠郚驋驋庄壠庄睇庄痄郚痄庄驋痄.args[0] == 3:
            壠庄郚睇睇痄驋壠壠庄驋痄驋壠痄睇睇 = 2326515935711
        if 郚驋壠郚驋驋庄壠庄睇庄痄郚痄庄驋痄.args[0] == 4:
            郚睇庄郚睇睇痄睇睇痄郚驋驋壠睇壠庄 = 257436460393393
        if 郚驋壠郚驋驋庄壠庄睇庄痄郚痄庄驋痄.args[0] == 5:
            痄驋郚郚驋壠痄睇驋郚睇睇睇壠庄庄痄 = 53495460894092
壠壠睇壠痄壠庄壠痄庄庄郚驋驋郚壠壠 = 0
while 壠壠睇壠痄壠庄壠痄庄庄郚驋驋郚壠壠 != 2:
    壠壠睇壠痄壠庄壠痄庄庄郚驋驋郚壠壠 += 1
    try:
        raise VELIMATIX(壠壠睇壠痄壠庄壠痄庄庄郚驋驋郚壠壠)
    except VELIMATIX as 驋睇驋痄壠庄壠壠痄驋睇壠痄壠驋壠驋:
        if 驋睇驋痄壠庄壠壠痄驋睇壠痄壠驋壠驋.args[0] == 1:
            礟絩嚭榽啓鶥()['鑶橤搾檄圧讕'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~68)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('93')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1089')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7168')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('413696')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~43)'))))()]))())
驋壠壠庄痄驋壠睇痄庄痄睇睇郚睇壠睇 = 0
while 驋壠壠庄痄驋壠睇痄庄痄睇睇郚睇壠睇 != 2:
    驋壠壠庄痄驋壠睇痄庄痄睇睇郚睇壠睇 += 1
    try:
        raise VELIMATIX(驋壠壠庄痄驋壠睇痄庄痄睇睇郚睇壠睇)
    except VELIMATIX as 壠睇驋睇壠痄驋壠睇郚驋郚睇驋痄郚痄:
        if 壠睇驋睇壠痄驋壠睇郚驋郚睇驋痄郚痄.args[0] == 3:
            庄睇痄壠睇痄壠痄睇痄驋痄驋睇庄睇驋 = 76236083693805
        if 壠睇驋睇壠痄驋壠睇郚驋郚睇驋痄郚痄.args[0] == 4:
            壠睇壠睇驋痄驋郚睇睇痄驋庄庄痄壠庄 = 37985734553769
        if 壠睇驋睇壠痄驋壠睇郚驋郚睇驋痄郚痄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('643694592')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('347494')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21307')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~31412)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('365288')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('452270')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7687528)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7687503)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7687625')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('861003136')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('861003136')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7687528)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7687428)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('807190440')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7687627')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('745690216')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8257867')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3637248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('62')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('960')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('30464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('444')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('218')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('234')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('216')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('220')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('204800')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51200')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))())
痄郚庄壠驋郚庄驋庄壠郚睇壠睇痄郚郚 = 0
while 痄郚庄壠驋郚庄驋庄壠郚睇壠睇痄郚郚 != 2:
    痄郚庄壠驋郚庄驋庄壠郚睇壠睇痄郚郚 += 1
    try:
        raise VELIMATIX(痄郚庄壠驋郚庄驋庄壠郚睇壠睇痄郚郚)
    except VELIMATIX as 驋郚庄驋痄壠郚庄庄郚壠庄壠驋郚痄驋:
        if 驋郚庄驋痄壠郚庄庄郚壠庄壠驋郚痄驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('85609300590')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1775922')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('299744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('32291')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('35987')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('457752576')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~39528)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('96677373')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7098742')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('245411793')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7098742')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12713984')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('62')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1622016')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1776')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3604480')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1740')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1710')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('227328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1188')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~44)'))))()]))())
        if 驋郚庄驋痄壠郚庄庄郚壠庄壠驋郚痄驋.args[0] == 3:
            驋庄痄庄郚壠睇痄郚壠壠驋痄睇睇庄庄 = 238921855680003
        if 驋郚庄驋痄壠郚庄庄郚壠庄壠驋郚痄驋.args[0] == 4:
            庄郚壠庄睇郚痄壠痄郚庄庄痄驋驋痄庄 = 173837308913358
        if 驋郚庄驋痄壠郚庄庄郚壠庄壠驋郚痄驋.args[0] == 5:
            郚壠壠郚郚郚驋壠睇郚痄郚壠痄庄痄郚 = 75838565032596
郚驋驋驋驋郚驋郚郚壠睇郚驋壠驋庄壠 = 0
while 郚驋驋驋驋郚驋郚郚壠睇郚驋壠驋庄壠 != 2:
    郚驋驋驋驋郚驋郚郚壠睇郚驋壠驋庄壠 += 1
    try:
        raise VELIMATIX(郚驋驋驋驋郚驋郚郚壠睇郚驋壠驋庄壠)
    except VELIMATIX as 驋睇壠壠睇驋驋驋郚庄壠痄壠驋睇郚庄:
        if 驋睇壠壠睇驋驋驋郚庄壠痄壠驋睇郚庄.args[0] == 3:
            痄郚庄驋睇郚庄壠壠睇壠庄驋驋壠庄驋 = 204094492114782
        if 驋睇壠壠睇驋驋驋郚庄壠痄壠驋睇郚庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2770013)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2762228)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81241711277')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3100772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61319777781')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3100772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2806807')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3100772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2795918')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3100772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('334626816')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9984')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('872')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1474560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1455')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('76')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('720')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))())
驋壠痄睇痄驋郚壠庄壠郚睇郚驋庄庄驋 = 0
while 驋壠痄睇痄驋郚壠庄壠郚睇郚驋庄庄驋 != 2:
    驋壠痄睇痄驋郚壠庄壠郚睇郚驋庄庄驋 += 1
    try:
        raise VELIMATIX(驋壠痄睇痄驋郚壠庄壠郚睇郚驋庄庄驋)
    except VELIMATIX as 郚壠庄驋郚痄郚壠驋痄郚庄痄睇壠壠郚:
        if 郚壠庄驋郚痄郚壠驋痄郚庄痄睇壠壠郚.args[0] == 3:
            壠郚庄驋痄郚驋驋驋驋睇驋郚痄郚睇痄 = 256358078845202
        if 郚壠庄驋郚痄郚壠驋痄郚庄痄睇壠壠郚.args[0] == 4:
            郚痄郚庄睇壠睇痄睇驋庄郚郚壠庄壠郚 = 267456710048012
        if 郚壠庄驋郚痄郚壠驋痄郚庄痄睇壠壠郚.args[0] == 5:
            睇庄壠郚驋庄睇痄痄壠痄郚庄驋郚庄痄 = 147217988442306
        if 郚壠庄驋郚痄郚壠驋痄郚庄痄睇壠壠郚.args[0] == 1:
            礟絩嚭榽啓鶥()['嚑秆薏均偃玚'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4008247)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4008208)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1840')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('180')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('396')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~41)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('388')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('180')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('444')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('392')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35)'))))()]))())
郚庄庄壠痄驋驋庄壠壠壠睇郚壠睇壠驋 = 0
while 郚庄庄壠痄驋驋庄壠壠壠睇郚壠睇壠驋 != 2:
    郚庄庄壠痄驋驋庄壠壠壠睇郚壠睇壠驋 += 1
    try:
        raise VELIMATIX(郚庄庄壠痄驋驋庄壠壠壠睇郚壠睇壠驋)
    except VELIMATIX as 郚睇庄庄驋郚庄郚庄壠驋痄壠痄庄痄睇:
        if 郚睇庄庄驋郚庄郚庄壠驋痄壠痄庄痄睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1125332)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1145890)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57610')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2155008')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('228504')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('205236')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~28296)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('368646915')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5842549')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9452548')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5842549')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('98')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))()]))())
        if 郚睇庄庄驋郚庄郚庄壠驋痄壠痄庄痄睇.args[0] == 3:
            庄庄庄壠郚睇睇睇庄郚郚庄庄睇壠痄驋 = 216636339323123
睇郚庄驋驋郚郚壠壠睇驋庄痄郚壠庄睇 = 0
while 睇郚庄驋驋郚郚壠壠睇驋庄痄郚壠庄睇 != 2:
    睇郚庄驋驋郚郚壠壠睇驋庄痄郚壠庄睇 += 1
    try:
        raise VELIMATIX(睇郚庄驋驋郚郚壠壠睇驋庄痄郚壠庄睇)
    except VELIMATIX as 壠驋庄郚睇庄驋郚痄睇驋驋郚壠睇痄睇:
        if 壠驋庄郚睇庄驋郚痄睇驋驋郚壠睇痄睇.args[0] == 1:
            礟絩嚭榽啓鶥()['宺砟寃鐒糆栯'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56190225')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5770441')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1440775)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1440884)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('145518275')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5770441')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1440775)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1440868)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('184320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13312')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('315')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('819')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('315')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('756')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14848')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('777')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~117)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('763')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))()]))())
        if 壠驋庄郚睇庄驋郚痄睇驋驋郚壠睇痄睇.args[0] == 3:
            郚驋痄驋痄郚壠郚驋痄郚驋庄庄驋痄庄 = 236679026032859
        if 壠驋庄郚睇庄驋郚痄睇驋驋郚壠睇痄睇.args[0] == 4:
            痄痄郚壠睇壠壠壠睇庄郚痄睇壠庄壠壠 = 51875965365602
        if 壠驋庄郚睇庄驋郚痄睇驋驋郚壠睇痄睇.args[0] == 5:
            庄睇驋睇痄驋睇郚郚郚痄庄痄庄驋郚壠 = 17612300498904
郚睇壠庄驋睇痄郚睇睇郚郚驋庄睇睇驋 = 0
while 郚睇壠庄驋睇痄郚睇睇郚郚驋庄睇睇驋 != 2:
    郚睇壠庄驋睇痄郚睇睇郚郚驋庄睇睇驋 += 1
    try:
        raise VELIMATIX(郚睇壠庄驋睇痄郚睇睇郚郚驋庄睇睇驋)
    except VELIMATIX as 驋睇壠驋睇痄庄睇庄驋睇睇痄郚郚睇庄:
        if 驋睇壠驋睇痄庄睇庄驋睇睇痄郚郚睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('241421285023')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7908977')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7820555')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7908977')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('170637958554')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7908977')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('72687616')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31016')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('286625001')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349359)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349325)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('477708335')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349359)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349249)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7349459')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7349473')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349359)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7349248)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7349464')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7349459')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9539437')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('278528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('507')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
郚郚郚壠睇睇痄壠驋壠庄痄痄痄庄驋驋 = 0
while 郚郚郚壠睇睇痄壠驋壠庄痄痄痄庄驋驋 != 2:
    郚郚郚壠睇睇痄壠驋壠庄痄痄痄庄驋驋 += 1
    try:
        raise VELIMATIX(郚郚郚壠睇睇痄壠驋壠庄痄痄痄庄驋驋)
    except VELIMATIX as 庄壠驋睇驋庄睇睇痄驋睇驋驋痄郚壠郚:
        if 庄壠驋睇驋庄睇睇痄驋睇驋驋痄郚壠郚.args[0] == 3:
            睇郚痄壠痄郚痄睇痄睇痄痄睇壠壠壠郚 = 49948156179961
        if 庄壠驋睇驋庄睇睇痄驋睇驋驋痄郚壠郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3795085')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7304773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3807453')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7304773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3774037)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3736163)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3797434')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7304773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('233103360')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~39632)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5842095)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5842056)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('479232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('124')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1236')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1368')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1200')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('230')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3309568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('132')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1710')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1515')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7471104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3833856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1725')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118784')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))()]))())
郚睇痄睇驋驋壠痄睇庄庄驋郚驋郚驋郚 = 0
while 郚睇痄睇驋驋壠痄睇庄庄驋郚驋郚驋郚 != 2:
    郚睇痄睇驋驋壠痄睇庄庄驋郚驋郚驋郚 += 1
    try:
        raise VELIMATIX(郚睇痄睇驋驋壠痄睇庄庄驋郚驋郚驋郚)
    except VELIMATIX as 睇睇郚郚郚驋郚郚庄郚驋驋郚痄痄睇睇:
        if 睇睇郚郚郚驋郚郚庄郚驋驋郚痄痄睇睇.args[0] == 3:
            睇驋痄驋郚睇庄壠郚庄睇庄痄痄壠痄睇 = 102610493520199
        if 睇睇郚郚郚驋郚郚庄郚驋驋郚痄痄睇睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4406815')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7724834')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4412374')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7724834')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4410343')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7724834')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4384277)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4351112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1107744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~30700)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('257178948')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2334956')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('323122268')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2334956')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('257178948')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2334956')")[::-1])))()]))())
庄痄壠壠壠庄驋郚壠壠庄驋壠郚壠痄庄 = 0
while 庄痄壠壠壠庄驋郚壠壠庄驋壠郚壠痄庄 != 2:
    庄痄壠壠壠庄驋郚壠壠庄驋壠郚壠痄庄 += 1
    try:
        raise VELIMATIX(庄痄壠壠壠庄驋郚壠壠庄驋壠郚壠痄庄)
    except VELIMATIX as 睇壠庄痄郚郚痄壠睇壠庄睇驋壠郚睇痄:
        if 睇壠庄痄郚郚痄壠睇壠庄睇驋壠郚睇痄.args[0] == 1:
            礟絩嚭榽啓鶥()['鐅哻膒昣圂碢'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2774625')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6854772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2774697')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6854772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2774700')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6854772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('291331530')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6854772')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105472')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1050')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~45)'))))()]))())
        if 睇壠庄痄郚郚痄壠睇壠庄睇驋壠郚睇痄.args[0] == 3:
            壠庄郚庄壠驋驋壠郚郚驋痄驋痄庄痄庄 = 80514314731906
        if 睇壠庄痄郚郚痄壠睇壠庄睇驋壠郚睇痄.args[0] == 4:
            痄睇壠壠睇痄郚庄郚壠驋驋睇壠壠驋睇 = 298604246223
驋郚睇庄庄郚壠痄壠痄睇睇郚郚痄痄郚 = 0
while 驋郚睇庄庄郚壠痄壠痄睇睇郚郚痄痄郚 != 2:
    驋郚睇庄庄郚壠痄壠痄睇睇郚郚痄痄郚 += 1
    try:
        raise VELIMATIX(驋郚睇庄庄郚壠痄壠痄睇睇郚郚痄痄郚)
    except VELIMATIX as 庄庄驋庄庄壠驋睇驋壠驋痄驋壠庄睇庄:
        if 庄庄驋庄庄壠驋睇驋壠驋痄驋壠庄睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()['繡蘙鶷暍舚瓘'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14720')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~61)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~40)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('329')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('446464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13762560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1751')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1680')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~42)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('102')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27648')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~111)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('312')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))()]))())
        if 庄庄驋庄庄壠驋睇驋壠驋痄驋壠庄睇庄.args[0] == 3:
            驋睇郚郚睇壠驋郚庄庄睇痄睇郚庄睇郚 = 267027599326739
        if 庄庄驋庄庄壠驋睇驋壠驋痄驋壠庄睇庄.args[0] == 4:
            睇壠郚庄庄痄庄痄驋壠庄驋睇睇睇睇驋 = 156635788182511
庄驋壠痄壠睇睇痄庄壠郚驋壠壠驋痄痄 = 0
while 庄驋壠痄壠睇睇痄庄壠郚驋壠壠驋痄痄 != 2:
    庄驋壠痄壠睇睇痄庄壠郚驋壠壠驋痄痄 += 1
    try:
        raise VELIMATIX(庄驋壠痄壠睇睇痄庄壠郚驋壠壠驋痄痄)
    except VELIMATIX as 驋驋庄壠壠庄睇驋庄驋壠庄郚驋驋郚睇:
        if 驋驋庄壠壠庄睇驋庄驋壠庄郚驋驋郚睇.args[0] == 3:
            郚驋壠驋壠壠郚庄痄驋郚驋郚痄庄郚睇 = 66290519538868
        if 驋驋庄壠壠庄睇驋庄驋壠庄郚驋驋郚睇.args[0] == 4:
            睇睇庄庄痄驋庄痄驋驋庄痄庄驋痄睇郚 = 244460373153897
        if 驋驋庄壠壠庄睇驋庄驋壠庄郚驋驋郚睇.args[0] == 1:
            礟絩嚭榽啓鶥()['欣隻烥葵诏鈓'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6619136')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('720')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~117)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('405504')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1248')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1840')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('234')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))()]))())
壠庄壠痄睇痄驋睇庄睇郚睇庄庄睇睇壠 = 0
while 壠庄壠痄睇痄驋睇庄睇郚睇庄庄睇睇壠 != 2:
    壠庄壠痄睇痄驋睇庄睇郚睇庄庄睇睇壠 += 1
    try:
        raise VELIMATIX(壠庄壠痄睇痄驋睇庄睇郚睇庄庄睇睇壠)
    except VELIMATIX as 庄睇壠郚庄驋庄睇庄壠睇庄郚驋庄庄睇:
        if 庄睇壠郚庄驋庄睇庄壠睇庄郚驋庄庄睇.args[0] == 1:
            礟絩嚭榽啓鶥()['褁驴稊韟聝敤'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265962)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265933)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1065585630')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('898798314')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265962)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265991)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('935862162')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9266007')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9266073')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265962)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9266008)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('972926010')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265962)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265997)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265962)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9265987)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1019255820')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9266001')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2695629')")[::-1])))()]))())
        if 庄睇壠郚庄驋庄睇庄壠睇庄郚驋庄庄睇.args[0] == 3:
            壠痄郚壠壠壠痄睇痄壠痄壠睇驋庄痄痄 = 248602737082796
        if 庄睇壠郚庄驋庄睇庄壠睇庄郚驋庄庄睇.args[0] == 4:
            庄睇痄郚郚痄壠郚睇庄郚驋庄壠庄庄睇 = 136492373995739
郚睇驋庄郚庄睇郚驋壠庄郚睇郚睇庄郚 = 0
while 郚睇驋庄郚庄睇郚驋壠庄郚睇郚睇庄郚 != 2:
    郚睇驋庄郚庄睇郚驋壠庄郚睇郚睇庄郚 += 1
    try:
        raise VELIMATIX(郚睇驋庄郚庄睇郚驋壠庄郚睇郚睇庄郚)
    except VELIMATIX as 痄驋郚郚壠壠驋驋痄睇睇驋壠睇睇驋郚:
        if 痄驋郚郚壠壠驋驋痄睇睇驋壠睇睇驋郚.args[0] == 3:
            壠壠庄郚壠壠庄睇庄驋睇痄郚庄驋痄庄 = 276354220149357
        if 痄驋郚郚壠壠驋驋痄睇睇驋壠睇睇驋郚.args[0] == 4:
            驋庄壠睇睇睇郚壠驋驋痄庄庄郚壠庄睇 = 186014584028878
        if 痄驋郚郚壠壠驋驋痄睇睇驋壠睇睇驋郚.args[0] == 5:
            驋庄壠睇庄睇驋驋郚痄痄睇郚痄壠郚驋 = 100743312608121
        if 痄驋郚郚壠壠驋驋痄睇睇驋壠睇睇驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()['虬虦鎭媍囩糬'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4008633')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4958004')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('460988310')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4958004')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4008695')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4958004')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4008693')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4958004')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4008594)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4008639)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4008696')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4958004')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('413696')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1248')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1332')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('159744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))()]))())
庄睇郚壠庄壠郚壠驋驋壠郚庄庄睇庄痄 = 0
while 庄睇郚壠庄壠郚壠驋驋壠郚庄庄睇庄痄 != 2:
    庄睇郚壠庄壠郚壠驋驋壠郚庄庄睇庄痄 += 1
    try:
        raise VELIMATIX(庄睇郚壠庄壠郚壠驋驋壠郚庄庄睇庄痄)
    except VELIMATIX as 郚庄郚睇睇睇痄壠痄壠庄庄睇庄壠睇睇:
        if 郚庄郚睇睇睇痄壠痄壠庄庄睇庄壠睇睇.args[0] == 3:
            睇痄睇壠驋庄郚郚驋庄庄郚驋壠睇壠庄 = 233774500855508
        if 郚庄郚睇睇睇痄壠痄壠庄庄睇庄壠睇睇.args[0] == 4:
            庄驋驋庄壠驋壠庄庄庄驋庄郚痄郚庄壠 = 47895140055314
        if 郚庄郚睇睇睇痄壠痄壠庄庄睇庄壠睇睇.args[0] == 1:
            礟絩嚭榽啓鶥()['罰囔琼袶阻嫰'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2090')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('99328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1180')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('776')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15204352')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))()]))())
驋壠痄痄痄驋郚壠痄郚驋郚壠痄驋睇睇 = 0
while 驋壠痄痄痄驋郚壠痄郚驋郚壠痄驋睇睇 != 2:
    驋壠痄痄痄驋郚壠痄郚驋郚壠痄驋睇睇 += 1
    try:
        raise VELIMATIX(驋壠痄痄痄驋郚壠痄郚驋郚壠痄驋睇睇)
    except VELIMATIX as 痄痄郚驋郚郚睇壠郚庄庄壠痄驋驋驋郚:
        if 痄痄郚驋郚郚睇壠郚庄庄壠痄驋驋驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()['捇脴數烸驫憚'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('313701297')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3263408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('925016645')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3263408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('812405923')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3263408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('796318677')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3263408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8043668')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3263408')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('835584')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1508')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('50688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6656')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('270')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('702')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('30146560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3735552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~40)'))))()]))())
        if 痄痄郚驋郚郚睇壠郚庄庄壠痄驋驋驋郚.args[0] == 3:
            壠驋郚庄郚壠睇驋痄驋痄痄庄庄庄驋睇 = 63376637866630
庄庄壠睇庄睇痄庄郚郚壠痄驋睇驋睇庄 = 0
while 庄庄壠睇庄睇痄庄郚郚壠痄驋睇驋睇庄 != 2:
    庄庄壠睇庄睇痄庄郚郚壠痄驋睇驋睇庄 += 1
    try:
        raise VELIMATIX(庄庄壠睇庄睇痄庄郚郚壠痄驋睇驋睇庄)
    except VELIMATIX as 庄睇驋郚庄痄庄痄壠睇郚郚郚壠驋睇郚:
        if 庄睇驋郚庄痄庄痄壠睇郚郚郚壠驋睇郚.args[0] == 1:
            礟絩嚭榽啓鶥()['漯愙满痫鰇輆'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('72')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))()]))())
        if 庄睇驋郚庄痄庄痄壠睇郚郚郚壠驋睇郚.args[0] == 3:
            郚睇驋睇郚郚痄睇庄郚驋郚壠痄痄庄郚 = 154779292337048
庄驋驋庄驋壠郚痄庄睇庄睇痄驋郚壠睇 = 0
while 庄驋驋庄驋壠郚痄庄睇庄睇痄驋郚壠睇 != 2:
    庄驋驋庄驋壠郚痄庄睇庄睇痄驋郚壠睇 += 1
    try:
        raise VELIMATIX(庄驋驋庄驋壠郚痄庄睇庄睇痄驋郚壠睇)
    except VELIMATIX as 壠睇庄痄驋壠驋驋睇睇驋睇庄痄郚郚睇:
        if 壠睇庄痄驋壠驋驋睇睇驋睇庄痄郚郚睇.args[0] == 1:
            礟絩嚭榽啓鶥()['煘犋濁鶫琼脤'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5790469)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5790498)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1840')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('180')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6488064')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1600')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('942080')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
        if 壠睇庄痄驋壠驋驋睇睇驋睇庄痄郚郚睇.args[0] == 3:
            痄睇驋庄庄庄壠壠痄壠痄睇痄睇壠驋痄 = 5180555959607
庄庄驋睇驋睇睇痄壠驋痄壠睇壠壠痄睇 = 0
while 庄庄驋睇驋睇睇痄壠驋痄壠睇壠壠痄睇 != 2:
    庄庄驋睇驋睇睇痄壠驋痄壠睇壠壠痄睇 += 1
    try:
        raise VELIMATIX(庄庄驋睇驋睇睇痄壠驋痄壠睇壠壠痄睇)
    except VELIMATIX as 睇睇郚壠痄睇郚驋郚庄睇庄睇壠痄郚驋:
        if 睇睇郚壠痄睇郚驋郚庄睇庄睇壠痄郚驋.args[0] == 3:
            痄郚庄痄壠庄郚驋驋庄庄壠睇壠庄郚壠 = 239453259467897
        if 睇睇郚壠痄睇郚驋郚庄睇庄睇壠痄郚驋.args[0] == 4:
            驋壠驋睇睇驋睇壠睇庄壠郚驋郚睇驋痄 = 35437745887110
        if 睇睇郚壠痄睇郚驋郚庄睇庄睇壠痄郚驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('680704')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('184040')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('563642368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('28492')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('555870')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('444374')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2323239')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0023232')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2323300')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0023232')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2323200)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2323311)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2323299')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0023232')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('271814400')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0023232')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2323309')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0023232')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))()]))())
痄睇痄痄郚庄壠痄壠痄驋庄睇睇壠睇睇 = 0
while 痄睇痄痄郚庄壠痄壠痄驋庄睇睇壠睇睇 != 2:
    痄睇痄痄郚庄壠痄壠痄驋庄睇睇壠睇睇 += 1
    try:
        raise VELIMATIX(痄睇痄痄郚庄壠痄壠痄驋庄睇睇壠睇睇)
    except VELIMATIX as 睇壠郚郚睇庄睇庄壠壠睇壠庄痄痄痄壠:
        if 睇壠郚郚睇庄睇庄壠壠睇壠庄痄痄痄壠.args[0] == 1:
            礟絩嚭榽啓鶥()['谟羊秓授鱂坾'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3194834)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3194869)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('909')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))()]))())
壠睇驋驋驋痄痄驋痄壠驋痄庄睇痄睇壠 = 0
while 壠睇驋驋驋痄痄驋痄壠驋痄庄睇痄睇壠 != 2:
    壠睇驋驋驋痄痄驋痄壠驋痄庄睇痄睇壠 += 1
    try:
        raise VELIMATIX(壠睇驋驋驋痄痄驋痄壠驋痄庄睇痄睇壠)
    except VELIMATIX as 郚驋睇庄庄驋壠壠壠庄睇庄壠睇驋庄驋:
        if 郚驋睇庄庄驋壠壠壠庄睇庄壠睇驋庄驋.args[0] == 1:
            礟絩嚭榽啓鶥()['蓊檪鯹厒藝葝'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('276060291')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9648707')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('208')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1150')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6553600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('136')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('212992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~37)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25427968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2196')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1800')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~60)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('216')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('111')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('963')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26880')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('876544')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3309568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~61)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))()]))())
        if 郚驋睇庄庄驋壠壠壠庄睇庄壠睇驋庄驋.args[0] == 3:
            痄庄痄驋郚睇睇痄驋睇郚驋庄壠郚睇痄 = 94511593232951
        if 郚驋睇庄庄驋壠壠壠庄睇庄壠睇驋庄驋.args[0] == 4:
            郚驋郚睇痄庄壠郚庄驋郚壠痄驋痄郚壠 = 37062110190023
庄庄郚郚驋壠痄睇驋驋郚驋郚痄郚庄睇 = 0
while 庄庄郚郚驋壠痄睇驋驋郚驋郚痄郚庄睇 != 2:
    庄庄郚郚驋壠痄睇驋驋郚驋郚痄郚庄睇 += 1
    try:
        raise VELIMATIX(庄庄郚郚驋壠痄睇驋驋郚驋郚痄郚庄睇)
    except VELIMATIX as 驋驋壠庄郚驋睇痄驋睇驋壠庄驋壠睇庄:
        if 驋驋壠庄郚驋睇痄驋睇驋壠庄驋壠睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7748326')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1900277')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7751999')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1900277')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7720091)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7687321)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('18873319424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36309)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('40183')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2939484')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5449392')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('285126165')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5449392')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2939544')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5449392')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1622016')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('324')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49664')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('479232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~47)'))))()]))())
睇郚壠郚驋驋痄睇睇郚郚睇郚睇驋痄睇 = 0
while 睇郚壠郚驋驋痄睇睇郚郚睇郚睇驋痄睇 != 2:
    睇郚壠郚驋驋痄睇睇郚郚睇郚睇驋痄睇 += 1
    try:
        raise VELIMATIX(睇郚壠郚驋驋痄睇睇郚郚睇郚睇驋痄睇)
    except VELIMATIX as 驋驋壠庄壠庄庄驋痄庄痄壠庄壠庄庄壠:
        if 驋驋壠庄壠庄庄驋痄庄痄壠庄壠庄庄壠.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106074162698')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2044054')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112565005980')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2044054')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128037626850')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2044054')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('249135104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('475215')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~21471)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2152969')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('0392512')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120832')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('450')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~92)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('88')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~124)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~49)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1130')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('610')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('570')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('55')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('80')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('92')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('472')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('339')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('64')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('144')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~45)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('168')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~47)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('342')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('62')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~114)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('499712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('24576')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('414')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('495')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('396')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('28160')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~37)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('680')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('664')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('472')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15616')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('393216')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~59)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('572')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('880')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('67')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('69')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~56)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('24117248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('72')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))()]))())
        if 驋驋壠庄壠庄庄驋痄庄痄壠庄壠庄庄壠.args[0] == 3:
            痄睇痄壠壠郚痄壠庄庄痄郚驋睇痄庄郚 = 233620439104573
郚睇驋庄痄庄壠郚庄壠壠庄睇睇庄痄壠 = 0
while 郚睇驋庄痄庄壠郚庄壠壠庄睇睇庄痄壠 != 2:
    郚睇驋庄痄庄壠郚庄壠壠庄睇睇庄痄壠 += 1
    try:
        raise VELIMATIX(郚睇驋庄痄庄壠郚庄壠壠庄睇睇庄痄壠)
    except VELIMATIX as 壠驋痄驋壠壠痄郚壠郚郚庄睇痄痄壠壠:
        if 壠驋痄驋壠壠痄郚壠郚郚庄睇痄痄壠壠.args[0] == 3:
            痄驋驋痄痄郚庄庄痄壠睇郚郚睇睇郚郚 = 65867913996615
        if 壠驋痄驋壠壠痄郚壠郚郚庄睇痄痄壠壠.args[0] == 4:
            痄痄郚郚壠睇睇庄壠驋庄驋郚郚庄壠壠 = 142355769365749
        if 壠驋痄驋壠壠痄郚壠郚郚庄睇痄痄壠壠.args[0] == 1:
            礟絩嚭榽啓鶥()['喾圊巐韝吱监'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1072592')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1072620')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1072664')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119053383')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1072553)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1072578)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112618065')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1072553)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1072588)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41829567')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3552701')")[::-1])))()]))())
庄壠郚痄郚驋痄痄郚痄郚郚壠睇痄驋驋 = 0
while 庄壠郚痄郚驋痄痄郚痄郚郚壠睇痄驋驋 != 2:
    庄壠郚痄郚驋痄痄郚痄郚郚壠睇痄驋驋 += 1
    try:
        raise VELIMATIX(庄壠郚痄郚驋痄痄郚痄郚郚壠睇痄驋驋)
    except VELIMATIX as 痄睇郚庄壠痄睇壠痄睇郚痄庄痄痄驋庄:
        if 痄睇郚庄壠痄睇壠痄睇郚痄庄痄痄驋庄.args[0] == 3:
            驋庄庄郚睇郚痄痄壠郚郚睇驋痄郚睇睇 = 201767968859262
        if 痄睇郚庄壠痄睇壠痄睇郚痄庄痄痄驋庄.args[0] == 4:
            驋睇壠睇郚壠郚壠痄壠庄庄睇睇壠驋驋 = 70205627338635
        if 痄睇郚庄壠痄睇壠痄睇郚痄庄痄痄驋庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9723918')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3298969')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('138534912')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('431076')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~21486)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33477)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1157267456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('225107259')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1891775')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5771981)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5771940)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5772081')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1891775')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5771981)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5772010)'))))()]))())
壠痄痄郚郚壠驋壠睇痄壠睇驋壠郚郚郚 = 0
while 壠痄痄郚郚壠驋壠睇痄壠睇驋壠郚郚郚 != 2:
    壠痄痄郚郚壠驋壠睇痄壠睇驋壠郚郚郚 += 1
    try:
        raise VELIMATIX(壠痄痄郚郚壠驋壠睇痄壠睇驋壠郚郚郚)
    except VELIMATIX as 驋痄郚睇驋郚郚痄郚痄睇壠郚庄郚壠庄:
        if 驋痄郚睇驋郚郚痄郚痄睇壠郚庄郚壠庄.args[0] == 3:
            壠睇庄郚郚睇睇痄壠郚庄睇庄驋驋郚郚 = 151216962630654
        if 驋痄郚睇驋郚郚痄郚痄睇壠郚庄郚壠庄.args[0] == 4:
            郚痄痄睇痄睇郚驋驋庄驋痄庄郚睇郚壠 = 187965517336237
        if 驋痄郚睇驋郚郚痄郚痄睇壠郚庄郚壠庄.args[0] == 5:
            驋痄驋痄驋壠痄驋痄壠庄睇驋驋睇郚庄 = 25506630696337
        if 驋痄郚睇驋郚郚痄郚痄睇壠郚庄郚壠庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1820967)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1786649)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1853732')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7690281')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('36639677007')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7690281')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1861907')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7690281')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1820967)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1808228)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('18342739968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4902894)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4902857)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('563832810')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4982094')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('495192294')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4982094')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4903008')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4982094')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('578541492')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4982094')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('495192294')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4982094')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7296')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29884416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1800')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29884416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~53)'))))()]))())
痄郚郚痄驋驋庄睇壠庄驋睇驋驋睇驋庄 = 0
while 痄郚郚痄驋驋庄睇壠庄驋睇驋驋睇驋庄 != 2:
    痄郚郚痄驋驋庄睇壠庄驋睇驋驋睇驋庄 += 1
    try:
        raise VELIMATIX(痄郚郚痄驋驋庄睇壠庄驋睇驋驋睇驋庄)
    except VELIMATIX as 睇庄痄驋庄郚壠睇痄庄郚庄痄壠庄庄庄:
        if 睇庄痄驋庄郚壠睇痄庄郚庄痄壠庄庄庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133216')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('42252288')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('162212')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('32504')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56728')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('272007168')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4191815')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6771914')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60293120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('966656')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~57)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
        if 睇庄痄驋庄郚壠睇痄庄郚庄痄壠庄庄庄.args[0] == 3:
            郚痄庄庄睇壠驋痄庄睇郚郚驋睇郚驋痄 = 252321947632509
庄痄郚壠庄驋睇庄郚痄壠庄驋庄痄睇痄 = 0
while 庄痄郚壠庄驋睇庄郚痄壠庄驋庄痄睇痄 != 2:
    庄痄郚壠庄驋睇庄郚痄壠庄驋庄痄睇痄 += 1
    try:
        raise VELIMATIX(庄痄郚壠庄驋睇庄郚痄壠庄驋庄痄睇痄)
    except VELIMATIX as 驋郚驋睇驋壠痄壠驋庄驋壠壠壠庄痄痄:
        if 驋郚驋睇驋壠痄壠驋庄驋壠壠壠庄痄痄.args[0] == 1:
            礟絩嚭榽啓鶥()['旚颠茊躵傮鉓'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('156')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))()]))())
壠睇壠壠壠壠痄痄庄庄痄痄睇郚壠睇壠 = 0
while 壠睇壠壠壠壠痄痄庄庄痄痄睇郚壠睇壠 != 2:
    壠睇壠壠壠壠痄痄庄庄痄痄睇郚壠睇壠 += 1
    try:
        raise VELIMATIX(壠睇壠壠壠壠痄痄庄庄痄痄睇郚壠睇壠)
    except VELIMATIX as 睇庄庄驋郚壠郚驋壠庄痄庄郚庄庄痄驋:
        if 睇庄庄驋郚壠郚驋壠庄痄庄郚庄庄痄驋.args[0] == 3:
            庄睇驋壠痄庄痄郚痄庄郚庄郚庄睇庄驋 = 231524778949489
        if 睇庄庄驋郚壠郚驋壠庄痄庄郚庄庄痄驋.args[0] == 4:
            痄壠痄痄壠驋壠壠郚睇痄郚壠庄驋痄郚 = 24035365219457
        if 睇庄庄驋郚壠郚驋壠庄痄庄郚庄庄痄驋.args[0] == 5:
            睇郚驋睇睇郚睇驋驋痄庄郚庄睇痄睇驋 = 143535952412272
        if 睇庄庄驋郚壠郚驋壠庄痄庄郚庄庄痄驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1653153)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1664199)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('869335040')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('276128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('213872')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61665')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~29267)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2223')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('117')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2071')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3360')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('580')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('44')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))()]))())
痄睇庄庄庄驋痄庄睇庄郚壠壠庄睇壠郚 = 0
while 痄睇庄庄庄驋痄庄睇庄郚壠壠庄睇壠郚 != 2:
    痄睇庄庄庄驋痄庄睇庄郚壠壠庄睇壠郚 += 1
    try:
        raise VELIMATIX(痄睇庄庄庄驋痄庄睇庄郚壠壠庄睇壠郚)
    except VELIMATIX as 痄痄痄驋郚壠庄痄痄郚壠庄壠庄郚驋睇:
        if 痄痄痄驋郚壠庄痄痄郚壠庄壠庄郚驋睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7301857')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6344727')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('263036331324')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6344727')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7274436)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7250177)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7274436)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7251766)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7274436)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7250634)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7274436)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7252916)'))))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))())
        if 痄痄痄驋郚壠庄痄痄郚壠庄壠庄郚驋睇.args[0] == 3:
            庄郚庄痄痄痄壠驋痄郚壠痄睇庄驋睇郚 = 260992185585290
        if 痄痄痄驋郚壠庄痄痄郚壠庄壠庄郚驋睇.args[0] == 4:
            驋郚驋驋庄郚庄郚睇壠庄壠郚郚驋壠庄 = 96133467426660
睇郚驋驋睇壠壠痄郚庄睇痄郚睇痄郚郚 = 0
while 睇郚驋驋睇壠壠痄郚庄睇痄郚睇痄郚郚 != 2:
    睇郚驋驋睇壠壠痄郚庄睇痄郚睇痄郚郚 += 1
    try:
        raise VELIMATIX(睇郚驋驋睇壠壠痄郚庄睇痄郚睇痄郚郚)
    except VELIMATIX as 睇郚郚痄庄庄驋壠痄郚壠驋驋痄壠睇驋:
        if 睇郚郚痄庄庄驋壠痄郚壠驋驋痄壠睇驋.args[0] == 3:
            庄郚郚壠壠壠庄睇壠驋郚壠郚庄壠庄痄 = 8129193000629
        if 睇郚郚痄庄庄驋壠痄郚壠驋驋痄壠睇驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9465891)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9446048)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('309619828719')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1985649')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9493044')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1985649')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9465891)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9439950)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9502256')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1985649')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('252455312970')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1985649')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('232')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('230')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~56)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15466496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~124)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2040')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1768')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('63')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1649')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2074')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1700')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1687552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1470')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1554')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('94')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('98')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('100')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6464')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('588')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('227328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3637248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('705')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1680')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('428')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('202')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('92')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))()]))())
郚驋郚睇睇壠庄睇睇痄庄驋庄痄睇痄壠 = 0
while 郚驋郚睇睇壠庄睇睇痄庄驋庄痄睇痄壠 != 2:
    郚驋郚睇睇壠庄睇睇痄庄驋庄痄睇痄壠 += 1
    try:
        raise VELIMATIX(郚驋郚睇睇壠庄睇睇痄庄驋庄痄睇痄壠)
    except VELIMATIX as 壠痄壠郚睇驋驋庄庄壠壠驋痄睇郚郚壠:
        if 壠痄壠郚睇驋驋庄庄壠壠驋痄睇郚郚壠.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8209556')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7094818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8219566')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7094818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8207773')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7094818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21253120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27912192')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29755')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1423251')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('148014048')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1423328')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1423212)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1423105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('153706896')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1423212)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1423170)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('159399744')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1423309')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2123241')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('30146560')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1654784')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~124)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('319488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))()]))())
        if 壠痄壠郚睇驋驋庄庄壠壠驋痄睇郚郚壠.args[0] == 3:
            郚睇驋睇壠庄庄痄痄驋睇庄驋郚睇痄庄 = 71568150881439
        if 壠痄壠郚睇驋驋庄庄壠壠驋痄睇郚郚壠.args[0] == 4:
            睇郚庄郚郚壠壠庄壠睇驋驋睇壠睇睇驋 = 256240746763441
        if 壠痄壠郚睇驋驋庄庄壠壠驋痄睇郚郚壠.args[0] == 5:
            庄庄痄驋睇郚痄痄壠睇睇庄痄庄郚郚睇 = 172097463301535
壠痄驋壠郚睇睇痄壠郚睇驋郚壠壠驋壠 = 0
while 壠痄驋壠郚睇睇痄壠郚睇驋郚壠壠驋壠 != 2:
    壠痄驋壠郚睇睇痄壠郚睇驋郚壠壠驋壠 += 1
    try:
        raise VELIMATIX(壠痄驋壠郚睇睇痄壠郚睇驋郚壠壠驋壠)
    except VELIMATIX as 睇庄痄痄庄驋壠庄驋庄庄庄痄驋庄驋郚:
        if 睇庄痄痄庄驋壠庄驋庄庄庄痄驋庄驋郚.args[0] == 1:
            礟絩嚭榽啓鶥()['硉腄矹裛堞鴨'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('735')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3670016')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))()]))())
郚驋睇郚郚睇痄睇壠睇壠郚壠痄痄痄庄 = 0
while 郚驋睇郚郚睇痄睇壠睇壠郚壠痄痄痄庄 != 2:
    郚驋睇郚郚睇痄睇壠睇壠郚壠痄痄痄庄 += 1
    try:
        raise VELIMATIX(郚驋睇郚郚睇痄睇壠睇壠郚壠痄痄痄庄)
    except VELIMATIX as 睇睇睇睇睇痄痄驋郚庄壠痄睇郚壠痄睇:
        if 睇睇睇睇睇痄痄驋郚庄壠痄睇郚壠痄睇.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('483024')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('143544')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('97260')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('18685100032')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33569)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('760038')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('78')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60817408')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1919')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~60)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1843')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2242')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~114)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7536640')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1622016')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1470')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1900544')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))()]))())
壠痄痄壠庄壠庄郚庄驋睇痄驋痄郚睇庄 = 0
while 壠痄痄壠庄壠庄郚庄驋睇痄驋痄郚睇庄 != 2:
    壠痄痄壠庄壠庄郚庄驋睇痄驋痄郚睇庄 += 1
    try:
        raise VELIMATIX(壠痄痄壠庄壠庄郚庄驋睇痄驋痄郚睇庄)
    except VELIMATIX as 睇壠睇郚睇郚驋庄睇睇驋驋庄睇郚睇郚:
        if 睇壠睇郚睇郚驋庄睇睇驋驋庄睇郚睇郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('80838632800')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4445803')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3125575')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4445803')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('99721550080')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4445803')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19393536')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('191718')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('244719')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7644791)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7644752)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7644830')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1974467')")[::-1])))()]))())
        if 睇壠睇郚睇郚驋庄睇睇驋驋庄睇郚睇郚.args[0] == 3:
            庄壠庄庄庄痄壠壠痄痄驋壠睇睇郚痄郚 = 41695622901839
        if 睇壠睇郚睇郚驋庄睇睇驋驋庄睇郚睇郚.args[0] == 4:
            郚郚痄痄驋痄痄郚驋郚痄睇痄壠郚庄痄 = 189784023764591
驋庄痄痄睇郚驋庄睇驋郚睇驋郚郚痄驋 = 0
while 驋庄痄痄睇郚驋庄睇驋郚睇驋郚郚痄驋 != 2:
    驋庄痄痄睇郚驋庄睇驋郚睇驋郚郚痄驋 += 1
    try:
        raise VELIMATIX(驋庄痄痄睇郚驋庄睇驋郚睇驋郚郚痄驋)
    except VELIMATIX as 驋壠壠郚痄睇痄痄庄睇壠庄痄庄庄睇庄:
        if 驋壠壠郚痄睇痄痄庄睇壠庄痄庄庄睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()['輶瓩氭棋翠聚'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('317636943')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8144646')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8144638')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('936621755')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8144652')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8144634')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7354418')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1687552')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26476544')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('76')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('576')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1656')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1656')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('52')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('720')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('828')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('756')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4032')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~47)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('376832')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1104')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('46')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))()]))())
痄郚郚睇庄壠驋痄驋驋郚驋痄郚驋壠庄 = 0
while 痄郚郚睇庄壠驋痄驋驋郚驋痄郚驋壠庄 != 2:
    痄郚郚睇庄壠驋痄驋驋郚驋痄郚驋壠庄 += 1
    try:
        raise VELIMATIX(痄郚郚睇庄壠驋痄驋驋郚驋痄郚驋壠庄)
    except VELIMATIX as 睇驋壠庄驋痄壠睇驋庄庄睇壠驋驋郚睇:
        if 睇驋壠庄驋痄壠睇驋庄庄睇壠驋驋郚睇.args[0] == 3:
            驋睇驋庄驋睇痄驋郚庄庄郚郚痄郚痄驋 = 178696573359752
        if 睇驋壠庄驋痄壠睇驋庄庄睇壠驋驋郚睇.args[0] == 4:
            睇庄痄壠睇痄睇睇郚壠庄壠睇庄睇庄痄 = 108267243103631
        if 睇驋壠庄驋痄壠睇驋庄庄睇壠驋驋郚睇.args[0] == 5:
            驋睇郚郚驋睇痄壠痄壠痄驋庄庄郚驋郚 = 75012855374956
        if 睇驋壠庄驋痄壠睇驋庄庄睇壠驋驋郚睇.args[0] == 1:
            礟絩嚭榽啓鶥()['哵鯒鲊湨消啨'[::-1]] = 隳泾馊腈珸譌(')0-(-1'[::-1])
郚郚睇睇驋壠睇郚郚庄庄痄驋郚睇睇驋 = 0
while 郚郚睇睇驋壠睇郚郚庄庄痄驋郚睇睇驋 != 2:
    郚郚睇睇驋壠睇郚郚庄庄痄驋郚睇睇驋 += 1
    try:
        raise VELIMATIX(郚郚睇睇驋壠睇郚郚庄庄痄驋郚睇睇驋)
    except VELIMATIX as 驋睇郚郚痄驋庄庄痄壠睇睇壠驋郚睇庄:
        if 驋睇郚郚痄驋庄庄痄壠睇睇壠驋郚睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3912981')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1057783')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6515456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('290768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('392624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('24514')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2430140416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5434342')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3034345')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19200')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1664')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('248')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27000832')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~50)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('254')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13952')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1024')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('237568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1703936')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8033280')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('42')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39205')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('550')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('131072')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1248')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~237)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1260')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~44)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~44)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1296')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1260')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3506176')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('48')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))()]))())
        if 驋睇郚郚痄驋庄庄痄壠睇睇壠驋郚睇庄.args[0] == 3:
            睇痄睇痄壠壠郚睇郚痄痄壠壠庄郚驋庄 = 255998240047197
        if 驋睇郚郚痄驋庄庄痄壠睇睇壠驋郚睇庄.args[0] == 4:
            庄壠郚壠痄驋睇驋郚郚壠睇庄壠驋睇庄 = 5375740330048
        if 驋睇郚郚痄驋庄庄痄壠睇睇壠驋郚睇庄.args[0] == 5:
            壠驋壠壠痄庄痄痄郚睇睇郚壠驋郚睇郚 = 215845035002196
壠驋壠驋睇睇痄痄壠郚睇驋痄郚睇庄驋 = 0
while 壠驋壠驋睇睇痄痄壠郚睇驋痄郚睇庄驋 != 2:
    壠驋壠驋睇睇痄痄壠郚睇驋痄郚睇庄驋 += 1
    try:
        raise VELIMATIX(壠驋壠驋睇睇痄痄壠郚睇驋痄郚睇庄驋)
    except VELIMATIX as 痄驋壠庄郚痄郚驋睇郚庄痄庄睇驋痄驋:
        if 痄驋壠庄郚痄郚驋睇郚庄痄庄睇驋痄驋.args[0] == 3:
            郚壠壠郚壠驋痄驋壠痄睇睇壠郚睇郚驋 = 80374965771608
        if 痄驋壠庄郚痄郚驋睇郚庄痄庄睇驋痄驋.args[0] == 4:
            庄壠庄驋庄庄驋庄睇痄睇睇睇痄驋驋庄 = 9383222258618
        if 痄驋壠庄郚痄郚驋睇郚庄痄庄睇驋痄驋.args[0] == 5:
            驋壠睇郚睇睇庄庄郚郚睇痄睇痄驋睇壠 = 108494031116051
        if 痄驋壠庄郚痄郚驋睇郚庄痄庄睇驋痄驋.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3867485')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9038283')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3860944')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9038283')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3858615')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9038283')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('18359296')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~23146)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('318303')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9603798)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9603825)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14942208')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))()]))())
壠痄壠驋庄痄驋壠郚痄郚痄庄驋壠壠睇 = 0
while 壠痄壠驋庄痄驋壠郚痄郚痄庄驋壠壠睇 != 2:
    壠痄壠驋庄痄驋壠郚痄郚痄庄驋壠壠睇 += 1
    try:
        raise VELIMATIX(壠痄壠驋庄痄驋壠郚痄郚痄庄驋壠壠睇)
    except VELIMATIX as 驋驋壠痄庄郚庄郚痄壠痄睇壠郚庄痄庄:
        if 驋驋壠痄庄郚庄郚痄壠痄睇壠郚庄痄庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7263792')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6710327')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7258212')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6710327')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7230176)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7218682)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7230176)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7259016)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1249568')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7515930624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3839847')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8089383')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3839905')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8089383')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('149752512')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8089383')")[::-1])))()]))())
壠驋壠驋郚郚驋郚庄睇驋郚壠郚庄痄睇 = 0
while 壠驋壠驋郚郚驋郚庄睇驋郚壠郚庄痄睇 != 2:
    壠驋壠驋郚郚驋郚庄睇驋郚壠郚庄痄睇 += 1
    try:
        raise VELIMATIX(壠驋壠驋郚郚驋郚庄睇驋郚壠郚庄痄睇)
    except VELIMATIX as 庄睇痄睇壠睇壠壠庄驋壠驋睇庄郚庄郚:
        if 庄睇痄睇壠睇壠壠庄驋壠驋睇庄郚庄郚.args[0] == 3:
            痄驋睇驋睇庄驋驋郚郚郚睇郚睇壠庄驋 = 179153016384267
        if 庄睇痄睇壠睇壠壠庄驋壠驋睇庄郚庄郚.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9101824')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('359563264')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('28010')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~25144)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('466928')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('449511424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1277952')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('138')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('16384000')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('64487424')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2375')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))())
壠痄郚睇睇郚壠壠郚痄壠庄壠痄庄痄郚 = 0
while 壠痄郚睇睇郚壠壠郚痄壠庄壠痄庄痄郚 != 2:
    壠痄郚睇睇郚壠壠郚痄壠庄壠痄庄痄郚 += 1
    try:
        raise VELIMATIX(壠痄郚睇睇郚壠壠郚痄壠庄壠痄庄痄郚)
    except VELIMATIX as 壠壠壠郚郚郚痄郚痄睇驋睇睇郚郚睇庄:
        if 壠壠壠郚郚郚痄郚痄睇驋睇睇郚郚睇庄.args[0] == 3:
            郚庄壠壠庄郚郚驋庄庄睇驋庄痄睇痄壠 = 149735096823791
        if 壠壠壠郚郚郚痄郚痄睇驋睇睇郚郚睇庄.args[0] == 1:
            礟絩嚭榽啓鶥()['鴮嶶繺珚烕醚'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('44952102')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8162511')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1152618)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1152566)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1152618)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1152516)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2555904')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))()]))())
驋庄郚睇驋郚郚驋驋庄壠郚驋睇郚驋壠 = 0
while 驋庄郚睇驋郚郚驋驋庄壠郚驋睇郚驋壠 != 2:
    驋庄郚睇驋郚郚驋驋庄壠郚驋睇郚驋壠 += 1
    try:
        raise VELIMATIX(驋庄郚睇驋郚郚驋驋庄壠郚驋睇郚驋壠)
    except VELIMATIX as 壠郚庄驋庄痄睇痄驋睇郚庄痄驋壠睇睇:
        if 壠郚庄驋庄痄睇痄驋睇郚庄痄驋壠睇睇.args[0] == 1:
            礟絩嚭榽啓鶥()['憡針事绑暢惲'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1878900)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1878867)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('655360')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('85')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('640')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~80)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('70656')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('166')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('84')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('74')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('68')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~60)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('901120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('69')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('55296')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1589248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('756')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54001664')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15466496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1666')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~122)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1768')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29097984')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13824')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('104')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54272')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('990')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15204352')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('32768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1170')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1150')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('99')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('220')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('232')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('122')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~86)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('89')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1824')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1728')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('485')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('45613056')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7864320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14720')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('623')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('458752')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('62')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('152')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~64)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('76')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~1)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~68)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('98')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('880')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('45088768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6815744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~94)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7929856')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('82')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2112')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('114')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2686976')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1815')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~109)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~61)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1620')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1605')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('598016')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2228224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~74)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('126')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~71)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('380')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19200')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~70)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~70)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25952256')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~90)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('84')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('104')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12800')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('756')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~94)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~108)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('812')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~99)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('74')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('98')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('79')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('244')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~97)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('154')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('124')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2916352')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~104)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~68)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1035')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1740')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('88')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~74)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('64')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~66)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1245184')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~77)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('80')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('25427968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2088')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1242')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1944')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~75)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2088')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1350')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~65)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~80)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1224')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('90')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('92')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('200704')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('22806528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15466496')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('94')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1428')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('299008')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('912')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~77)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1404')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~65)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('804')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~56)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('131')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4784128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~85)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3211264')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('944')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5832704')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1744')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('216')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5760')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('498')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('504')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('534')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('22806528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~72)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1872')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1782')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1962')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~100)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('96')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1512')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1386')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('69')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1368')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1908')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('95')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1062')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('576')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1710')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('135')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('194')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('105')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('67')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~75)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~124)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~111)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('648')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1589248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~43)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('700')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~14)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~72)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6946816')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('24117248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('67')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('13107200')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('864')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1245184')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('840')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('351')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7864320')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('592')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('67')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1056')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('592')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('66')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('768')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~81)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('55050240')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~54)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1536')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('240')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('185')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4224')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('222')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('54')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~77)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('47')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~52)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12288')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('73')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~120)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('116')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('808')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('178176')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('109')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('825')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('37888')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~67)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~48)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~50)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('230')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('56')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~51)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('42')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~55)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~53)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~45)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('19200')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('80')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('92')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~69)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~68)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1184')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~55)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2195456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('75776')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1600')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('442368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1260')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1616')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9699328')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('68')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('66')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~85)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('101376')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1712')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('444')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('164')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1184')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('250')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~53)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('536')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('107')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29184')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1818624')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('115')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('37888')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~56)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('700')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('490')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('01')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~10)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~62)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('94208')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('768')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~42)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6291456')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('63')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3145728')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~53)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('800')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~32)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('93')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3637248')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1620')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1515')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~42)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~61)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~63)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~92)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('112')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('26738688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~115)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2052')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1890')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('666')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('900')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~84)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('212')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('92')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1632')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('59')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~62)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('44')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))()]))())
        if 壠郚庄驋庄痄睇痄驋睇郚庄痄驋壠睇睇.args[0] == 3:
            驋壠睇痄庄痄郚郚壠睇庄郚郚痄郚庄壠 = 191737862618691
        if 壠郚庄驋庄痄睇痄驋睇郚庄痄驋壠睇睇.args[0] == 4:
            庄庄驋郚郚壠庄痄庄驋睇驋壠睇郚睇睇 = 24666617587398
        if 壠郚庄驋庄痄睇痄驋睇郚庄痄驋壠睇睇.args[0] == 5:
            痄驋驋郚驋壠郚驋郚壠壠睇庄痄痄壠痄 = 222700763746001
驋痄郚驋壠郚驋庄睇驋痄痄驋睇壠壠痄 = 0
while 驋痄郚驋壠郚驋庄睇驋痄痄驋睇壠壠痄 != 2:
    驋痄郚驋壠郚驋庄睇驋痄痄驋睇壠壠痄 += 1
    try:
        raise VELIMATIX(驋痄郚驋壠郚驋庄睇驋痄痄驋睇壠壠痄)
    except VELIMATIX as 壠驋驋郚痄壠驋郚壠驋庄驋庄驋驋郚痄:
        if 壠驋驋郚痄壠驋郚壠驋庄驋庄驋驋郚痄.args[0] == 1:
            礟絩嚭榽啓鶥()['俸輄嶖掄縷朮'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('265183191')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9659976')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6799569)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6799507)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('53315420529')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9659976')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('901120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('416')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~110)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('102453')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('416')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('139776')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3888')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7916')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('65536')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1276')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~121)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15488')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8388608')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~18)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7871)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2016')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('256')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6400')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7889')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('624')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('38')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~112)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1036648448')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1048576')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~98)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118455')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~123)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('47')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1620')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~15)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7848)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1760')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('132')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('156')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))()]))())
睇壠痄睇驋郚壠痄庄郚睇痄庄痄痄郚庄 = 0
while 睇壠痄睇驋郚壠痄庄郚睇痄庄痄痄郚庄 != 2:
    睇壠痄睇驋郚壠痄庄郚睇痄庄痄痄郚庄 += 1
    try:
        raise VELIMATIX(睇壠痄睇驋郚壠痄庄郚睇痄庄痄痄郚庄)
    except VELIMATIX as 庄壠郚痄庄壠郚庄郚驋郚庄痄庄郚庄壠:
        if 庄壠郚痄庄壠郚庄郚驋郚庄痄庄郚庄壠.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3815724')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2109773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3812121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2109773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3779012)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~3800944)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('118033660808')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2109773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3817444')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2109773')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6788864')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140494')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('411410485')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('681590505')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('681590505')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140562')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140560')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('620185955')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140487')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('657028685')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140559')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6140699')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('675450050')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('632466865')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5540416')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6140455)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6140423)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('416')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('259096576')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57344')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8192')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27648')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7887)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('16384')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('936')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('70767')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('108')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('288')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('891')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('113')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('441')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('873')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~41)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('282')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('33947648')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('412')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4096')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7208960')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7869)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14336')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('812')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1638')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~105)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~39)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('833')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('404')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('196')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~113)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~107)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~118)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('103')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('64')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('67584')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))()]))())
        if 庄壠郚痄庄壠郚庄郚驋郚庄痄庄郚庄壠.args[0] == 3:
            睇郚庄睇郚痄郚睇驋庄郚痄睇壠郚郚驋 = 197333177601911
痄郚郚庄壠痄驋郚睇痄睇庄郚壠睇驋壠 = 0
while 痄郚郚庄壠痄驋郚睇痄睇庄郚壠睇驋壠 != 2:
    痄郚郚庄壠痄驋郚睇痄睇庄郚壠睇驋壠 += 1
    try:
        raise VELIMATIX(痄郚郚庄壠痄驋郚睇痄睇庄郚壠睇驋壠)
    except VELIMATIX as 痄壠痄庄驋壠壠痄郚壠郚驋庄庄痄庄睇:
        if 痄壠痄庄驋壠壠痄郚壠郚驋庄庄痄庄睇.args[0] == 1:
            礟絩嚭榽啓鶥()['嵒蚎抒鹞垑劒'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('319363863')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7188818')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8188817)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8188869)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14548992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~126)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~49)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1122')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1989')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6528')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~96)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('256')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('38912')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('420')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('214')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~103)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~34)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20185088')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6881280')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7893')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3520')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('160')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~85)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('212992')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~11)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~230)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('312')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('3')")[::-1])))()]))())
        if 痄壠痄庄驋壠壠痄郚壠郚驋庄庄痄庄睇.args[0] == 3:
            睇庄驋壠痄痄痄郚驋庄驋郚痄驋睇庄壠 = 161961309734367
        if 痄壠痄庄驋壠壠痄郚壠郚驋庄庄痄庄睇.args[0] == 4:
            郚痄痄庄驋庄庄壠庄郚庄壠睇壠痄驋郚 = 63775192907184
        if 痄壠痄庄驋壠壠痄郚壠郚驋庄庄痄庄睇.args[0] == 5:
            郚驋睇睇睇壠庄睇驋壠壠痄痄痄驋睇郚 = 242270239659275
郚驋庄庄睇郚壠郚驋庄驋睇痄痄郚睇庄 = 0
while 郚驋庄庄睇郚壠郚驋庄驋睇痄痄郚睇庄 != 2:
    郚驋庄庄睇郚壠郚驋庄驋睇痄痄郚睇庄 += 1
    try:
        raise VELIMATIX(郚驋庄庄睇郚壠郚驋庄驋睇痄痄郚睇庄)
    except VELIMATIX as 睇驋壠郚郚壠痄痄郚郚睇庄睇驋郚郚郚:
        if 睇驋壠郚郚壠痄痄郚郚睇庄睇驋郚郚郚.args[0] == 1:
            礟絩嚭榽啓鶥()['雕殠事蕨偅觕'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('310700598')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2866697')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('156')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))()]))())
        if 睇驋壠郚郚壠痄痄郚郚睇庄睇驋郚郚郚.args[0] == 3:
            庄痄庄睇驋驋庄睇痄郚郚壠郚郚驋壠痄 = 203095350228446
        if 睇驋壠郚郚壠痄痄郚郚睇庄睇驋郚郚郚.args[0] == 4:
            睇痄壠庄痄痄痄驋郚驋睇睇睇庄睇睇庄 = 178404602985648
        if 睇驋壠郚郚壠痄痄郚郚睇庄睇驋郚郚郚.args[0] == 5:
            驋痄郚庄睇壠睇郚睇痄驋睇庄痄郚驋庄 = 279519899086281
郚驋郚壠睇驋驋驋壠睇痄驋壠睇驋睇郚 = 0
while 郚驋郚壠睇驋驋驋壠睇痄驋壠睇驋睇郚 != 2:
    郚驋郚壠睇驋驋驋壠睇痄驋壠睇驋睇郚 += 1
    try:
        raise VELIMATIX(郚驋郚壠睇驋驋驋壠睇痄驋壠睇驋睇郚)
    except VELIMATIX as 睇痄壠壠驋睇痄庄郚郚驋睇痄痄睇壠庄:
        if 睇痄壠壠驋睇痄庄郚郚驋睇痄痄睇壠庄.args[0] == 1:
            礟絩嚭榽啓鶥()['璋楍儷窬掔滕'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4465903')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4685644')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4465942')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4685644')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4465864)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4465824)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4465864)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4471397)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('58720256')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('608')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9344')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~67)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('224')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~101)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~231)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('735')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('39')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('27525120')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4029952')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~51)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('41')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('159744')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))()]))())
驋郚郚睇驋睇睇驋郚驋痄驋睇驋壠驋庄 = 0
while 驋郚郚睇驋睇睇驋郚驋痄驋睇驋壠驋庄 != 2:
    驋郚郚睇驋睇睇驋郚驋痄驋睇驋壠驋庄 += 1
    try:
        raise VELIMATIX(驋郚郚睇驋睇睇驋郚驋痄驋睇驋壠驋庄)
    except VELIMATIX as 睇庄睇驋庄郚庄庄郚驋郚痄壠睇痄痄痄:
        if 睇庄睇驋庄郚庄庄郚驋郚痄壠睇痄痄痄.args[0] == 3:
            郚驋驋睇壠庄壠郚庄壠驋驋郚壠驋庄睇 = 149873210755375
        if 睇庄睇驋庄郚庄庄郚驋郚痄壠睇痄痄痄.args[0] == 4:
            壠痄庄睇郚庄庄庄郚痄痄驋睇庄痄痄庄 = 44595141120889
        if 睇庄睇驋庄郚庄庄郚驋郚痄壠睇痄痄痄.args[0] == 1:
            礟絩嚭榽啓鶥()['靈越鞊拟畲苎'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8683465)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~8683502)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8683551')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5643868')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('8683582')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5643868')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('911763825')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5643868')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('277870880')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5643868')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('14155776')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('259')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1870')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('120')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('544')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('127')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133501')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4096')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('299008')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~72)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('384')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('110')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~236)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6881280')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~16)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~48)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1888')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('61')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('215040')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('11')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('257916928')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('60817408')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('123')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7920)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('131')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4194304')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('442368')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~12)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7883)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('16896')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('9')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~9)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~46)'))))()]))())
驋壠庄郚壠郚庄痄痄壠驋驋郚壠睇痄壠 = 0
while 驋壠庄郚壠郚庄痄痄壠驋驋郚壠睇痄壠 != 2:
    驋壠庄郚壠郚庄痄痄壠驋驋郚壠睇痄壠 += 1
    try:
        raise VELIMATIX(驋壠庄郚壠郚庄痄痄壠驋驋郚壠睇痄壠)
    except VELIMATIX as 壠郚睇睇睇睇庄庄驋睇驋痄睇庄驋郚痄:
        if 壠郚睇睇睇睇庄庄驋睇驋痄睇庄驋郚痄.args[0] == 3:
            壠痄睇壠痄睇郚壠痄睇痄驋庄壠驋睇壠 = 184653494164592
        if 壠郚睇睇睇睇庄庄驋睇驋痄睇庄驋郚痄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1997696')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('34913')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('29207')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~33545)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~6)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~20296)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('33033')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))()]))()] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6634673')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4364366')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21757952')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('81')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1034027008')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~49)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7344')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('134419')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1751')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~43)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~17)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~54)'))))()]))())
驋壠壠睇睇驋驋驋郚庄驋郚驋郚痄壠庄 = 0
while 驋壠壠睇睇驋驋驋郚庄驋郚驋郚痄壠庄 != 2:
    驋壠壠睇睇驋驋驋郚庄驋郚驋郚痄壠庄 += 1
    try:
        raise VELIMATIX(驋壠壠睇睇驋驋驋郚庄驋郚驋郚痄壠庄)
    except VELIMATIX as 庄痄郚郚壠驋郚睇睇庄庄驋痄庄痄郚庄:
        if 庄痄郚郚壠驋郚睇睇庄庄驋痄庄痄郚庄.args[0] == 1:
            礟絩嚭榽啓鶥()[(lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('212200548993')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7693575')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('862688')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('21190')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('5')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('15936258048')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~36267)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~30017)'))))()]))()] = 隳泾馊腈珸譌(')9_9_4_3_5_7_5_6_1_8-(+9_9_5_3_5_7_5_6_1_8'[::-1])
        if 庄痄郚郚壠驋郚睇睇庄庄驋痄庄痄郚庄.args[0] == 3:
            壠睇郚庄睇睇庄壠痄痄郚驋睇睇郚壠庄 = 255892941408201
        if 庄痄郚郚壠驋郚睇睇庄庄驋痄庄痄郚庄.args[0] == 4:
            郚睇庄壠郚壠郚庄驋庄郚驋痄壠驋郚痄 = 178554915372720
壠痄痄庄驋驋驋壠壠庄庄驋驋驋睇郚睇 = 0
while 壠痄痄庄驋驋驋壠壠庄庄驋驋驋睇郚睇 != 2:
    壠痄痄庄驋驋驋壠壠庄庄驋驋驋睇郚睇 += 1
    try:
        raise VELIMATIX(壠痄痄庄驋驋驋壠壠庄庄驋驋驋睇郚睇)
    except VELIMATIX as 痄庄睇睇壠睇庄驋睇痄壠睇痄壠痄驋庄:
        if 痄庄睇睇壠睇庄驋睇痄壠睇痄壠痄驋庄.args[0] == 3:
            睇睇痄痄痄驋壠壠痄壠郚睇壠壠睇驋睇 = 199883372908382
        if 痄庄睇睇壠睇庄驋睇痄壠睇痄壠痄驋庄.args[0] == 1:
            礟絩嚭榽啓鶥()['袶毆鹗楽椥鏞'[::-1]] = 隳泾馊腈珸譌((lambda: 五檍秲悀愊為([(lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('20447232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~69)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~102)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('124')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('608')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~127)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('261')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~125)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~19)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~116)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('608')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('91')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('440')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('851968')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('31')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~13)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7840)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7168')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('6')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('512')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('119')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7893)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('36')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('432')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('436')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~7911)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~4)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~106)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('412')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4194304')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('121')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7924')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('129')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('125')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('133943')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('49')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('57')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('232')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7890')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('106')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('4096')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('1911')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('7')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('12713984')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('71')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('128')")) >> 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('51')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('50')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('50')")) - 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('82')")) // 躢泤嬦鍆餚瑖(隳泾馊腈珸譌("碙鼪母犘攚媟('2')")[::-1])))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~35)'))))(), (lambda: 獒霯鹲妞瞣瀷(躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~2)')) ^ 躢泤嬦鍆餚瑖(隳泾馊腈珸譌('碙鼪母犘攚媟(~37)'))))()]))())
import re
import requests
from bs4 import BeautifulSoup
import os
import sys
import hashlib
庄睇壠壠睇驋痄庄庄庄痄庄郚郚驋驋痄 = 0
while 庄睇壠壠睇驋痄庄庄庄痄庄郚郚驋驋痄 != 2:
    庄睇壠壠睇驋痄庄庄庄痄庄郚郚驋驋痄 += 1
    try:
        raise VELIMATIX(庄睇壠壠睇驋痄庄庄庄痄庄郚郚驋驋痄)
    except VELIMATIX as 痄壠庄庄庄壠壠痄壠睇郚痄痄壠睇壠壠:
        if 痄壠庄庄庄壠壠痄壠睇郚痄痄壠睇壠壠.args[0] == 1:
            USER_SESSION_FILE = 昖瀫勗鋠蝮颣
        if 痄壠庄庄庄壠壠痄壠睇郚痄痄壠睇壠壠.args[0] == 3:
            驋痄庄驋庄驋庄郚睇痄郚壠郚痄庄痄痄 = 4951910998725
        if 痄壠庄庄庄壠壠痄壠睇郚痄痄壠睇壠壠.args[0] == 4:
            痄睇驋痄睇驋壠驋睇郚郚痄痄睇驋庄郚 = 34324036462327
        if 痄壠庄庄庄壠壠痄壠睇郚痄痄壠睇壠壠.args[0] == 5:
            痄痄痄睇庄驋驋郚郚睇驋庄郚壠睇郚壠 = 234737511394802
痄睇郚庄驋庄庄睇郚驋庄睇庄睇驋驋郚 = 0
while 痄睇郚庄驋庄庄睇郚驋庄睇庄睇驋驋郚 != 2:
    痄睇郚庄驋庄庄睇郚驋庄睇庄睇驋驋郚 += 1
    try:
        raise VELIMATIX(痄睇郚庄驋庄庄睇郚驋庄睇庄睇驋驋郚)
    except VELIMATIX as 郚痄郚郚壠郚壠痄痄痄睇痄壠庄壠驋痄:
        if 郚痄郚郚壠郚壠痄痄痄睇痄壠庄壠驋痄.args[0] == 3:
            壠郚睇睇驋庄睇驋痄郚驋睇睇睇庄睇庄 = 25808564484368
        if 郚痄郚郚壠郚壠痄痄痄睇痄壠庄壠驋痄.args[0] == 4:
            壠驋郚庄郚睇睇驋庄驋庄痄驋驋壠壠睇 = 243685178910547
        if 郚痄郚郚壠郚壠痄痄痄睇痄壠庄壠驋痄.args[0] == 5:
            庄驋驋庄痄睇郚壠驋痄驋痄睇壠驋驋壠 = 239196179695262
        if 郚痄郚郚壠郚壠痄痄痄睇痄壠庄壠驋痄.args[0] == 1:
            session = requests.Session()

def isnumeric(value):
    庄睇驋驋庄睇驋庄壠驋睇郚郚庄睇郚驋 = 0
    while 庄睇驋驋庄睇驋庄壠驋睇郚郚庄睇郚驋 != 2:
        庄睇驋驋庄睇驋庄壠驋睇郚郚庄睇郚驋 += 1
        try:
            raise VELIMATIX(庄睇驋驋庄睇驋庄壠驋睇郚郚庄睇郚驋)
        except VELIMATIX as 壠郚壠驋庄壠庄驋驋壠痄睇郚睇驋庄驋:
            if 壠郚壠驋庄壠庄驋驋壠痄睇郚睇驋庄驋.args[0] == 1:
                try:
                    return 碙鼪母犘攚媟(value).isnumeric()
                except:
                    return 氞渏賿谿晤嵥

def check_login(cookie, 痄痄郚睇睇郚壠壠睇睇壠痄驋睇睇壠睇):
    郚壠郚壠郚痄驋痄庄庄驋睇庄庄驋郚壠 = 0
    while 郚壠郚壠郚痄驋痄庄庄驋睇庄庄驋郚壠 != 4:
        郚壠郚壠郚痄驋痄庄庄驋睇庄庄驋郚壠 += 1
        try:
            raise VELIMATIX(郚壠郚壠郚痄驋痄庄庄驋睇庄庄驋郚壠)
        except VELIMATIX as 壠睇郚痄睇睇痄驋庄痄壠睇壠壠睇庄庄:
            if 壠睇郚痄睇睇痄驋庄痄壠睇壠壠睇庄庄.args[0] == 3:
                if 湝虗擶瑍梳暕 in response:
                    return (琧軬兡壄顴鏨, None, None)
                elif 歂詋纬闦箶傉 in response:
                    return (臮旄扼鉺戧鍖, cookie, response)
                else:
                    return (淿啲狑嵩蓟鍚, None, None)
            if 壠睇郚痄睇睇痄驋庄痄壠睇壠壠睇庄庄.args[0] == 1:
                if (lambda 郚壠睇郚郚睇壠郚睇痄睇痄睇郚睇郚壠: 郚壠睇郚郚睇壠郚睇痄睇痄睇郚睇郚壠 - (lambda: 6924 ^ 6927)())(痄痄郚睇睇郚壠壠睇睇壠痄驋睇睇壠睇):
                    headers = [隳泾馊腈珸譌("碙鼪母犘攚媟('65536')"), "碙鼪母犘攚媟('2323299')", "碙鼪母犘攚媟('9')", 隳泾馊腈珸譌("碙鼪母犘攚媟('3440640')"), 隳泾馊腈珸譌("碙鼪母犘攚媟('101')"), 隳泾馊腈珸譌('碙鼪母犘攚媟(~121)')]
                else:
                    headers = {賎萳襘黸萒吇: 墍礨嶼區艊纽, 堝磻胋鐹褑椱: 巠踾嵡韩姊齞, 籡廳綯翵猚贉: 钤恲酅蝐倦廘, 鵏晪沭蒠芔萱: 贶劢憭秹摽役, 寋牱鄣訢辉妌: 鮃魂紾墁侥荏, 縱墟鑘懶赱骓: 抧愕瀟氭莮翘, 蟩蚯甴喑猖扗: 塯瀿氽駀麺籿, 週务溶醥偋羐: 寿錑厗艈饦恾, 灒涡翛袐躒桨: cookie}
            if 壠睇郚痄睇睇痄驋庄痄壠睇壠壠睇庄庄.args[0] == 2:
                response = session.get(心徔傈爗揂淧, headers=headers).text
            if 壠睇郚痄睇睇痄驋庄痄壠睇壠壠睇庄庄.args[0] == 5:
                睇郚痄郚痄壠睇睇睇壠睇睇睇郚睇壠驋 = 169487356842777

def get_info(html, 驋壠庄壠郚壠郚壠痄壠庄壠痄驋庄壠壠):
    睇郚郚壠壠睇郚郚郚睇壠驋壠郚壠驋郚 = 0
    while 睇郚郚壠壠睇郚郚郚睇壠驋壠郚壠驋郚 != 5:
        睇郚郚壠壠睇郚郚郚睇壠驋壠郚壠驋郚 += 1
        try:
            raise VELIMATIX(睇郚郚壠壠睇郚郚郚睇壠驋壠郚壠驋郚)
        except VELIMATIX as 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄:
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 1:
                soup = BeautifulSoup(html, 湠碑瀡漧毴禂)
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 4:
                return (username, amount)
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 6:
                睇驋驋驋痄壠睇郚睇郚睇壠壠庄郚痄驋 = 236539466703593
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 7:
                痄壠郚郚庄壠睇壠郚痄壠庄驋驋庄驋壠 = 201091643186811
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 2:
                if (lambda 壠痄郚庄痄庄庄驋睇壠庄庄痄庄睇驋驋: 壠痄郚庄痄庄庄驋睇壠庄庄痄庄睇驋驋 - (lambda: 5758 ^ 5732)() + (lambda: 5881 ^ 5868)() - (lambda: 2789 ^ 2804)() - (lambda: 5162 ^ 5160)())(驋壠庄壠郚壠郚壠痄壠庄壠痄驋庄壠壠):
                    username_element = soup.find(骰郱珩曛孡计, class_=忙畱煪醘彇紇)
                else:
                    username_element = 隳泾馊腈珸譌('碙鼪母犘攚媟(~5)')
            if 痄壠睇壠壠郚睇驋壠痄壠庄庄睇庄驋痄.args[0] == 3:
                if username_element:
                    username_parts = username_element.text.split(褔苋鞶嚍鋧雭)
                    username = username_parts[翻橏鉟徐咷璷].strip()
                    amount = username_parts[槩蹶川佌庇椑].strip() if 廸俟鈟鱔頇蛽(username_parts) > 芥糨道炏船倃 else 鄃唶惬木蒇憈
                else:
                    username = 讻闤麱纥飵鯳
                    amount = 剮臥洢響嫳竡

def buy_like(cookie, id_post, amount, 痄睇痄庄痄庄郚驋睇庄睇驋庄睇壠郚睇):
    壠驋睇驋庄驋郚郚郚庄驋痄壠驋壠庄睇 = 0
    while 壠驋睇驋庄驋郚郚郚庄驋痄壠驋壠庄睇 != 5:
        壠驋睇驋庄驋郚郚郚庄驋痄壠驋壠庄睇 += 1
        try:
            raise VELIMATIX(壠驋睇驋庄驋郚郚郚庄驋痄壠驋壠庄睇)
        except VELIMATIX as 痄郚壠睇痄驋睇睇痄痄壠壠壠驋睇驋驋:
            if 痄郚壠睇痄驋睇睇痄痄壠壠壠驋睇驋驋.args[0] == 4:
                return response.text
            if 痄郚壠睇痄驋睇睇痄痄壠壠壠驋睇驋驋.args[0] == 1:
                headers = {烫潘魼髳亀瞍: 糴艉流守紿魨, 讕圧檄搾橤鑶: 饸惵匭窺旬縱, 醪鉜縠貐洣驦: 憩犑噹辺攱龐, 玚偃均薏秆嚑: 埶炅莈铄薞溎, 栯糆鐒寃砟宺: 磯垺啺誤矖礦, 券芈鐶孥漧髝: 堊淁旒芝蜹矩, 碢圂昣膒哻鐅: 瓘舚暍鶷蘙繡, 鈓诏葵烥隻欣: 敤聝韟稊驴褁, 糬囩媍鎭虦虬: 嫰阻袶琼囔罰, 憚驫烸數脴捇: 輆鰇痫满愙漯, 脤琼鶫濁犋煘: 匘迈虢漾鬙篽, 坾鱂授秓羊谟: 葝藝厒鯹檪蓊, 湋粤耂貞跆鳤: 寽憞漉盌軋叒, 监吱韝巐圊喾: cookie}
            if 痄郚壠睇痄驋睇睇痄痄壠壠壠驋睇驋驋.args[0] == 3:
                response = session.post(劃翅樑竭踍栮, headers=headers, data=payload)
            if 痄郚壠睇痄驋睇睇痄痄壠壠壠驋睇驋驋.args[0] == 2:
                if (lambda 睇庄睇睇痄壠睇壠驋郚郚痄睇驋痄郚庄: 睇庄睇睇痄壠睇壠驋郚郚痄睇驋痄郚庄)(痄睇痄庄痄庄郚驋睇庄睇驋庄睇壠郚睇):
                    payload = {憣萞豓叢苉觵: id_post, 訾翽亙鿬幃袪: 舘傗鹩绶滌膴, 鉓傮躵茊颠旚: 躢泤嬦鍆餚瑖(amount), 嵦枢蛔桮偋牐: 欝贿廅売崎呰}
                else:
                    payload = [隳泾馊腈珸譌('碙鼪母犘攚媟(~6523038)'), "碙鼪母犘攚媟('1')", "碙鼪母犘攚媟('2088')"]

def get_response(html, 睇睇庄驋庄睇痄痄痄睇痄痄痄壠郚痄郚):
    壠壠睇郚睇郚痄痄郚庄驋痄壠睇庄驋痄 = 0
    while 壠壠睇郚睇郚痄痄郚庄驋痄壠睇庄驋痄 != 6:
        壠壠睇郚睇郚痄痄郚庄驋痄壠睇庄驋痄 += 1
        try:
            raise VELIMATIX(壠壠睇郚睇郚痄痄郚庄驋痄壠睇庄驋痄)
        except VELIMATIX as 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚:
            if 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚.args[0] == 3:
                if (lambda 驋壠睇驋庄痄驋壠壠郚睇睇睇郚驋睇睇: 驋壠睇驋庄痄驋壠壠郚睇睇睇郚驋睇睇 - (lambda: 5372 ^ 5335)() - (lambda: 2198 ^ 2186)() + (lambda: 4779 ^ 4785)())(睇睇庄驋庄睇痄痄痄睇痄痄痄壠郚痄郚):
                    js_code = script_tag.text if script_tag else 晘鳃繀鏶匶樷
                else:
                    js_code = '碙鼪母犘攚媟(~13)'
            if 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚.args[0] == 4:
                pattern = 聚翠棋氭瓩輶
            if 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚.args[0] == 2:
                script_tag = soup.find(鴨堞裛矹腄硉, type=痭谮廻謷茲鱂)
            if 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚.args[0] == 1:
                soup = BeautifulSoup(html, 恉蝣奒儓橺琱)
            if 驋痄庄庄痄睇驋郚睇驋庄痄痄郚睇睇郚.args[0] == 5:
                try:
                    match = re.search(pattern, js_code)
                    message = match.group(啨消湨鲊鯒哵)
                    return message
                except 榐珊题酁产溏:
                    return 誘捫跺忛徾郙

def load_user_sessions():
    庄驋壠壠痄驋睇驋驋郚驋郚痄庄睇驋痄 = 0
    while 庄驋壠壠痄驋睇驋驋郚驋郚痄庄睇驋痄 != 3:
        庄驋壠壠痄驋睇驋驋郚驋郚痄庄睇驋痄 += 1
        try:
            raise VELIMATIX(庄驋壠壠痄驋睇驋驋郚驋郚痄庄睇驋痄)
        except VELIMATIX as 痄痄痄痄庄壠睇睇睇壠驋睇睇壠壠痄郚:
            if 痄痄痄痄庄壠睇睇睇壠驋睇睇壠壠痄郚.args[0] == 2:
                return __builtins__.__dict__['set']()
            if 痄痄痄痄庄壠睇睇睇壠驋睇睇壠壠痄郚.args[0] == 1:
                if os.path.exists(USER_SESSION_FILE):
                    with 崦砋荵橖糓甓(USER_SESSION_FILE, 餈罻癢谒婣訧) as file:
                        return __builtins__.__dict__['set']((line.strip() for line in file.readlines()))

def save_user_session(session_hash):
    郚庄壠驋庄驋郚睇驋庄痄郚驋驋睇郚庄 = 0
    while 郚庄壠驋庄驋郚睇驋庄痄郚驋驋睇郚庄 != 2:
        郚庄壠驋庄驋郚睇驋庄痄郚驋驋睇郚庄 += 1
        try:
            raise VELIMATIX(郚庄壠驋庄驋郚睇驋庄痄郚驋驋睇郚庄)
        except VELIMATIX as 郚庄睇壠庄壠睇郚痄郚痄壠睇壠庄庄睇:
            if 郚庄睇壠庄壠睇郚痄郚痄壠睇壠庄庄睇.args[0] == 1:
                with 崦砋荵橖糓甓(USER_SESSION_FILE, 荐涄眚酨颉濿) as file:
                    file.write(諢喺浜戶艈欬.format(session_hash, 醚烕珚繺嶶鴮))

def hash_cookie(cookie):
    睇痄郚庄痄驋驋驋睇睇睇痄郚庄驋郚睇 = 0
    while 睇痄郚庄痄驋驋驋睇睇睇痄郚庄驋郚睇 != 2:
        睇痄郚庄痄驋驋驋睇睇睇痄郚庄驋郚睇 += 1
        try:
            raise VELIMATIX(睇痄郚庄痄驋驋驋睇睇睇痄郚庄驋郚睇)
        except VELIMATIX as 睇壠庄壠壠驋庄睇痄庄庄壠睇睇睇痄壠:
            if 睇壠庄壠壠驋庄睇痄庄庄壠睇睇睇痄壠.args[0] == 3:
                庄郚壠睇睇驋庄壠庄庄郚痄郚驋驋壠郚 = 39399762691957
            if 睇壠庄壠壠驋庄睇痄庄庄壠睇睇睇痄壠.args[0] == 1:
                return hashlib.sha256(cookie.encode()).hexdigest()
壠驋庄痄驋睇庄驋壠庄郚睇睇庄睇郚驋 = 0
while 壠驋庄痄驋睇庄驋壠庄郚睇睇庄睇郚驋 != 2:
    壠驋庄痄驋睇庄驋壠庄郚睇睇庄睇郚驋 += 1
    try:
        raise VELIMATIX(壠驋庄痄驋睇庄驋壠庄郚睇睇庄睇郚驋)
    except VELIMATIX as 睇痄郚驋壠痄庄睇睇痄郚郚壠驋痄痄痄:
        if 睇痄郚驋壠痄庄睇睇痄郚郚壠驋痄痄痄.args[0] == 1:
            user_sessions = load_user_sessions()
痄驋痄壠驋驋壠壠睇壠驋驋壠壠睇痄郚 = 0
while 痄驋痄壠驋驋壠壠睇壠驋驋壠壠睇痄郚 != 2:
    痄驋痄壠驋驋壠壠睇壠驋驋壠壠睇痄郚 += 1
    try:
        raise VELIMATIX(痄驋痄壠驋驋壠壠睇壠驋驋壠壠睇痄郚)
    except VELIMATIX as 驋壠郚痄痄壠驋壠痄睇痄庄郚驋郚庄睇:
        if 驋壠郚痄痄壠驋壠痄睇痄庄郚驋郚庄睇.args[0] == 1:
            cookie = 惲暢绑事針憡
睇睇庄庄驋壠庄壠壠郚壠驋驋郚驋郚壠 = 0
while 睇睇庄庄驋壠庄壠壠郚壠驋驋郚驋郚壠 != 2:
    睇睇庄庄驋壠庄壠壠郚壠驋驋郚驋郚壠 += 1
    try:
        raise VELIMATIX(睇睇庄庄驋壠庄壠壠郚壠驋驋郚驋郚壠)
    except VELIMATIX as 痄痄壠郚壠庄睇郚壠郚郚驋痄驋痄睇壠:
        if 痄痄壠郚壠庄睇郚壠郚郚驋痄驋痄睇壠.args[0] == 1:
            cookie_hash = hash_cookie(cookie)
        if 痄痄壠郚壠庄睇郚壠郚郚驋痄驋痄睇壠.args[0] == 3:
            壠庄驋驋睇郚睇睇痄庄庄壠驋郚痄庄睇 = 63831437170669
        if 痄痄壠郚壠庄睇郚壠郚郚驋痄驋痄睇壠.args[0] == 4:
            庄壠庄郚壠壠痄郚痄驋壠痄郚驋驋庄痄 = 231211245629833
if cookie_hash in user_sessions:
    驋睇睇壠睇睇痄庄壠痄壠痄痄郚睇驋睇 = 0
    while 驋睇睇壠睇睇痄庄壠痄壠痄痄郚睇驋睇 != 3:
        驋睇睇壠睇睇痄庄壠痄壠痄痄郚睇驋睇 += 1
        try:
            raise VELIMATIX(驋睇睇壠睇睇痄庄壠痄壠痄痄郚睇驋睇)
        except VELIMATIX as 郚庄庄壠痄壠痄壠庄郚睇壠郚驋郚郚睇:
            if 郚庄庄壠痄壠痄壠庄郚睇壠郚驋郚郚睇.args[0] == 1:
                苂蒔铷鄦詍籀(朮縷掄嶖輄俸)
            if 郚庄庄壠痄壠痄壠庄郚睇壠郚驋郚郚睇.args[0] == 4:
                壠痄驋睇壠郚驋睇郚睇痄睇庄驋驋庄庄 = 244727574887023
            if 郚庄庄壠痄壠痄壠庄郚睇壠郚驋郚郚睇.args[0] == 2:
                崷沓偑眇蚧燢()
睇痄郚痄郚驋郚痄睇睇壠睇睇睇壠庄庄 = 0
while 睇痄郚痄郚驋郚痄睇睇壠睇睇睇壠庄庄 != 2:
    睇痄郚痄郚驋郚痄睇睇壠睇睇睇壠庄庄 += 1
    try:
        raise VELIMATIX(睇痄郚痄郚驋郚痄睇睇壠睇睇睇壠庄庄)
    except VELIMATIX as 驋郚睇壠驋驋庄壠庄郚郚驋睇庄郚壠睇:
        if 驋郚睇壠驋驋庄壠庄郚郚驋睇庄郚壠睇.args[0] == 3:
            庄郚痄壠壠痄郚郚郚驋庄庄睇驋睇庄壠 = 155504723014019
        if 驋郚睇壠驋驋庄壠庄郚郚驋睇庄郚壠睇.args[0] == 4:
            庄壠驋痄壠睇郚壠壠庄庄驋郚壠驋睇壠 = 268165875981745
        if 驋郚睇壠驋驋庄壠庄郚郚驋睇庄郚壠睇.args[0] == 5:
            痄壠庄壠庄驋郚驋庄壠睇驋壠睇郚痄睇 = 204816007597085
        if 驋郚睇壠驋驋庄壠庄郚郚驋睇庄郚壠睇.args[0] == 1:
            status, cookie, content = check_login(cookie, 3)
if not status:
    庄庄睇驋壠庄庄郚睇郚驋庄壠郚驋壠痄 = 0
    while 庄庄睇驋壠庄庄郚睇郚驋庄壠郚驋壠痄 != 3:
        庄庄睇驋壠庄庄郚睇郚驋庄壠郚驋壠痄 += 1
        try:
            raise VELIMATIX(庄庄睇驋壠庄庄郚睇郚驋庄壠郚驋壠痄)
        except VELIMATIX as 痄庄庄睇睇庄驋驋睇郚驋痄庄痄郚痄驋:
            if 痄庄庄睇睇庄驋驋睇郚驋痄庄痄郚痄驋.args[0] == 1:
                苂蒔铷鄦詍籀(轨腕嚴稂阠林)
            if 痄庄庄睇睇庄驋驋睇郚驋痄庄痄郚痄驋.args[0] == 4:
                郚驋庄睇痄睇驋庄郚壠郚驋驋壠庄痄睇 = 200648715225693
            if 痄庄庄睇睇庄驋驋睇郚驋痄庄痄郚痄驋.args[0] == 2:
                崷沓偑眇蚧燢()
驋驋壠壠庄驋驋睇壠郚痄睇痄驋驋庄庄 = 0
while 驋驋壠壠庄驋驋睇壠郚痄睇痄驋驋庄庄 != 2:
    驋驋壠壠庄驋驋睇壠郚痄睇痄驋驋庄庄 += 1
    try:
        raise VELIMATIX(驋驋壠壠庄驋驋睇壠郚痄睇痄驋驋庄庄)
    except VELIMATIX as 壠驋驋庄郚痄壠痄痄睇郚痄庄壠庄庄壠:
        if 壠驋驋庄郚痄壠痄痄睇郚痄庄壠庄庄壠.args[0] == 1:
            username, amount = get_info(content, 25)
苂蒔铷鄦詍籀(劒垑鹞抒蚎嵒)
苂蒔铷鄦詍籀(觕偅蕨事殠雕)
痄痄庄壠驋郚睇庄睇郚庄壠驋郚壠痄郚 = 0
while 痄痄庄壠驋郚睇庄睇郚庄壠驋郚壠痄郚 != 2:
    痄痄庄壠驋郚睇庄睇郚庄壠驋郚壠痄郚 += 1
    try:
        raise VELIMATIX(痄痄庄壠驋郚睇庄睇郚庄壠驋郚壠痄郚)
    except VELIMATIX as 驋郚睇郚庄驋壠庄驋痄驋痄郚痄睇郚郚:
        if 驋郚睇郚庄驋壠庄驋痄驋痄郚痄睇郚郚.args[0] == 3:
            郚郚庄驋壠壠驋壠郚睇壠壠驋壠痄郚壠 = 100128326287912
        if 驋郚睇郚庄驋壠庄驋痄驋痄郚痄睇郚郚.args[0] == 4:
            郚庄壠郚郚壠庄庄郚庄痄痄驋睇驋痄睇 = 86489519063264
        if 驋郚睇郚庄驋壠庄驋痄驋痄郚痄睇郚郚.args[0] == 5:
            庄郚庄驋痄郚壠驋壠痄庄驋壠壠驋郚壠 = 45009647615694
        if 驋郚睇郚庄驋壠庄驋痄驋痄郚痄睇郚郚.args[0] == 1:
            id_post = 簛恕欀挐崗竲(滕掔窬儷楍璋)
if not isnumeric(id_post):
    郚壠郚庄郚庄驋郚壠庄睇壠睇驋睇痄郚 = 0
    while 郚壠郚庄郚庄驋郚壠庄睇壠睇驋睇痄郚 != 3:
        郚壠郚庄郚庄驋郚壠庄睇壠睇驋睇痄郚 += 1
        try:
            raise VELIMATIX(郚壠郚庄郚庄驋郚壠庄睇壠睇驋睇痄郚)
        except VELIMATIX as 庄驋庄睇壠庄睇壠驋郚痄庄郚驋庄驋驋:
            if 庄驋庄睇壠庄睇壠驋郚痄庄郚驋庄驋驋.args[0] == 4:
                庄庄壠壠痄痄郚庄驋睇睇痄壠驋驋壠睇 = 83909894842641
            if 庄驋庄睇壠庄睇壠驋郚痄庄郚驋庄驋驋.args[0] == 5:
                痄痄壠壠庄痄庄庄郚庄睇壠庄驋睇睇痄 = 105185076437963
            if 庄驋庄睇壠庄睇壠驋郚痄庄郚驋庄驋驋.args[0] == 2:
                崷沓偑眇蚧燢()
            if 庄驋庄睇壠庄睇壠驋郚痄庄郚驋庄驋驋.args[0] == 1:
                苂蒔铷鄦詍籀(苎畲拟鞊越靈)
壠痄庄驋庄郚痄睇郚驋郚驋痄郚壠痄壠 = 0
while 壠痄庄驋庄郚痄睇郚驋郚驋痄郚壠痄壠 != 2:
    壠痄庄驋庄郚痄睇郚驋郚驋痄郚壠痄壠 += 1
    try:
        raise VELIMATIX(壠痄庄驋庄郚痄睇郚驋郚驋痄郚壠痄壠)
    except VELIMATIX as 驋驋庄睇庄郚驋庄郚壠驋睇庄睇庄郚壠:
        if 驋驋庄睇庄郚驋庄郚壠驋睇庄睇庄郚壠.args[0] == 3:
            郚郚驋睇睇驋壠郚睇壠睇痄驋郚郚庄睇 = 183665274130758
        if 驋驋庄睇庄郚驋庄郚壠驋睇庄睇庄郚壠.args[0] == 1:
            amount = 簛恕欀挐崗竲(秮衛爑茏低脃)
if not isnumeric(amount) or 躢泤嬦鍆餚瑖(amount) > 透楏勁皼趸畒:
    郚郚郚痄郚驋睇郚痄庄驋壠驋驋郚驋睇 = 0
    while 郚郚郚痄郚驋睇郚痄庄驋壠驋驋郚驋睇 != 3:
        郚郚郚痄郚驋睇郚痄庄驋壠驋驋郚驋睇 += 1
        try:
            raise VELIMATIX(郚郚郚痄郚驋睇郚痄庄驋壠驋驋郚驋睇)
        except VELIMATIX as 庄睇睇睇壠睇庄驋痄壠庄睇痄庄壠睇驋:
            if 庄睇睇睇壠睇庄驋痄壠庄睇痄庄壠睇驋.args[0] == 2:
                崷沓偑眇蚧燢()
            if 庄睇睇睇壠睇庄驋痄壠庄睇痄庄壠睇驋.args[0] == 1:
                苂蒔铷鄦詍籀(鏞椥楽鹗毆袶)
痄驋壠庄痄郚壠庄壠睇痄痄郚痄痄驋郚 = 0
while 痄驋壠庄痄郚壠庄壠睇痄痄郚痄痄驋郚 != 2:
    痄驋壠庄痄郚壠庄壠睇痄痄郚痄痄驋郚 += 1
    try:
        raise VELIMATIX(痄驋壠庄痄郚壠庄壠睇痄痄郚痄痄驋郚)
    except VELIMATIX as 驋壠庄庄睇痄驋驋郚痄庄庄驋郚痄庄郚:
        if 驋壠庄庄睇痄驋驋郚痄庄庄驋郚痄庄郚.args[0] == 3:
            庄壠驋痄郚壠睇睇痄郚驋睇睇睇驋驋壠 = 105113307038933
        if 驋壠庄庄睇痄驋驋郚痄庄庄驋郚痄庄郚.args[0] == 4:
            睇庄驋郚睇驋庄庄壠睇庄痄睇痄郚壠壠 = 119304700217890
        if 驋壠庄庄睇痄驋驋郚痄庄庄驋郚痄庄郚.args[0] == 5:
            庄郚睇壠睇驋壠庄庄庄庄痄壠壠壠郚庄 = 200154656084688
        if 驋壠庄庄睇痄驋驋郚痄庄庄驋郚痄庄郚.args[0] == 1:
            response = buy_like(cookie, id_post, amount, 1)
睇痄睇痄睇郚壠驋睇睇郚痄郚庄驋痄郚 = 0
while 睇痄睇痄睇郚壠驋睇睇郚痄郚庄驋痄郚 != 2:
    睇痄睇痄睇郚壠驋睇睇郚痄郚庄驋痄郚 += 1
    try:
        raise VELIMATIX(睇痄睇痄睇郚壠驋睇睇郚痄郚庄驋痄郚)
    except VELIMATIX as 郚郚痄郚庄睇痄壠郚庄痄壠庄郚郚睇痄:
        if 郚郚痄郚庄睇痄壠郚庄痄壠庄郚郚睇痄.args[0] == 1:
            response = get_response(response, 46)
苂蒔铷鄦詍籀(response)
save_user_session(cookie_hash)