class VELIMATIX(MemoryError):0
__import__('builtins').莓渡圤锽烵碷=getattr
__import__('builtins').慆酠舡游譺瑎=dir
__import__('builtins').五灂绚顥叇襃=__import__
__import__('builtins').騆挅襜苎蠙觸=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('eurT'[::-1])])
__import__('builtins').腻慧峗譩笖摠=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('eslaF'[::-1])])
__import__('builtins').嗼钃绵浌茫駽=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('loob'[::-1])])
__import__('builtins').诋练堸炶创妍=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('epyt'[::-1])])
__import__('builtins').禑攅颿饥襓铹=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rts'[::-1])])
__import__('builtins').驠衽堍埑站睱=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tni'[::-1])])
__import__('builtins').膙僽歎宮幷摶=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('cexe'[::-1])])
__import__('builtins').漘柸旘紎妢鬱=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tnirp'[::-1])])
__import__('builtins').塲襾宷迳礘鴤=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rttates'[::-1])])
__import__('builtins').惛抔鉒吿擹鷥=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('srav'[::-1])])
__import__('builtins').繰际落噄柼暔=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rhc'[::-1])])
__import__('builtins').瘃夃鱙墢蔽郃=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tsil'[::-1])])
__import__('builtins').蔽穈筥号敕藵=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('nepo'[::-1])])
__import__('builtins').慆酠舡游譺瑎=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rid'[::-1])])
__import__('builtins').站涧難澐睊问=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tcid'[::-1])])
__import__('builtins').驘儲婇匫逽集=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('elput'[::-1])])
__import__('builtins').鋬賘买坓玙禨=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('mus'[::-1])])
__import__('builtins').契怎艔囏塈逹=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('detros'[::-1])])
__import__('builtins').矮炝斉鲗氐鍼=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('dnuor'[::-1])])
__import__('builtins').铎倃緇拃筮惡=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rper'[::-1])])
__import__('builtins').潉宮梋靍跬珕=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('wop'[::-1])])
__import__('builtins').懠摦鈋筨闦髅=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tco'[::-1])])
__import__('builtins').陛鼹敖籉立塣=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('txena'[::-1])])
__import__('builtins').隍頩铼与遮渱=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('txen'[::-1])])
__import__('builtins').塩历鋈净杮犅=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('nim'[::-1])])
__import__('builtins').樃粌帩侧傝骳=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('xam'[::-1])])
__import__('builtins').歁傒蒮鯣囍魨=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('slacol'[::-1])])
__import__('builtins').忷靃氞昜刞觕=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('reti'[::-1])])
__import__('builtins').蘦葸釼籗淟鉊=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('ssalcbussi'[::-1])])
__import__('builtins').瘒転棾豶晻晥=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrElacoLdnuobnU'[::-1])])
__import__('builtins').偍蠓際荠骒潓=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('di'[::-1])])
__import__('builtins').詟癱澸鐃敼龀=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('hsah'[::-1])])
__import__('builtins').劎諌糆觛馾燇=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rttasah'[::-1])])
__import__('builtins').衟鼃鹧泻遟紫=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tamrof'[::-1])])
__import__('builtins').澭潫揚榲樤靺=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('domvid'[::-1])])
__import__('builtins').恢瀃卅秫穾驉=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rttaled'[::-1])])
__import__('builtins').嘴鶧簼煐囅麹=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('elballac'[::-1])])
__import__('builtins').顛繻锎核山锃=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tniopkaerb'[::-1])])
__import__('builtins').揗蛬奦淡豃扩=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('nib'[::-1])])
__import__('builtins').聪眜嵾鱹瞵矁=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('iicsa'[::-1])])
__import__('builtins').糈蝶襺茜鍊蕮=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('yna'[::-1])])
__import__('builtins').淼悝硦篲鰞澂=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('lla'[::-1])])
__import__('builtins').霌浔臃雔畍羇=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('sba'[::-1])])
__import__('builtins').偭乚趬臡攗偞=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('xeh'[::-1])])
__import__('builtins').凾钋卝桁垻罽=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('desrever'[::-1])])
__import__('builtins').颔凩货琱轂骞=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('dro'[::-1])])
__import__('builtins').譩誵唐譜鬷剌=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tiuq'[::-1])])
__import__('builtins').聰壏拢鉻菛埲=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tixe'[::-1])])
__import__('builtins').廘獬鳓蹛仏颩=莓渡圤锽烵碷(五灂绚顥叇襃('stseuqer'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('stseuqer'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('stseuqer'[::-1])).index('teg'[::-1])])
__import__('builtins').槗培術虉絣滨=莓渡圤锽烵碷(五灂绚顥叇襃('stseuqer'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('stseuqer'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('stseuqer'[::-1])).index('tsop'[::-1])])
__import__('builtins').諺崜摦拥侠喅=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('etaremune'[::-1])])
__import__('builtins').銫粕侶恄厐琠=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('pam'[::-1])])
__import__('builtins').佛号鳑磐縞觧=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrExatnyS'[::-1])])
__import__('builtins').旋験搔睵爧兀=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEemaN'[::-1])])
__import__('builtins').熻竻暫嘈癰柗=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEdnuoFtoNeliF'[::-1])])
__import__('builtins').澳甹之襜繎嶝=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEnoissimreP'[::-1])])
__import__('builtins').羢杨簔珈縡濦=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrESO'[::-1])])
__import__('builtins').梢鎎麠絧涁拥=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEedocnEedocinU'[::-1])])
__import__('builtins').傶傑缷醝誓炝=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEtropmI'[::-1])])
__import__('builtins').蘯元壽諽燡玑=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEedoceDedocinU'[::-1])])
__import__('builtins').鉢叢砟嫌艱鄫=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('egnar'[::-1])])
__import__('builtins').擟肑幫纔菝攜=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('elipmoc'[::-1])])
__import__('builtins').岠餜玖鷣拶洒=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('slabolg'[::-1])])
__import__('builtins').罬筓鑵璁姬蛬=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEetubirttA'[::-1])])
__import__('builtins').她篨扁崛嬦壡=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEdnuoFtoNeludoM'[::-1])])
__import__('builtins').彻薦芍蟘聚跔=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('noitpecxE'[::-1])])
__import__('builtins').暽癨橉葦蹯嬰=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEeulaV'[::-1])])
__import__('builtins').鞅剚礰壂劌鷇=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrExednI'[::-1])])
__import__('builtins').焱粯札柗摏甽=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tpurretnIdraobyeK'[::-1])])
__import__('builtins').酮吮莱骧蚻溅=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('ecnatsnisi'[::-1])])
__import__('builtins').碂剾鵣柇檿髙=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('nel'[::-1])])
__import__('builtins').爎峬胬蟰俣玞=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('tupni'[::-1])])
__import__('builtins').煦跆傪妳锭矯=莓渡圤锽烵碷(五灂绚顥叇襃('lahsram'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('lahsram'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('lahsram'[::-1])).index('sdaol'[::-1])])
__import__('builtins').裦伧掼蛙辜齖=煦跆傪妳锭矯(b'\xda\x00').join
__import__('builtins').呸楯畏冏魻炠=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('taolf'[::-1])])
__import__('builtins').艭櫗鼆锯铢几=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('rorrEFOE'[::-1])])
__import__('builtins').进桂屔琭描硭=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('setyb'[::-1])])
__import__('builtins').斒獲厸褆倪擏=莓渡圤锽烵碷(五灂绚顥叇襃('sys'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('sys'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('sys'[::-1])).index('tixe'[::-1])])
__import__('builtins').逇朋謒鉂煆舌=莓渡圤锽烵碷(五灂绚顥叇襃('snitliub'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('snitliub'[::-1])).index('lave'[::-1])])
__import__('builtins').琧衂痰葲笲孈=莓渡圤锽烵碷(五灂绚顥叇襃('bilz'[::-1]),慆酠舡游譺瑎(五灂绚顥叇襃('bilz'[::-1]))[慆酠舡游譺瑎(五灂绚顥叇襃('bilz'[::-1])).index('sserpmoced'[::-1])])
閛栏毶详详叄栏叄叄毶剔叄叄毶叄详叄 = 0
while 閛栏毶详详叄栏叄叄毶剔叄叄毶叄详叄 != 2:
    閛栏毶详详叄栏叄叄毶剔叄叄毶叄详叄 += 1
    try:
        raise VELIMATIX(閛栏毶详详叄栏叄叄毶剔叄叄毶叄详叄)
    except VELIMATIX as 栏毶毶剔毶毶叄叄毶栏详详毶详栏剔毶:
        if 栏毶毶剔毶毶叄叄毶栏详详毶详栏剔毶.args[0] == 3:
            毶閛剔叄剔叄剔叄閛叄栏剔栏栏叄叄剔 = 239003638995046
        if 栏毶毶剔毶毶叄叄毶栏详详毶详栏剔毶.args[0] == 1:
            惛抔鉒吿擹鷥()['滤娙哄扭寅燄'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~55)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('590')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39845888')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('65')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60817408')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1920')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~112)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35)'))))()]))())
叄详叄栏閛详毶详剔毶閛详閛毶叄剔叄 = 0
while 叄详叄栏閛详毶详剔毶閛详閛毶叄剔叄 != 2:
    叄详叄栏閛详毶详剔毶閛详閛毶叄剔叄 += 1
    try:
        raise VELIMATIX(叄详叄栏閛详毶详剔毶閛详閛毶叄剔叄)
    except VELIMATIX as 閛详閛閛剔叄叄剔剔閛详毶叄毶详毶栏:
        if 閛详閛閛剔叄叄剔剔閛详毶叄毶详毶栏.args[0] == 3:
            毶叄栏剔毶叄毶閛閛毶閛毶剔毶剔毶叄 = 3108920183641
        if 閛详閛閛剔叄叄剔剔閛详毶叄毶详毶栏.args[0] == 4:
            閛栏剔栏閛栏栏详毶閛栏栏閛剔栏剔详 = 22585170547386
        if 閛详閛閛剔叄叄剔剔閛详毶叄毶详毶栏.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('282224')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~27415)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('47558656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('299959')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38811')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('335379')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))()] = not 嗼钃绵浌茫駽(禑攅颿饥襓铹(腻慧峗譩笖摠))
毶叄叄叄叄栏剔叄栏详栏剔栏栏毶详剔 = 0
while 毶叄叄叄叄栏剔叄栏详栏剔栏栏毶详剔 != 2:
    毶叄叄叄叄栏剔叄栏详栏剔栏栏毶详剔 += 1
    try:
        raise VELIMATIX(毶叄叄叄叄栏剔叄栏详栏剔栏栏毶详剔)
    except VELIMATIX as 毶栏毶剔栏栏毶閛毶閛详栏栏剔叄栏毶:
        if 毶栏毶剔栏栏毶閛毶閛详栏栏剔叄栏毶.args[0] == 3:
            閛剔閛叄毶栏叄叄剔毶详剔毶毶栏閛栏 = 259278707457192
        if 毶栏毶剔栏栏毶閛毶閛详栏栏剔叄栏毶.args[0] == 1:
            惛抔鉒吿擹鷥()['緧擢逭釸鈺轼'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9169702')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3669619')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169663)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169572)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169663)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169571)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('843608996')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3669619')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9169773')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3669619')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9169755')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3669619')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169663)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9169571)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7471104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))()]))())
毶剔详閛閛剔叄栏毶详栏栏毶剔叄毶叄 = 0
while 毶剔详閛閛剔叄栏毶详栏栏毶剔叄毶叄 != 2:
    毶剔详閛閛剔叄栏毶详栏栏毶剔叄毶叄 += 1
    try:
        raise VELIMATIX(毶剔详閛閛剔叄栏毶详栏栏毶剔叄毶叄)
    except VELIMATIX as 栏叄閛叄详栏毶栏栏毶剔閛閛栏閛閛栏:
        if 栏叄閛叄详栏毶栏栏毶剔閛閛栏閛閛栏.args[0] == 3:
            毶详剔详栏叄毶栏详閛栏閛毶剔叄閛叄 = 211894691857361
        if 栏叄閛叄详栏毶栏栏毶剔閛閛栏閛閛栏.args[0] == 4:
            剔剔栏叄详毶閛毶閛閛閛详剔叄閛详閛 = 72842406220091
        if 栏叄閛叄详栏毶栏栏毶剔閛閛栏閛閛栏.args[0] == 5:
            详栏閛閛详閛閛剔叄叄详叄叄详閛栏剔 = 35740951734524
        if 栏叄閛叄详栏毶栏栏毶剔閛閛栏閛閛栏.args[0] == 1:
            惛抔鉒吿擹鷥()['痔褌诛釱蘢屎'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~34)'))))()]))())
閛详叄详閛毶剔毶栏毶閛栏閛毶毶毶详 = 0
while 閛详叄详閛毶剔毶栏毶閛栏閛毶毶毶详 != 2:
    閛详叄详閛毶剔毶栏毶閛栏閛毶毶毶详 += 1
    try:
        raise VELIMATIX(閛详叄详閛毶剔毶栏毶閛栏閛毶毶毶详)
    except VELIMATIX as 详详剔閛閛叄叄毶栏详栏叄详閛叄毶毶:
        if 详详剔閛閛叄叄毶栏详栏叄详閛叄毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2844477)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2878778)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2881163')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7744482')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2870878')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7744482')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78416541936')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7744482')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105468')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('96423936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('225800757')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3679875')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5789828')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3679875')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5789862')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3679875')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5789862')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3679875')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('584766063')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3679875')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('917504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~121)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~42)'))))()]))())
        if 详详剔閛閛叄叄毶栏详栏叄详閛叄毶毶.args[0] == 3:
            详毶毶閛毶閛详閛详栏毶详栏叄栏叄栏 = 17036793265276
        if 详详剔閛閛叄叄毶栏详栏叄详閛叄毶毶.args[0] == 4:
            叄剔毶叄叄叄剔毶閛栏栏栏详栏剔毶详 = 96531815118947
详毶叄叄剔閛剔详叄栏毶剔详栏详叄详 = 0
while 详毶叄叄剔閛剔详叄栏毶剔详栏详叄详 != 2:
    详毶叄叄剔閛剔详叄栏毶剔详栏详叄详 += 1
    try:
        raise VELIMATIX(详毶叄叄剔閛剔详叄栏毶剔详栏详叄详)
    except VELIMATIX as 閛栏毶剔叄剔剔叄閛叄详叄閛栏剔閛详:
        if 閛栏毶剔叄剔剔叄閛叄详叄閛栏剔閛详.args[0] == 1:
            惛抔鉒吿擹鷥()['殕寲熰聞豢觡'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('149860932')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8852483')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3842588)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3842664)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('413696')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1392')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48128')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1160')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1744')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('432')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('176')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202752')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1276')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1155')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7274496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('752')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1966080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('545')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('215')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1920')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('436')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23068672')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1843')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('198656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13440')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('28835840')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('24064')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('240')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('483328')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('305')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('240')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1720320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3488')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('485')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('515')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('525')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('22528')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6881280')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~113)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~117)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~63)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52953088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1862')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('836')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1995')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~114)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~118)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1552')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7208960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1648')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('63')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('672')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('57856')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('70')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('57')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('504')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~121)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1008')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('884736')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1287')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('475136')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('210')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('901120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12320768')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('133')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('420')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25856')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('26214400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5760')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3309568')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('135')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1485')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~110)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('56320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3296')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('295')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('66')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('103')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~54)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('295')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('62464')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~58)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~36)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112640')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~44)'))))()]))())
        if 閛栏毶剔叄剔剔叄閛叄详叄閛栏剔閛详.args[0] == 3:
            剔剔详毶栏閛毶详剔剔栏閛閛閛栏栏閛 = 152780334101822
        if 閛栏毶剔叄剔剔叄閛叄详叄閛栏剔閛详.args[0] == 4:
            閛閛閛閛閛閛毶叄栏毶毶毶详详栏毶详 = 50260537967865
剔详閛剔栏毶毶详叄毶剔剔剔閛剔叄剔 = 0
while 剔详閛剔栏毶毶详叄毶剔剔剔閛剔叄剔 != 2:
    剔详閛剔栏毶毶详叄毶剔剔剔閛剔叄剔 += 1
    try:
        raise VELIMATIX(剔详閛剔栏毶毶详叄毶剔剔剔閛剔叄剔)
    except VELIMATIX as 详毶閛栏閛详毶閛叄閛毶剔毶毶栏详详:
        if 详毶閛栏閛详毶閛叄閛毶剔毶毶栏详详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('397616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('34329')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~26311)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108776')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('153772')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('321456')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3181836)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3181867)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3768320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1485')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1560')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1474560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7667712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~113)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~61)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('223232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27525120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1944')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))()]))())
閛详叄閛毶叄叄閛閛毶閛详详毶剔详閛 = 0
while 閛详叄閛毶叄叄閛閛毶閛详详毶剔详閛 != 2:
    閛详叄閛毶叄叄閛閛毶閛详详毶剔详閛 += 1
    try:
        raise VELIMATIX(閛详叄閛毶叄叄閛閛毶閛详详毶剔详閛)
    except VELIMATIX as 閛栏剔详详栏栏栏详剔栏详剔详閛閛毶:
        if 閛栏剔详详栏栏栏详剔栏详剔详閛閛毶.args[0] == 3:
            详剔叄閛剔毶栏详剔栏剔栏閛详閛剔栏 = 232310984859398
        if 閛栏剔详详栏栏栏详剔栏详剔详閛閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27914669112')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7265621')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45151243225')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7265621')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('24709120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32329')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~26837)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33455)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2555904')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1008')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('784')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))()]))())
栏栏剔栏毶閛详叄叄毶毶叄閛详详毶毶 = 0
while 栏栏剔栏毶閛详叄叄毶毶叄閛详详毶毶 != 2:
    栏栏剔栏毶閛详叄叄毶毶叄閛详详毶毶 += 1
    try:
        raise VELIMATIX(栏栏剔栏毶閛详叄叄毶毶叄閛详详毶毶)
    except VELIMATIX as 栏详栏剔閛详详叄栏毶栏剔閛叄栏剔閛:
        if 栏详栏剔閛详详叄栏毶栏剔閛叄栏剔閛.args[0] == 3:
            閛栏详剔閛剔毶叄剔毶毶閛毶叄閛剔剔 = 204151278590905
        if 栏详栏剔閛详详叄栏毶栏剔閛叄栏剔閛.args[0] == 4:
            閛详毶详栏叄详閛叄叄剔栏閛栏详栏閛 = 217934567564140
        if 栏详栏剔閛详详叄栏毶栏剔閛叄栏剔閛.args[0] == 5:
            剔毶详毶栏详叄剔栏详详详毶剔叄毶閛 = 95760093257585
        if 栏详栏剔閛详详叄栏毶栏剔閛叄栏剔閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9065984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40263)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('279392')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('292448')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32673')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('217984')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('690')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('495')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1089')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1703936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('630')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~123)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('229376')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1188')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1067')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3342336')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7296')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))()]))())
栏栏閛详叄閛栏栏叄叄閛栏毶叄毶剔叄 = 0
while 栏栏閛详叄閛栏栏叄叄閛栏毶叄毶剔叄 != 2:
    栏栏閛详叄閛栏栏叄叄閛栏毶叄毶剔叄 += 1
    try:
        raise VELIMATIX(栏栏閛详叄閛栏栏叄叄閛栏毶叄毶剔叄)
    except VELIMATIX as 详详详栏閛閛详剔閛閛叄详閛叄详毶閛:
        if 详详详栏閛閛详剔閛閛叄详閛叄详毶閛.args[0] == 1:
            惛抔鉒吿擹鷥()['痨齵皯粢耷车'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('135546294')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6455743')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118168564')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6455743')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14942208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3440640')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('49')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40)'))))()]))())
        if 详详详栏閛閛详剔閛閛叄详閛叄详毶閛.args[0] == 3:
            栏閛閛详叄叄栏剔栏閛详閛毶閛毶叄毶 = 202040263153199
        if 详详详栏閛閛详剔閛閛叄详閛叄详毶閛.args[0] == 4:
            叄剔栏毶閛毶详叄栏閛详毶毶叄详详栏 = 106591224492188
详详栏閛閛毶毶毶毶详叄详剔栏毶剔详 = 0
while 详详栏閛閛毶毶毶毶详叄详剔栏毶剔详 != 2:
    详详栏閛閛毶毶毶毶详叄详剔栏毶剔详 += 1
    try:
        raise VELIMATIX(详详栏閛閛毶毶毶毶详叄详剔栏毶剔详)
    except VELIMATIX as 閛閛栏叄毶毶栏毶叄剔详剔剔栏叄毶毶:
        if 閛閛栏叄毶毶栏毶叄剔详剔剔栏叄毶毶.args[0] == 3:
            閛栏详閛剔栏閛閛栏栏详閛毶详閛毶详 = 239081013265403
        if 閛閛栏叄毶毶栏毶叄剔详剔剔栏叄毶毶.args[0] == 4:
            閛毶閛栏详毶閛栏剔閛叄详详栏毶叄剔 = 158916886133798
        if 閛閛栏叄毶毶栏毶叄剔详剔剔栏叄毶毶.args[0] == 5:
            閛叄栏剔閛栏毶閛详叄叄详閛剔閛栏毶 = 14853907620935
        if 閛閛栏叄毶毶栏毶叄剔详剔剔栏叄毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['怳撧菏顄鮒齷'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3445382')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3435443')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('234')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('98')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~101)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59904')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3648')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('505')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~123)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~120)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1035')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('351')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))())
毶剔毶叄毶详剔详叄毶详叄叄叄毶栏栏 = 0
while 毶剔毶叄毶详剔详叄毶详叄叄叄毶栏栏 != 2:
    毶剔毶叄毶详剔详叄毶详叄叄叄毶栏栏 += 1
    try:
        raise VELIMATIX(毶剔毶叄毶详剔详叄毶详叄叄叄毶栏栏)
    except VELIMATIX as 详閛栏剔毶毶閛毶剔毶剔详閛閛叄毶毶:
        if 详閛栏剔毶毶閛毶剔毶剔详閛閛叄毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['髰蹆鿞饍糍嵯'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3494736)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3494775)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3494736)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3494753)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3494775')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6374943')")[::-1])))()]))())
        if 详閛栏剔毶毶閛毶剔毶剔详閛閛叄毶毶.args[0] == 3:
            详剔详叄详详毶栏详叄叄详閛毶栏剔閛 = 76780476012641
        if 详閛栏剔毶毶閛毶剔毶剔详閛閛叄毶毶.args[0] == 4:
            叄详剔详详閛栏剔剔毶栏详叄閛详栏栏 = 47812701757090
        if 详閛栏剔毶毶閛毶剔毶剔详閛閛叄毶毶.args[0] == 5:
            栏栏毶详详剔剔剔剔剔剔详叄详栏毶毶 = 256970910523931
剔毶閛毶閛详叄栏閛叄毶叄毶剔剔剔剔 = 0
while 剔毶閛毶閛详叄栏閛叄毶叄毶剔剔剔剔 != 2:
    剔毶閛毶閛详叄栏閛叄毶叄毶剔剔剔剔 += 1
    try:
        raise VELIMATIX(剔毶閛毶閛详叄栏閛叄毶叄毶剔剔剔剔)
    except VELIMATIX as 剔閛毶叄毶剔叄详栏栏栏毶栏叄叄栏閛:
        if 剔閛毶叄毶剔叄详栏栏栏毶栏叄叄栏閛.args[0] == 3:
            剔剔毶详毶详栏剔栏栏叄叄栏详详详栏 = 217375485969644
        if 剔閛毶叄毶剔叄详栏栏栏毶栏叄叄栏閛.args[0] == 4:
            閛叄毶详详剔毶详毶详叄叄详剔剔叄详 = 275566609233192
        if 剔閛毶叄毶剔叄详栏栏栏毶栏叄叄栏閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('34124800')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('10251520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('26720')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~27370)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~29663)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('66693120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9338569)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9338606)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9338569)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9338554)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2880')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('612')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('696')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202752')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6815744')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('720')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1840')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('430080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1392')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('404')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~37)'))))()]))())
毶叄叄閛栏详毶详閛剔毶剔毶剔毶叄详 = 0
while 毶叄叄閛栏详毶详閛剔毶剔毶剔毶叄详 != 2:
    毶叄叄閛栏详毶详閛剔毶剔毶剔毶叄详 += 1
    try:
        raise VELIMATIX(毶叄叄閛栏详毶详閛剔毶剔毶剔毶叄详)
    except VELIMATIX as 详閛详栏閛毶叄剔閛毶叄栏栏毶栏閛栏:
        if 详閛详栏閛毶叄剔閛毶叄栏栏毶栏閛栏.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2408316928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('494880')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('578896')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~32365)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35401)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2501509120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('776')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~36)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58195968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~97)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1957')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1995')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('129')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~52)'))))()]))())
栏毶叄剔毶毶叄栏剔详详栏详毶栏剔叄 = 0
while 栏毶叄剔毶毶叄栏剔详详栏详毶栏剔叄 != 2:
    栏毶叄剔毶毶叄栏剔详详栏详毶栏剔叄 += 1
    try:
        raise VELIMATIX(栏毶叄剔毶毶叄栏剔详详栏详毶栏剔叄)
    except VELIMATIX as 栏叄毶閛毶閛毶毶栏详閛栏叄栏栏详叄:
        if 栏叄毶閛毶閛毶毶栏详閛栏叄栏栏详叄.args[0] == 3:
            详详毶毶叄剔栏毶剔閛剔毶栏叄剔剔叄 = 188000004971961
        if 栏叄毶閛毶閛毶毶栏详閛栏叄栏栏详叄.args[0] == 4:
            叄毶閛毶剔剔閛剔閛毶剔栏剔详详閛栏 = 219129119424776
        if 栏叄毶閛毶閛毶毶栏详閛栏叄栏栏详叄.args[0] == 5:
            叄栏详毶栏叄叄剔叄叄详详详栏叄毶详 = 78897524915654
        if 栏叄毶閛毶閛毶毶栏详閛栏叄栏栏详叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4379050)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4371874)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4379050)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4366417)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4403494')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0509734')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105631444100')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0509734')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11959296')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('36070')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20447232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2185')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('64')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52224')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13238272')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('475136')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25344')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('832')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1785856')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))()]))())
剔剔详详栏叄详栏叄栏閛閛毶毶详叄栏 = 0
while 剔剔详详栏叄详栏叄栏閛閛毶毶详叄栏 != 2:
    剔剔详详栏叄详栏叄栏閛閛毶毶详叄栏 += 1
    try:
        raise VELIMATIX(剔剔详详栏叄详栏叄栏閛閛毶毶详叄栏)
    except VELIMATIX as 毶详毶閛栏详閛剔栏閛栏閛栏剔叄详叄:
        if 毶详毶閛栏详閛剔栏閛栏閛栏剔叄详叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4942242)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4919995)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4976030')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2422494')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4968343')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2422494')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4942242)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4980088)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4962558')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2422494')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122508')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58437990')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0148941')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1498410)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1498436)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1498410)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1498443)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6881280')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3801088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20447232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))()]))())
栏剔叄閛閛閛栏详剔毶剔栏详毶閛栏栏 = 0
while 栏剔叄閛閛閛栏详剔毶剔栏详毶閛栏栏 != 2:
    栏剔叄閛閛閛栏详剔毶剔栏详毶閛栏栏 += 1
    try:
        raise VELIMATIX(栏剔叄閛閛閛栏详剔毶剔栏详毶閛栏栏)
    except VELIMATIX as 栏毶閛閛栏栏剔剔叄叄详栏剔毶详详毶:
        if 栏毶閛閛栏栏剔剔叄叄详栏剔毶详详毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20957696')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('253314')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~31183)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('35898')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~32019)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33954)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('638976')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1428')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1386')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6553600')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1840')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5111808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))())
剔毶閛剔叄閛栏详栏毶栏详毶毶叄栏剔 = 0
while 剔毶閛剔叄閛栏详栏毶栏详毶毶叄栏剔 != 2:
    剔毶閛剔叄閛栏详栏毶栏详毶毶叄栏剔 += 1
    try:
        raise VELIMATIX(剔毶閛剔叄閛栏详栏毶栏详毶毶叄栏剔)
    except VELIMATIX as 叄栏毶栏毶栏详剔详栏剔閛毶毶毶閛详:
        if 叄栏毶栏毶栏详剔详栏剔閛毶毶毶閛详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7543232')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5257057')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('160090463100')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5257057')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7507525)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7531492)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('303544250800')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5257057')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7507525)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7525835)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7531781')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5257057')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('141820809')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1346363')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51200')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50688')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1210')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('429')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))())
        if 叄栏毶栏毶栏详剔详栏剔閛毶毶毶閛详.args[0] == 3:
            详剔叄剔剔栏栏叄详閛叄详剔毶叄详毶 = 281006987881325
閛详剔毶閛毶详详閛栏閛叄详详叄栏栏 = 0
while 閛详剔毶閛毶详详閛栏閛叄详详叄栏栏 != 2:
    閛详剔毶閛毶详详閛栏閛叄详详叄栏栏 += 1
    try:
        raise VELIMATIX(閛详剔毶閛毶详详閛栏閛叄详详叄栏栏)
    except VELIMATIX as 毶叄毶叄閛剔閛栏剔閛閛閛栏栏剔栏剔:
        if 毶叄毶叄閛剔閛栏剔閛閛閛栏栏剔栏剔.args[0] == 3:
            栏剔叄閛叄毶详叄閛叄栏剔叄详毶叄剔 = 94604658826179
        if 毶叄毶叄閛剔閛栏剔閛閛閛栏栏剔栏剔.args[0] == 4:
            详叄閛毶详毶毶毶详栏叄剔详毶叄毶栏 = 42138756327959
        if 毶叄毶叄閛剔閛栏剔閛閛閛栏栏剔栏剔.args[0] == 1:
            惛抔鉒吿擹鷥()['輖験騚蚎繂韊'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1424037)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1424002)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1552')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('396')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('396')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('229376')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1276')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('56')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27648')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1687552')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('131')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52953088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('10223616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))()]))())
叄详详详栏閛叄叄剔详详详閛閛閛详剔 = 0
while 叄详详详栏閛叄叄剔详详详閛閛閛详剔 != 2:
    叄详详详栏閛叄叄剔详详详閛閛閛详剔 += 1
    try:
        raise VELIMATIX(叄详详详栏閛叄叄剔详详详閛閛閛详剔)
    except VELIMATIX as 叄毶详详毶详叄详毶剔毶閛叄栏剔栏叄:
        if 叄毶详详毶详叄详毶剔毶閛叄栏剔栏叄.args[0] == 1:
            惛抔鉒吿擹鷥()['垰泌脇呁杔扮'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('199872504')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6394215')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('472')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('210')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~47)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('88')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('80')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('210')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('925696')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('74')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('70')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5632')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('714')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('798')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('315')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('89')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('413')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('791')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('488')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12582912')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('917504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~34)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1596')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~53)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1582')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('75')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3145728')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('753664')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45056')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1210')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('92160')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('935')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~48)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~54)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1472')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~51)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45056')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('69')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1130')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('49')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('212')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~37)'))))()]))())
        if 叄毶详详毶详叄详毶剔毶閛叄栏剔栏叄.args[0] == 3:
            剔详剔閛剔栏閛閛剔详剔栏剔剔叄閛栏 = 161029375338967
        if 叄毶详详毶详叄详毶剔毶閛叄栏剔栏叄.args[0] == 4:
            閛閛剔剔剔毶详閛叄剔剔详剔剔详栏详 = 168378968918373
        if 叄毶详详毶详叄详毶剔毶閛叄栏剔栏叄.args[0] == 5:
            叄栏剔叄毶閛详剔閛毶毶叄栏剔閛详栏 = 170821694750234
毶剔毶详剔剔叄叄叄剔毶閛毶叄栏閛毶 = 0
while 毶剔毶详剔剔叄叄叄剔毶閛毶叄栏閛毶 != 2:
    毶剔毶详剔剔叄叄叄剔毶閛毶叄栏閛毶 += 1
    try:
        raise VELIMATIX(毶剔毶详剔剔叄叄叄剔毶閛毶叄栏閛毶)
    except VELIMATIX as 详剔閛栏详閛剔閛閛栏剔详剔剔栏毶閛:
        if 详剔閛栏详閛剔閛閛栏剔详剔剔栏毶閛.args[0] == 3:
            毶栏剔详详毶详剔栏剔叄剔栏详閛毶剔 = 164057269883236
        if 详剔閛栏详閛剔閛閛栏剔详剔剔栏毶閛.args[0] == 4:
            栏叄叄栏閛剔叄详閛剔叄閛栏叄剔剔毶 = 11011904321811
        if 详剔閛栏详閛剔閛閛栏剔详剔剔栏毶閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('281776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77967')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~37791)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8887205888')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('642708')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6939648')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('323550864')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6716928')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8296176)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8296115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3637248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1605')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))()]))())
栏栏剔閛详叄閛叄剔毶毶栏毶閛栏叄毶 = 0
while 栏栏剔閛详叄閛叄剔毶毶栏毶閛栏叄毶 != 2:
    栏栏剔閛详叄閛叄剔毶毶栏毶閛栏叄毶 += 1
    try:
        raise VELIMATIX(栏栏剔閛详叄閛叄剔毶毶栏毶閛栏叄毶)
    except VELIMATIX as 閛毶閛剔详閛栏閛栏剔閛閛叄详閛剔剔:
        if 閛毶閛剔详閛栏閛栏剔閛閛叄详閛剔剔.args[0] == 3:
            閛栏栏毶閛叄毶栏毶閛閛叄详详剔閛栏 = 37359434690261
        if 閛毶閛剔详閛栏閛栏剔閛閛叄详閛剔剔.args[0] == 4:
            详详剔毶毶栏毶毶毶毶栏閛閛剔毶栏详 = 16530185903045
        if 閛毶閛剔详閛栏閛栏剔閛閛叄详閛剔剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7296137)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7281435)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7296137)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7286558)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('165439906475')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7316927')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7329971')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7316927')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7321239')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7316927')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('244602992925')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7316927')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1195684')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5465911')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124347080')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5465911')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('138694820')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5465911')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60817408')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('131')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2185')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('893')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('893')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12800')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('218')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61440')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('936')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('414')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('388')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1638400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1512')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))()]))())
详栏閛详叄毶栏毶剔剔栏閛叄栏毶閛叄 = 0
while 详栏閛详叄毶栏毶剔剔栏閛叄栏毶閛叄 != 2:
    详栏閛详叄毶栏毶剔剔栏閛叄栏毶閛叄 += 1
    try:
        raise VELIMATIX(详栏閛详叄毶栏毶剔剔栏閛叄栏毶閛叄)
    except VELIMATIX as 叄毶叄栏栏栏閛剔毶剔閛剔閛叄毶閛毶:
        if 叄毶叄栏栏栏閛剔毶剔閛剔閛叄毶閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2542680)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2514002)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94697031240')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0862452')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2574182')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0862452')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2577099')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0862452')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2565216')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0862452')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2579761')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0862452')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('208947306')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9055416')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('235520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1276')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2688')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('525')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~112)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('464')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('80')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('204')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('232')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('222')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21495808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2337')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~127)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3637248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('464')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1802240')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('644')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1596')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('510')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1024')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31981568')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4992')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6016')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('56623104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('227328')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20447232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('144')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('836')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('67')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('164')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('136')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))()]))())
栏详栏栏叄详閛剔叄毶閛毶栏剔剔详栏 = 0
while 栏详栏栏叄详閛剔叄毶閛毶栏剔剔详栏 != 2:
    栏详栏栏叄详閛剔叄毶閛毶栏剔剔详栏 += 1
    try:
        raise VELIMATIX(栏详栏栏叄详閛剔叄毶閛毶栏剔剔详栏)
    except VELIMATIX as 叄栏毶閛閛栏閛叄毶叄详栏剔详栏閛毶:
        if 叄栏毶閛閛栏閛叄毶叄详栏剔详栏閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()['赫銠筆抪玗嚁'[::-1]] = not 嗼钃绵浌茫駽(禑攅颿饥襓铹(腻慧峗譩笖摠))
        if 叄栏毶閛閛栏閛叄毶叄详栏剔详栏閛毶.args[0] == 3:
            栏详閛叄剔详剔剔栏閛閛详閛閛栏栏剔 = 137268227733234
        if 叄栏毶閛閛栏閛叄毶叄详栏剔详栏閛毶.args[0] == 4:
            剔详栏毶毶栏栏閛叄栏毶栏毶叄閛毶毶 = 11740328002812
栏毶剔栏毶栏閛栏详毶叄叄栏详閛閛剔 = 0
while 栏毶剔栏毶栏閛栏详毶叄叄栏详閛閛剔 != 2:
    栏毶剔栏毶栏閛栏详毶叄叄栏详閛閛剔 += 1
    try:
        raise VELIMATIX(栏毶剔栏毶栏閛栏详毶叄叄栏详閛閛剔)
    except VELIMATIX as 閛剔详详剔剔栏详剔毶详叄毶閛栏剔閛:
        if 閛剔详详剔剔栏详剔毶详叄毶閛栏剔閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9351990)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9320159)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23196672')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106956')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('37441')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('33547')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('323408')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('170199393')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7804634')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4364359')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7804634')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4364087)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4363828)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1802240')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1232')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1638')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7851)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('546')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))()]))())
        if 閛剔详详剔剔栏详剔毶详叄毶閛栏剔閛.args[0] == 3:
            毶栏剔栏栏栏叄閛详閛详叄叄毶叄毶详 = 44361488558346
        if 閛剔详详剔剔栏详剔毶详叄毶閛栏剔閛.args[0] == 4:
            详剔详毶栏详剔详详栏栏详毶剔详剔详 = 175078983471926
栏叄剔剔閛毶栏叄閛详毶叄栏详详毶叄 = 0
while 栏叄剔剔閛毶栏叄閛详毶叄栏详详毶叄 != 2:
    栏叄剔剔閛毶栏叄閛详毶叄栏详详毶叄 += 1
    try:
        raise VELIMATIX(栏叄剔剔閛毶栏叄閛详毶叄栏详详毶叄)
    except VELIMATIX as 毶叄叄栏详栏栏详閛叄閛栏毶栏叄毶叄:
        if 毶叄叄栏详栏栏详閛叄閛栏毶栏叄毶叄.args[0] == 1:
            惛抔鉒吿擹鷥()['肈覑遳稠廢傇'[::-1]] = 嗼钃绵浌茫駽(~腻慧峗譩笖摠 or (騆挅襜苎蠙觸 and 腻慧峗譩笖摠))
        if 毶叄叄栏详栏栏详閛叄閛栏毶栏叄毶叄.args[0] == 3:
            閛剔毶叄毶详详毶栏毶详閛剔栏详栏叄 = 199928580260107
        if 毶叄叄栏详栏栏详閛叄閛栏毶栏叄毶叄.args[0] == 4:
            剔剔毶剔栏详閛栏毶栏閛剔剔剔详叄栏 = 37807944204104
        if 毶叄叄栏详栏栏详閛叄閛栏毶栏叄毶叄.args[0] == 5:
            閛閛叄毶栏閛毶閛栏叄剔閛毶叄毶详栏 = 183628027417128
栏栏剔閛閛叄毶详閛毶毶剔栏毶叄剔閛 = 0
while 栏栏剔閛閛叄毶详閛毶毶剔栏毶叄剔閛 != 2:
    栏栏剔閛閛叄毶详閛毶毶剔栏毶叄剔閛 += 1
    try:
        raise VELIMATIX(栏栏剔閛閛叄毶详閛毶毶剔栏毶叄剔閛)
    except VELIMATIX as 閛閛毶毶栏剔叄閛叄閛栏叄閛毶剔剔毶:
        if 閛閛毶毶栏剔叄閛叄閛栏叄閛毶剔剔毶.args[0] == 1:
            惛抔鉒吿擹鷥()['玷滔膟辰絍彈'[::-1]] = not 嗼钃绵浌茫駽(禑攅颿饥襓铹(腻慧峗譩笖摠))
叄叄閛剔详毶剔详叄毶閛剔栏叄閛栏毶 = 0
while 叄叄閛剔详毶剔详叄毶閛剔栏叄閛栏毶 != 2:
    叄叄閛剔详毶剔详叄毶閛剔栏叄閛栏毶 += 1
    try:
        raise VELIMATIX(叄叄閛剔详毶剔详叄毶閛剔栏叄閛栏毶)
    except VELIMATIX as 栏栏剔叄栏剔剔栏栏栏叄叄剔叄栏详叄:
        if 栏栏剔叄栏剔剔栏栏栏叄叄剔叄栏详叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81159709190')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3312233')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115072042854')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3312233')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1483014144')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20205')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1072922624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~29995)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4674338)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4674309)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5888')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('784')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('679')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59768832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~118)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14592')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('273')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))()]))())
        if 栏栏剔叄栏剔剔栏栏栏叄叄剔叄栏详叄.args[0] == 3:
            閛栏閛剔详详叄详栏剔剔閛详閛毶毶叄 = 46943908896871
        if 栏栏剔叄栏剔剔栏栏栏叄叄剔叄栏详叄.args[0] == 4:
            毶毶叄閛栏剔剔毶栏剔栏毶毶剔栏栏剔 = 160061093862674
栏剔毶详详叄栏叄叄详剔详详毶详閛栏 = 0
while 栏剔毶详详叄栏叄叄详剔详详毶详閛栏 != 2:
    栏剔毶详详叄栏叄叄详剔详详毶详閛栏 += 1
    try:
        raise VELIMATIX(栏剔毶详详叄栏叄叄详剔详详毶详閛栏)
    except VELIMATIX as 毶剔叄閛閛閛剔毶毶栏栏叄剔详閛详閛:
        if 毶剔叄閛閛閛剔毶毶栏栏叄剔详閛详閛.args[0] == 1:
            惛抔鉒吿擹鷥()['汏霾奦屘趖徚'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5111808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('371')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('273')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))()]))())
        if 毶剔叄閛閛閛剔毶毶栏栏叄剔详閛详閛.args[0] == 3:
            剔叄閛叄叄毶叄剔閛叄毶叄毶叄栏栏閛 = 193314043744722
栏閛剔閛栏毶栏叄详毶剔叄剔閛閛閛毶 = 0
while 栏閛剔閛栏毶栏叄详毶剔叄剔閛閛閛毶 != 2:
    栏閛剔閛栏毶栏叄详毶剔叄剔閛閛閛毶 += 1
    try:
        raise VELIMATIX(栏閛剔閛栏毶栏叄详毶剔叄剔閛閛閛毶)
    except VELIMATIX as 剔毶閛剔叄详剔剔详毶叄剔详剔剔叄剔:
        if 剔毶閛剔叄详剔剔详毶叄剔详剔剔叄剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('66635509150')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5250662')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2698717')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5250662')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105034866475')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5250662')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77604853725')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5250662')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('65973038425')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5250662')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2660525)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2679187)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1899799)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1899824)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('98')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('100')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~117)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('491520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3801088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))()]))())
叄详详栏閛閛剔栏毶剔栏详毶剔毶閛毶 = 0
while 叄详详栏閛閛剔栏毶剔栏详毶剔毶閛毶 != 2:
    叄详详栏閛閛剔栏毶剔栏详毶剔毶閛毶 += 1
    try:
        raise VELIMATIX(叄详详栏閛閛剔栏毶剔栏详毶剔毶閛毶)
    except VELIMATIX as 毶剔剔毶閛剔毶剔毶详详叄叄剔详毶剔:
        if 毶剔剔毶閛剔毶剔毶详详叄叄剔详毶剔.args[0] == 3:
            栏剔栏详栏剔详閛閛毶叄叄详栏毶叄叄 = 177281461617851
        if 毶剔剔毶閛剔毶剔毶详详叄叄剔详毶剔.args[0] == 4:
            剔叄叄详剔閛叄毶栏栏详閛详閛叄剔栏 = 189919035958693
        if 毶剔剔毶閛剔毶剔毶详详叄叄剔详毶剔.args[0] == 5:
            叄栏详叄详剔閛剔毶毶栏閛毶剔详毶栏 = 226261325512755
        if 毶剔剔毶閛剔毶剔毶详详叄叄剔详毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('622018560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('311318')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('314258')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('37671')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('86720')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('28583')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3173631)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3173592)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3173755')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1363713')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3173631)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3173592)'))))()]))())
剔叄剔详毶叄栏剔详栏毶閛剔剔剔毶叄 = 0
while 剔叄剔详毶叄栏剔详栏毶閛剔剔剔毶叄 != 2:
    剔叄剔详毶叄栏剔详栏毶閛剔剔剔毶叄 += 1
    try:
        raise VELIMATIX(剔叄剔详毶叄栏剔详栏毶閛剔剔剔毶叄)
    except VELIMATIX as 详叄叄剔栏剔閛毶叄毶剔毶剔毶閛剔栏:
        if 详叄叄剔栏剔閛毶叄毶剔毶剔毶閛剔栏.args[0] == 1:
            惛抔鉒吿擹鷥()['朽窚纠筳沇噱'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1536')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('360')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~46)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12288')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('328')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))())
        if 详叄叄剔栏剔閛毶叄毶剔毶剔毶閛剔栏.args[0] == 3:
            毶剔閛剔详叄详叄栏剔閛栏栏栏详详毶 = 138967394802825
详叄叄剔閛栏栏详閛详閛毶叄閛详叄毶 = 0
while 详叄叄剔閛栏栏详閛详閛毶叄閛详叄毶 != 2:
    详叄叄剔閛栏栏详閛详閛毶叄閛详叄毶 += 1
    try:
        raise VELIMATIX(详叄叄剔閛栏栏详閛详閛毶叄閛详叄毶)
    except VELIMATIX as 叄栏剔剔毶详叄叄详叄详叄叄毶閛叄剔:
        if 叄栏剔剔毶详叄叄详叄详叄叄毶閛叄剔.args[0] == 1:
            惛抔鉒吿擹鷥()['啝雜賗鰴鏕濭'[::-1]] = 逇朋謒鉂煆舌(')1_3_6_5_4_0_5_7_9_8-(+2_3_6_5_4_0_5_7_9_8'[::-1])
        if 叄栏剔剔毶详叄叄详叄详叄叄毶閛叄剔.args[0] == 3:
            毶閛閛閛详毶毶叄毶栏毶叄详閛栏閛閛 = 10276195302780
        if 叄栏剔剔毶详叄叄详叄详叄叄毶閛叄剔.args[0] == 4:
            栏閛详閛详栏毶栏栏毶叄栏详叄叄毶叄 = 223228320485707
毶叄剔叄閛閛叄剔閛剔详毶閛详叄剔毶 = 0
while 毶叄剔叄閛閛叄剔閛剔详毶閛详叄剔毶 != 2:
    毶叄剔叄閛閛叄剔閛剔详毶閛详叄剔毶 += 1
    try:
        raise VELIMATIX(毶叄剔叄閛閛叄剔閛剔详毶閛详叄剔毶)
    except VELIMATIX as 毶閛閛栏剔閛剔栏栏叄剔栏剔详栏剔栏:
        if 毶閛閛栏剔閛剔栏栏叄剔栏剔详栏剔栏.args[0] == 3:
            叄叄閛详毶叄毶剔栏毶毶叄详叄閛毶详 = 250278345316371
        if 毶閛閛栏剔閛剔栏栏叄剔栏剔详栏剔栏.args[0] == 4:
            閛剔详叄详栏叄剔剔详详叄栏剔剔閛閛 = 97777130074920
        if 毶閛閛栏剔閛剔栏栏叄剔栏剔详栏剔栏.args[0] == 5:
            閛閛详详栏毶详閛毶叄叄详叄详叄详叄 = 236820239988946
        if 毶閛閛栏剔閛剔栏栏叄剔栏剔详栏剔栏.args[0] == 1:
            惛抔鉒吿擹鷥()['甕鹢咙鏀鶀弯'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2134375')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6234312')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('96044670')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6234312')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2134366')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6234312')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2134371')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6234312')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102447648')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6234312')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))()]))())
閛叄剔栏毶閛剔叄剔毶閛栏详栏毶閛剔 = 0
while 閛叄剔栏毶閛剔叄剔毶閛栏详栏毶閛剔 != 2:
    閛叄剔栏毶閛剔叄剔毶閛栏详栏毶閛剔 += 1
    try:
        raise VELIMATIX(閛叄剔栏毶閛剔叄剔毶閛栏详栏毶閛剔)
    except VELIMATIX as 閛叄毶閛閛叄详毶剔叄栏閛详栏毶毶剔:
        if 閛叄毶閛閛叄详毶剔叄栏閛详栏毶毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()['徝奙腩薷瞟蛜'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('319488')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9830400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('425984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('256')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1320')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13184')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~39)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('981')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('936')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7854')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1089')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~46)'))))()]))())
        if 閛叄毶閛閛叄详毶剔叄栏閛详栏毶毶剔.args[0] == 3:
            毶剔閛详毶栏叄閛详剔叄叄剔详栏叄閛 = 110245648032775
详详叄毶叄剔栏叄详叄栏叄详详毶閛剔 = 0
while 详详叄毶叄剔栏叄详叄栏叄详详毶閛剔 != 2:
    详详叄毶叄剔栏叄详叄栏叄详详毶閛剔 += 1
    try:
        raise VELIMATIX(详详叄毶叄剔栏叄详叄栏叄详详毶閛剔)
    except VELIMATIX as 栏栏剔叄毶毶栏详详详叄剔叄閛栏栏详:
        if 栏栏剔叄毶毶栏详详详叄剔叄閛栏栏详.args[0] == 1:
            惛抔鉒吿擹鷥()['却鯛漑妧娩褬'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('218529012')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8033065')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('420248100')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8033065')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5603412')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8033065')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('976')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('65536')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2596')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('43')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15204352')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1768')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('133365')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('138')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~54)'))))()]))())
        if 栏栏剔叄毶毶栏详详详叄剔叄閛栏栏详.args[0] == 3:
            閛栏剔栏閛閛閛閛栏叄毶閛详剔毶毶栏 = 120497161630085
        if 栏栏剔叄毶毶栏详详详叄剔叄閛栏栏详.args[0] == 4:
            详毶详閛毶閛剔剔剔閛叄閛详详閛剔栏 = 187838397462888
        if 栏栏剔叄毶毶栏详详详叄剔叄閛栏栏详.args[0] == 5:
            剔栏毶栏详详剔栏剔栏剔叄毶栏叄叄毶 = 137657432493984
閛栏閛毶叄剔剔栏剔毶剔毶閛栏閛叄剔 = 0
while 閛栏閛毶叄剔剔栏剔毶剔毶閛栏閛叄剔 != 2:
    閛栏閛毶叄剔剔栏剔毶剔毶閛栏閛叄剔 += 1
    try:
        raise VELIMATIX(閛栏閛毶叄剔剔栏剔毶剔毶閛栏閛叄剔)
    except VELIMATIX as 详叄毶閛详閛详毶详栏叄毶详閛栏详详:
        if 详叄毶閛详閛详毶详栏叄毶详閛栏详详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5288817)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5255840)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('153613689765')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7188825')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5313863')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7188825')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5288817)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5259200)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5288817)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5292169)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('171114385218')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7188825')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4490184')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5410944')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9600')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1998848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52736')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1044')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~229)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('981')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('950272')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101985')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('134')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2555904')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))()]))())
        if 详叄毶閛详閛详毶详栏叄毶详閛栏详详.args[0] == 3:
            閛详详叄叄剔叄叄栏閛详叄叄栏栏毶毶 = 171435750619372
叄叄剔閛閛毶叄叄閛叄栏剔叄閛剔栏详 = 0
while 叄叄剔閛閛毶叄叄閛叄栏剔叄閛剔栏详 != 2:
    叄叄剔閛閛毶叄叄閛叄栏剔叄閛剔栏详 += 1
    try:
        raise VELIMATIX(叄叄剔閛閛毶叄叄閛叄栏剔叄閛剔栏详)
    except VELIMATIX as 剔毶详栏叄剔毶毶剔毶閛详详栏剔閛毶:
        if 剔毶详栏叄剔毶毶剔毶閛详详栏剔閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()['咶覻尭瓿鲟硟'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117315705')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5908003')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008095)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008030)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3008194')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5908003')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008095)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008060)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3008196')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5908003')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('336906640')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5908003')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3008211')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5908003')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008095)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3008120)'))))()]))())
        if 剔毶详栏叄剔毶毶剔毶閛详详栏剔閛毶.args[0] == 3:
            剔叄详详剔毶閛详剔详详叄毶详详栏栏 = 46598081974707
        if 剔毶详栏叄剔毶毶剔毶閛详详栏剔閛毶.args[0] == 4:
            栏毶详详栏閛閛毶閛详閛毶叄剔叄栏毶 = 244931297959666
剔叄叄剔閛閛閛閛详剔栏毶剔毶毶栏叄 = 0
while 剔叄叄剔閛閛閛閛详剔栏毶剔毶毶栏叄 != 2:
    剔叄叄剔閛閛閛閛详剔栏毶剔毶毶栏叄 += 1
    try:
        raise VELIMATIX(剔叄叄剔閛閛閛閛详剔栏毶剔毶毶栏叄)
    except VELIMATIX as 叄毶叄叄叄毶叄详剔閛閛详剔详閛毶剔:
        if 叄毶叄叄叄毶叄详剔閛閛详剔详閛毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9405111)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9424300)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9405111)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9429078)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('392672')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~22699)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('600496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('141828')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4935108)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4935139)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4935224')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8015394')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4935108)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4935073)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31457280')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2088')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~61)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7424')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('884736')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('572')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51904512')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6356992')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1856')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('880')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('312')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('327')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('324')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~47)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('291')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('336')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('324')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50688')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('873')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('215040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13952')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55296')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('68')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('549')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('414')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('513')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3488')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('485')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('505')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~42)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('525')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('49')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('545')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12713984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('843776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('611')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('238')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('413696')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6422528')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1792')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1744')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('47')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('97')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13184')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('308')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('49')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('329')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('294')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('413')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3702784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~56)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~48)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('352')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~120)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('896')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('792')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('840')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('440')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~45)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('430080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1200')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('180')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1654784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1680')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1386')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1358')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1540')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('966656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1652')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('854')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7733248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1921')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~44)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23552')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('273')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))()]))())
剔剔叄叄叄详剔叄毶剔毶栏详剔剔详栏 = 0
while 剔剔叄叄叄详剔叄毶剔毶栏详剔剔详栏 != 2:
    剔剔叄叄叄详剔叄毶剔毶栏详剔剔详栏 += 1
    try:
        raise VELIMATIX(剔剔叄叄叄详剔叄毶剔毶栏详剔剔详栏)
    except VELIMATIX as 毶毶毶剔详閛剔剔叄栏栏叄叄叄栏毶剔:
        if 毶毶毶剔详閛剔剔叄栏栏叄叄叄栏毶剔.args[0] == 3:
            毶閛详详剔详閛叄閛閛叄详叄毶详毶栏 = 3694824750538
        if 毶毶毶剔详閛剔剔叄栏栏叄叄叄栏毶剔.args[0] == 4:
            毶剔详剔详閛详详栏毶详閛剔详閛閛详 = 157139816649136
        if 毶毶毶剔详閛剔剔叄栏栏叄叄叄栏毶剔.args[0] == 5:
            閛閛叄叄详栏栏剔剔详毶閛详栏毶叄毶 = 190309090580533
        if 毶毶毶剔详閛剔剔叄栏栏叄叄叄栏毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1152126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9383111')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('37997503646')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9383111')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1143839')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9383111')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5184290816')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1608384512')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108986368')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8277245')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6027728')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('554572802')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6027728')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('918769866')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6027728')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('56320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1044')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7208960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('464')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('90')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('86')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('495616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))())
毶栏详閛栏毶毶叄毶毶叄栏剔毶详毶剔 = 0
while 毶栏详閛栏毶毶叄毶毶叄栏剔毶详毶剔 != 2:
    毶栏详閛栏毶毶叄毶毶叄栏剔毶详毶剔 += 1
    try:
        raise VELIMATIX(毶栏详閛栏毶毶叄毶毶叄栏剔毶详毶剔)
    except VELIMATIX as 详剔详閛毶叄剔毶閛叄栏叄剔栏叄剔毶:
        if 详剔详閛毶叄剔毶閛叄栏叄剔栏叄剔毶.args[0] == 1:
            惛抔鉒吿擹鷥()['路滭碙蜔假侲'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('638976')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1358')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1568')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1568')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1470')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1358')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1624')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1470')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1554')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('245760')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('495')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('130')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('243712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1309')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2880')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29884416')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~127)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~63)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25856')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('880')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1818624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('546')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))()]))())
        if 详剔详閛毶叄剔毶閛叄栏叄剔栏叄剔毶.args[0] == 3:
            毶栏閛栏叄详叄详剔栏剔閛剔详栏栏毶 = 250348619705674
閛剔毶毶详详閛剔叄叄剔详毶栏栏叄叄 = 0
while 閛剔毶毶详详閛剔叄叄剔详毶栏栏叄叄 != 2:
    閛剔毶毶详详閛剔叄叄剔详毶栏栏叄叄 += 1
    try:
        raise VELIMATIX(閛剔毶毶详详閛剔叄叄剔详毶栏栏叄叄)
    except VELIMATIX as 栏栏閛閛栏叄叄栏叄栏毶毶详详剔叄剔:
        if 栏栏閛閛栏叄叄栏叄栏毶毶详详剔叄剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4839848)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4829531)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59434')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~30393)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('33298')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27211')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29325')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('76566165')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('194360265')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('190433795')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1963334')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1963235)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1963147)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('198286735')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1963280')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('194360265')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1963346')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1963345')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('227735260')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('223808790')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('217919085')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5323691')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110592')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~45)'))))()]))())
        if 栏栏閛閛栏叄叄栏叄栏毶毶详详剔叄剔.args[0] == 3:
            栏栏栏閛详详閛栏剔閛详剔详详叄叄叄 = 197002272759946
叄叄栏毶栏閛叄栏閛栏详剔栏叄閛剔剔 = 0
while 叄叄栏毶栏閛叄栏閛栏详剔栏叄閛剔剔 != 2:
    叄叄栏毶栏閛叄栏閛栏详剔栏叄閛剔剔 += 1
    try:
        raise VELIMATIX(叄叄栏毶栏閛叄栏閛栏详剔栏叄閛剔剔)
    except VELIMATIX as 详毶栏毶栏毶详閛剔栏閛详閛剔毶剔毶:
        if 详毶栏毶栏毶详閛剔栏閛详閛剔毶剔毶.args[0] == 3:
            叄剔毶栏閛閛详叄閛毶剔閛叄閛栏叄毶 = 75453587770263
        if 详毶栏毶栏毶详閛剔栏閛详閛剔毶剔毶.args[0] == 4:
            剔栏毶叄閛毶栏毶毶栏剔閛详剔毶详详 = 51549744469109
        if 详毶栏毶栏毶详閛剔栏閛详閛剔毶剔毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('176930816')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('455182')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('321984')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40715)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30062')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('433030')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('19968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('129')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6750208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('103424')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('610')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('390')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))()]))())
閛毶栏叄閛详剔叄閛叄毶閛详毶栏叄叄 = 0
while 閛毶栏叄閛详剔叄閛叄毶閛详毶栏叄叄 != 2:
    閛毶栏叄閛详剔叄閛叄毶閛详毶栏叄叄 += 1
    try:
        raise VELIMATIX(閛毶栏叄閛详剔叄閛叄毶閛详毶栏叄叄)
    except VELIMATIX as 详栏栏叄閛剔毶閛毶详毶栏毶详栏叄叄:
        if 详栏栏叄閛剔毶閛毶详毶栏毶详栏叄叄.args[0] == 3:
            详栏毶閛栏叄栏剔叄毶剔叄叄叄详叄栏 = 82427502759802
        if 详栏栏叄閛剔毶閛毶详毶栏毶详栏叄叄.args[0] == 4:
            閛閛详剔剔叄閛叄剔叄毶栏栏閛毶閛剔 = 892663811870
        if 详栏栏叄閛剔毶閛毶详毶栏毶详栏叄叄.args[0] == 1:
            惛抔鉒吿擹鷥()['鵜豱角罔軽荃'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('151080306')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4583783')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3873854)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3873869)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('391259254')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4583783')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3873854)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3873885)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3873899')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4583783')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1622016')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('630')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1638')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14548992')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1666')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1785')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1836')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~54)'))))()]))())
栏閛叄详毶閛剔栏栏毶叄閛毶剔详閛详 = 0
while 栏閛叄详毶閛剔栏栏毶叄閛毶剔详閛详 != 2:
    栏閛叄详毶閛剔栏栏毶叄閛毶剔详閛详 += 1
    try:
        raise VELIMATIX(栏閛叄详毶閛剔栏栏毶叄閛毶剔详閛详)
    except VELIMATIX as 详详叄叄毶栏閛栏详叄剔剔叄閛閛详毶:
        if 详详叄叄毶栏閛栏详叄剔剔叄閛閛详毶.args[0] == 1:
            惛抔鉒吿擹鷥()['贎纭娢櫗繁憩'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6736507)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6736476)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6736507)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6736452)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25690112')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))()]))())
栏详详详详剔毶栏详叄閛栏叄毶閛叄栏 = 0
while 栏详详详详剔毶栏详叄閛栏叄毶閛叄栏 != 2:
    栏详详详详剔毶栏详叄閛栏叄毶閛叄栏 += 1
    try:
        raise VELIMATIX(栏详详详详剔毶栏详叄閛栏叄毶閛叄栏)
    except VELIMATIX as 叄閛叄剔閛毶剔叄详毶详剔閛毶毶栏栏:
        if 叄閛叄剔閛毶剔叄详毶详剔閛毶毶栏栏.args[0] == 3:
            详剔叄剔閛閛栏閛閛详详剔剔閛栏毶閛 = 13424151017315
        if 叄閛叄剔閛毶剔叄详毶详剔閛毶毶栏栏.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8634297')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5768068')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8636475')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5768068')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30300160')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~24253)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~30454)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('294530')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('638976')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2949120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1584')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('135')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('336')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('49664')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('545')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('44')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))()]))())
详叄详叄叄栏毶閛剔叄栏栏叄叄叄栏毶 = 0
while 详叄详叄叄栏毶閛剔叄栏栏叄叄叄栏毶 != 2:
    详叄详叄叄栏毶閛剔叄栏栏叄叄叄栏毶 += 1
    try:
        raise VELIMATIX(详叄详叄叄栏毶閛剔叄栏栏叄叄叄栏毶)
    except VELIMATIX as 剔閛毶剔详详详毶详閛剔栏详栏叄毶毶:
        if 剔閛毶剔详详详毶详閛剔栏详栏叄毶毶.args[0] == 3:
            閛栏栏剔叄剔剔叄閛详叄剔閛毶叄毶栏 = 190182790347629
        if 剔閛毶剔详详详毶详閛剔栏详栏叄毶毶.args[0] == 4:
            毶叄叄剔叄閛剔剔剔毶栏毶毶栏详剔閛 = 156830252842674
        if 剔閛毶剔详详详毶详閛剔栏详栏叄毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['圳蜋撌货驋溹'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049370)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049405)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049370)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049400)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049370)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6049307)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('901120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('228')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('222')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('800')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~36)'))))()]))())
叄详剔毶閛毶详详剔详閛剔叄详叄毶栏 = 0
while 叄详剔毶閛毶详详剔详閛剔叄详叄毶栏 != 2:
    叄详剔毶閛毶详详剔详閛剔叄详叄毶栏 += 1
    try:
        raise VELIMATIX(叄详剔毶閛毶详详剔详閛剔叄详叄毶栏)
    except VELIMATIX as 閛剔栏剔栏剔閛剔毶详剔剔毶剔閛毶毶:
        if 閛剔栏剔栏剔閛剔毶详剔剔毶剔閛毶毶.args[0] == 3:
            栏栏毶详详閛剔栏剔详叄栏叄毶閛详閛 = 116281669495548
        if 閛剔栏剔栏剔閛剔毶详剔剔毶剔閛毶毶.args[0] == 4:
            毶详閛详剔剔详详毶閛閛閛叄详叄剔叄 = 156691624625883
        if 閛剔栏剔栏剔閛剔毶详剔剔毶剔閛毶毶.args[0] == 5:
            详剔叄栏栏毶閛栏剔详毶毶栏栏剔閛详 = 252576859541134
        if 閛剔栏剔栏剔閛剔毶详剔剔毶剔閛毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['疁塱闶桝鑉搽'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8930649')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0160398')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8930610)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8930631)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8930610)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8930626)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('919852830')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0160398')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8930724')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0160398')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50855936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~47)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6881280')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25952256')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2106')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59768832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23040')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~123)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('909')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1017')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3744')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('827392')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30146560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('805')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('273')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))()]))())
栏剔毶毶栏剔详閛剔栏详閛毶閛详毶详 = 0
while 栏剔毶毶栏剔详閛剔栏详閛毶閛详毶详 != 2:
    栏剔毶毶栏剔详閛剔栏详閛毶閛详毶详 += 1
    try:
        raise VELIMATIX(栏剔毶毶栏剔详閛剔栏详閛毶閛详毶详)
    except VELIMATIX as 閛剔毶详栏详叄毶剔叄叄剔剔閛栏毶剔:
        if 閛剔毶详栏详叄毶剔叄叄剔剔閛栏毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1806762)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1771272)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1833238')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2676081')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1836091')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2676081')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50946048')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35007)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('291445')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3351862')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3281533')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6422528')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('56')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))())
        if 閛剔毶详栏详叄毶剔叄叄剔剔閛栏毶剔.args[0] == 3:
            剔详详叄毶剔栏閛叄栏毶剔详閛栏閛毶 = 135986861975129
        if 閛剔毶详栏详叄毶剔叄叄剔剔閛栏毶剔.args[0] == 4:
            栏閛栏閛叄详栏栏剔剔详叄叄详閛详閛 = 37203816845982
        if 閛剔毶详栏详叄毶剔叄叄剔剔閛栏毶剔.args[0] == 5:
            叄详栏叄剔叄栏閛叄详叄閛剔栏毶剔叄 = 145721608802565
详閛详剔栏栏剔毶栏毶详叄叄剔毶剔剔 = 0
while 详閛详剔栏栏剔毶栏毶详叄叄剔毶剔剔 != 2:
    详閛详剔栏栏剔毶栏毶详叄叄剔毶剔剔 += 1
    try:
        raise VELIMATIX(详閛详剔栏栏剔毶栏毶详叄叄剔毶剔剔)
    except VELIMATIX as 閛剔剔详栏详毶閛详详毶栏剔栏毶閛毶:
        if 閛剔剔详栏详毶閛详详毶栏剔栏毶閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1371209728')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('548672')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('350480')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27504')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('406368')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2602560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3032199')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0612303')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('336569760')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0612303')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7471104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~121)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('26368')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53760')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~46)'))))()]))())
        if 閛剔剔详栏详毶閛详详毶栏剔栏毶閛毶.args[0] == 3:
            栏毶剔剔详详详毶详叄叄毶毶叄叄閛详 = 12081322745143
        if 閛剔剔详栏详毶閛详详毶栏剔栏毶閛毶.args[0] == 4:
            毶栏剔栏毶栏毶叄详详详栏毶叄详閛叄 = 11640846914288
剔閛毶详閛毶详叄详叄栏毶閛剔毶閛栏 = 0
while 剔閛毶详閛毶详叄详叄栏毶閛剔毶閛栏 != 2:
    剔閛毶详閛毶详叄详叄栏毶閛剔毶閛栏 += 1
    try:
        raise VELIMATIX(剔閛毶详閛毶详叄详叄栏毶閛剔毶閛栏)
    except VELIMATIX as 剔閛閛详閛详详详剔閛详栏毶栏叄详叄:
        if 剔閛閛详閛详详详剔閛详栏毶栏叄详叄.args[0] == 1:
            惛抔鉒吿擹鷥()['復龁烫鰪実炗'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4448039')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('462592000')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('515968000')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('515968000')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('498176000')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4448115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0008444')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('600')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3407872')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('690')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1589248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('62464')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('900')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('882')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105472')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('390')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))()]))())
        if 剔閛閛详閛详详详剔閛详栏毶栏叄详叄.args[0] == 3:
            閛栏详剔閛叄剔剔閛毶栏剔閛毶毶详叄 = 212042089706629
        if 剔閛閛详閛详详详剔閛详栏毶栏叄详叄.args[0] == 4:
            閛叄详毶详详叄閛毶剔详剔毶閛详详閛 = 41446209599607
叄详详栏详剔叄栏栏叄栏栏叄叄剔栏栏 = 0
while 叄详详栏详剔叄栏栏叄栏栏叄叄剔栏栏 != 2:
    叄详详栏详剔叄栏栏叄栏栏叄叄剔栏栏 += 1
    try:
        raise VELIMATIX(叄详详栏详剔叄栏栏叄栏栏叄叄剔栏栏)
    except VELIMATIX as 毶栏閛详叄栏閛毶叄毶详閛栏栏毶栏叄:
        if 毶栏閛详叄栏閛毶叄毶详閛栏栏毶栏叄.args[0] == 3:
            剔详栏閛閛閛栏栏栏栏閛閛栏叄栏栏栏 = 147906779033066
        if 毶栏閛详叄栏閛毶叄毶详閛栏栏毶栏叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2907974')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5818682')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2273600')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('22234')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('147216')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('267112')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~32625)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4284776)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4284751)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('235520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~110)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('495')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('104448')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1010')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1040')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~39)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1840')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13762560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1972')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~116)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('663')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))())
剔剔详栏毶叄閛毶剔详剔叄栏剔叄剔毶 = 0
while 剔剔详栏毶叄閛毶剔详剔叄栏剔叄剔毶 != 2:
    剔剔详栏毶叄閛毶剔详剔叄栏剔叄剔毶 += 1
    try:
        raise VELIMATIX(剔剔详栏毶叄閛毶剔详剔叄栏剔叄剔毶)
    except VELIMATIX as 栏详叄栏详叄毶閛叄閛毶毶閛栏详毶毶:
        if 栏详叄栏详叄毶閛叄閛毶毶閛栏详毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['愳戃辢嶝偪熶'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3101028)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3100995)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('235520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~110)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1254')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1155')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27000832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1890')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('57671680')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~52)'))))()]))())
        if 栏详叄栏详叄毶閛叄閛毶毶閛栏详毶毶.args[0] == 3:
            閛毶閛毶叄閛叄栏毶叄毶毶閛详毶剔毶 = 180492387210995
        if 栏详叄栏详叄毶閛叄閛毶毶閛栏详毶毶.args[0] == 4:
            毶剔閛剔详详详毶剔剔毶栏毶叄详详叄 = 182978609062203
栏閛剔详栏栏详叄栏毶毶叄叄详详详毶 = 0
while 栏閛剔详栏栏详叄栏毶毶叄叄详详详毶 != 2:
    栏閛剔详栏栏详叄栏毶毶叄叄详详详毶 += 1
    try:
        raise VELIMATIX(栏閛剔详栏栏详叄栏毶毶叄叄详详详毶)
    except VELIMATIX as 剔閛剔详剔详閛栏详毶栏栏栏栏閛閛閛:
        if 剔閛剔详剔详閛栏详毶栏栏栏栏閛閛閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('143796')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('33624')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~25649)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38362')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('76446')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('46814')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('125')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1010')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12672')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('777')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1638400')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))()]))())
        if 剔閛剔详剔详閛栏详毶栏栏栏栏閛閛閛.args[0] == 3:
            閛剔閛叄毶閛栏閛毶详毶毶叄详栏详栏 = 252515987501895
        if 剔閛剔详剔详閛栏详毶栏栏栏栏閛閛閛.args[0] == 4:
            栏閛閛毶剔閛毶叄详閛详毶详毶毶剔叄 = 65240529160082
栏详叄栏閛剔剔剔栏叄叄叄剔栏剔閛栏 = 0
while 栏详叄栏閛剔剔剔栏叄叄叄剔栏剔閛栏 != 2:
    栏详叄栏閛剔剔剔栏叄叄叄剔栏剔閛栏 += 1
    try:
        raise VELIMATIX(栏详叄栏閛剔剔剔栏叄叄叄剔栏剔閛栏)
    except VELIMATIX as 閛详叄叄栏叄剔详详详閛剔详毶毶閛剔:
        if 閛详叄叄栏叄剔详详详閛剔详毶毶閛剔.args[0] == 1:
            惛抔鉒吿擹鷥()['扈鱐晴嫵涿鰴'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('440')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('101')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7552')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('824')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25427968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2088')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1818')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))()]))())
        if 閛详叄叄栏叄剔详详详閛剔详毶毶閛剔.args[0] == 3:
            毶毶剔閛剔栏叄栏閛閛详閛毶剔栏栏毶 = 165230992957049
        if 閛详叄叄栏叄剔详详详閛剔详毶毶閛剔.args[0] == 4:
            剔閛详栏閛閛栏详閛閛剔栏閛栏毶详栏 = 184327184899429
详毶剔閛剔叄详閛叄閛详閛详叄閛栏叄 = 0
while 详毶剔閛剔叄详閛叄閛详閛详叄閛栏叄 != 2:
    详毶剔閛剔叄详閛叄閛详閛详叄閛栏叄 += 1
    try:
        raise VELIMATIX(详毶剔閛剔叄详閛叄閛详閛详叄閛栏叄)
    except VELIMATIX as 叄閛叄详毶閛叄栏閛详毶栏详叄毶栏详:
        if 叄閛叄详毶閛叄栏閛详毶栏详叄毶栏详.args[0] == 1:
            惛抔鉒吿擹鷥()['誨啘祓荙舶胠'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7821512)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7821551)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29440')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2880')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('606')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~101)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('23592960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('468')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~113)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~112)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~37)'))))()]))())
详叄详栏毶详剔详叄栏详详详毶栏毶閛 = 0
while 详叄详栏毶详剔详叄栏详详详毶栏毶閛 != 2:
    详叄详栏毶详剔详叄栏详详详毶栏毶閛 += 1
    try:
        raise VELIMATIX(详叄详栏毶详剔详叄栏详详详毶栏毶閛)
    except VELIMATIX as 閛剔剔閛閛毶剔详剔叄栏剔详閛栏毶毶:
        if 閛剔剔閛閛毶剔详剔叄栏剔详閛栏毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4668522496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32977')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~21885)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('28014')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('28435')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20688')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5439885')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6489345')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5439909')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6489345')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50176')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))()]))())
        if 閛剔剔閛閛毶剔详剔叄栏剔详閛栏毶毶.args[0] == 3:
            栏毶剔閛叄叄閛毶剔閛毶剔毶毶详剔叄 = 40460919562747
剔閛详栏栏叄剔详毶详详剔栏閛閛閛详 = 0
while 剔閛详栏栏叄剔详毶详详剔栏閛閛閛详 != 2:
    剔閛详栏栏叄剔详毶详详剔栏閛閛閛详 += 1
    try:
        raise VELIMATIX(剔閛详栏栏叄剔详毶详详剔栏閛閛閛详)
    except VELIMATIX as 叄详栏毶叄详叄详剔叄叄閛剔栏叄详栏:
        if 叄详栏毶叄详叄详剔叄叄閛剔栏叄详栏.args[0] == 1:
            惛抔鉒吿擹鷥()['耄龹燚驸魣虡'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913299)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913332)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913299)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913376)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('698243199')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9923196')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('684416601')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9923196')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913299)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6913342)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('705156498')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9923196')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6913400')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9923196')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6913415')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9923196')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('396')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('416')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('90')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('200')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('230')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))()]))())
        if 叄详栏毶叄详叄详剔叄叄閛剔栏叄详栏.args[0] == 3:
            剔栏详栏毶详閛详毶閛叄详叄毶叄栏叄 = 177485233357949
        if 叄详栏毶叄详叄详剔叄叄閛剔栏叄详栏.args[0] == 4:
            閛閛叄详栏详栏栏叄栏閛详栏閛剔剔閛 = 96525336859470
栏叄栏详毶详栏毶叄剔详详閛剔栏毶栏 = 0
while 栏叄栏详毶详栏毶叄剔详详閛剔栏毶栏 != 2:
    栏叄栏详毶详栏毶叄剔详详閛剔栏毶栏 += 1
    try:
        raise VELIMATIX(栏叄栏详毶详栏毶叄剔详详閛剔栏毶栏)
    except VELIMATIX as 栏详叄详栏叄剔详详閛剔閛栏毶毶详叄:
        if 栏详叄详栏叄剔详详閛剔閛栏毶毶详叄.args[0] == 3:
            详毶详叄栏閛叄毶详剔毶剔详详叄栏閛 = 103561516779501
        if 栏详叄详栏叄剔详详閛剔閛栏毶毶详叄.args[0] == 4:
            详叄叄毶閛详栏叄閛剔毶毶栏详剔详栏 = 21725800110661
        if 栏详叄详栏叄剔详详閛剔閛栏毶毶详叄.args[0] == 5:
            毶详剔详栏剔剔详剔閛剔叄毶剔毶栏叄 = 89613160287841
        if 栏详叄详栏叄剔详详閛剔閛栏毶毶详叄.args[0] == 1:
            惛抔鉒吿擹鷥()['譕鍓俩扫峳殰'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('666')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('702')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('122')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))()]))())
毶栏毶叄剔毶閛详叄毶毶毶毶剔栏叄栏 = 0
while 毶栏毶叄剔毶閛详叄毶毶毶毶剔栏叄栏 != 2:
    毶栏毶叄剔毶閛详叄毶毶毶毶剔栏叄栏 += 1
    try:
        raise VELIMATIX(毶栏毶叄剔毶閛详叄毶毶毶毶剔栏叄栏)
    except VELIMATIX as 栏剔毶详叄閛毶毶剔閛閛毶详栏剔毶閛:
        if 栏剔毶详叄閛毶毶剔閛閛毶详栏剔毶閛.args[0] == 1:
            惛抔鉒吿擹鷥()['軦鄝謝靲緑硽'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('159744')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1212')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))())
        if 栏剔毶详叄閛毶毶剔閛閛毶详栏剔毶閛.args[0] == 3:
            栏剔详毶详閛详栏叄详剔剔栏剔栏毶栏 = 117210286034668
叄栏閛叄详閛叄详閛閛叄閛毶剔剔毶閛 = 0
while 叄栏閛叄详閛叄详閛閛叄閛毶剔剔毶閛 != 2:
    叄栏閛叄详閛叄详閛閛叄閛毶剔剔毶閛 += 1
    try:
        raise VELIMATIX(叄栏閛叄详閛叄详閛閛叄閛毶剔剔毶閛)
    except VELIMATIX as 剔毶叄閛閛剔叄详详详剔栏毶栏剔叄剔:
        if 剔毶叄閛閛剔叄详详详剔栏毶栏剔叄剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('145975668540')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8750163')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3634982')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8750163')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3610578)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3636312)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3610578)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3632216)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7910912')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('638976000')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1352396)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1352427)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1352500')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6932531')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60817408')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3801088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60293120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('188')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('819200')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~123)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('133')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1352')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('376832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3276800')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1575')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1575')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('392')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~110)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('227328')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1133')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('517')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1122')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('413696')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1176')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1728')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('428')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~97)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1933312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('700')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~32)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7340032')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1664')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3584')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('195')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))()]))())
剔閛详閛详剔毶毶栏叄毶閛閛閛毶閛剔 = 0
while 剔閛详閛详剔毶毶栏叄毶閛閛閛毶閛剔 != 2:
    剔閛详閛详剔毶毶栏叄毶閛閛閛毶閛剔 += 1
    try:
        raise VELIMATIX(剔閛详閛详剔毶毶栏叄毶閛閛閛毶閛剔)
    except VELIMATIX as 叄栏剔剔閛栏叄剔详毶详详閛剔栏详详:
        if 叄栏剔剔閛栏叄剔详毶详详閛剔栏详详.args[0] == 3:
            毶叄剔閛剔栏閛叄剔閛详剔毶栏閛详毶 = 76522401714066
        if 叄栏剔剔閛栏叄剔详毶详详閛剔栏详详.args[0] == 4:
            叄详详剔剔閛详剔叄剔叄叄详详栏详閛 = 191585653027672
        if 叄栏剔剔閛栏叄剔详毶详详閛剔栏详详.args[0] == 5:
            毶毶閛详閛毶叄叄叄毶栏閛閛毶毶详详 = 110256836680275
        if 叄栏剔剔閛栏叄剔详毶详详閛剔栏详详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('160589761200')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2959924')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11635523584')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35400)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('641364')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('238624768')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('397358')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20447232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('495')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1654784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~42)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('28835840')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1854')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('135')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1818')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~53)'))))()]))())
閛栏栏毶剔叄閛栏栏叄閛栏閛閛毶剔详 = 0
while 閛栏栏毶剔叄閛栏栏叄閛栏閛閛毶剔详 != 2:
    閛栏栏毶剔叄閛栏栏叄閛栏閛閛毶剔详 += 1
    try:
        raise VELIMATIX(閛栏栏毶剔叄閛栏栏叄閛栏閛閛毶剔详)
    except VELIMATIX as 叄详栏剔栏详剔閛栏详详剔详毶详剔閛:
        if 叄详栏剔栏详剔閛栏详详剔详毶详剔閛.args[0] == 3:
            叄详剔详閛毶毶详栏毶毶毶叄閛栏剔栏 = 246016155168030
        if 叄详栏剔栏详剔閛栏详详剔详毶详剔閛.args[0] == 4:
            叄叄剔叄剔閛栏详叄栏栏叄栏详閛栏毶 = 170514076231699
        if 叄详栏剔栏详剔閛栏详详剔详毶详剔閛.args[0] == 5:
            叄栏毶毶閛详剔閛毶叄閛栏栏毶毶閛剔 = 273906875556699
        if 叄详栏剔栏详剔閛栏详详剔详毶详剔閛.args[0] == 1:
            惛抔鉒吿擹鷥()['嵘祀餱吥耨祶'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5472750')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('645779898')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('574634655')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472711)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472746)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('470653146')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('426871458')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472711)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472747)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('645779898')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472711)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5472686)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5472770')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('618416343')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5472772')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5472759')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1172745')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14942208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('62')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13056')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~85)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('66')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('791')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('57')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~51)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~39)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('466944')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('462848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('73')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('352')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('85')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('84')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('62')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6144')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1472')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('270')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('206848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~101)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('70')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('226')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('62')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~49)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('47')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))()]))())
閛剔栏閛详閛剔毶剔详详毶剔叄叄閛閛 = 0
while 閛剔栏閛详閛剔毶剔详详毶剔叄叄閛閛 != 2:
    閛剔栏閛详閛剔毶剔详详毶剔叄叄閛閛 += 1
    try:
        raise VELIMATIX(閛剔栏閛详閛剔毶剔详详毶剔叄叄閛閛)
    except VELIMATIX as 剔叄剔详剔详剔叄栏叄剔详剔详閛閛详:
        if 剔叄剔详剔详剔叄栏叄剔详剔详閛閛详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102524')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('33720')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40257)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2250244096')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40320)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('411184')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('10223616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~81)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('454656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))()]))())
        if 剔叄剔详剔详剔叄栏叄剔详剔详閛閛详.args[0] == 3:
            详详栏详叄叄剔栏详详毶叄详閛栏閛栏 = 279069366267958
        if 剔叄剔详剔详剔叄栏叄剔详剔详閛閛详.args[0] == 4:
            剔閛栏閛叄详閛閛剔叄剔毶叄剔栏栏栏 = 66789926022193
        if 剔叄剔详剔详剔叄栏叄剔详剔详閛閛详.args[0] == 5:
            详详剔毶毶毶閛详叄详叄毶毶栏閛详毶 = 58921539397860
閛详叄閛栏栏剔栏详叄剔剔叄毶详详详 = 0
while 閛详叄閛栏栏剔栏详叄剔剔叄毶详详详 != 2:
    閛详叄閛栏栏剔栏详叄剔剔叄毶详详详 += 1
    try:
        raise VELIMATIX(閛详叄閛栏栏剔栏详叄剔剔叄毶详详详)
    except VELIMATIX as 閛閛剔閛叄叄详详详详毶毶毶叄栏栏剔:
        if 閛閛剔閛叄叄详详详详毶毶毶叄栏栏剔.args[0] == 3:
            剔栏剔剔毶栏叄栏栏剔栏叄毶閛剔剔栏 = 57924714033464
        if 閛閛剔閛叄叄详详详详毶毶毶叄栏栏剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118276096')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('448740')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('408024')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~21314)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('35352')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33493)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8501002')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3690058')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8501068')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3690058')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('409600')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))()]))())
详栏毶详閛剔详栏栏剔毶栏栏剔详剔详 = 0
while 详栏毶详閛剔详栏栏剔毶栏栏剔详剔详 != 2:
    详栏毶详閛剔详栏栏剔毶栏栏剔详剔详 += 1
    try:
        raise VELIMATIX(详栏毶详閛剔详栏栏剔毶栏栏剔详剔详)
    except VELIMATIX as 栏毶剔详叄详栏详閛剔栏閛剔毶剔閛毶:
        if 栏毶剔详叄详栏详閛剔栏閛剔毶剔閛毶.args[0] == 3:
            剔剔详剔閛详叄閛叄叄毶栏详叄閛叄详 = 55978578884143
        if 栏毶剔详叄详栏详閛剔栏閛剔毶剔閛毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2732174')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9261072')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2701629)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2732561)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2701629)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2709979)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2701629)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2710186)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('84563689329')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9261072')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('13358333952')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('196311609')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1363305')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30146560')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2124')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~119)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1710')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('454656')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1368')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('126')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))()]))())
详栏閛毶栏閛详叄毶剔叄栏详剔栏剔详 = 0
while 详栏閛毶栏閛详叄毶剔叄栏详剔栏剔详 != 2:
    详栏閛毶栏閛详叄毶剔叄栏详剔栏剔详 += 1
    try:
        raise VELIMATIX(详栏閛毶栏閛详叄毶剔叄栏详剔栏剔详)
    except VELIMATIX as 栏详剔毶详剔閛剔閛剔閛详閛叄閛剔剔:
        if 栏详剔毶详剔閛剔閛剔閛详閛叄閛剔剔.args[0] == 3:
            剔剔毶详叄详剔栏叄毶叄叄毶详閛毶叄 = 121529340134365
        if 栏详剔毶详剔閛剔閛剔閛详閛叄閛剔剔.args[0] == 4:
            详详閛剔剔毶叄叄详毶毶毶叄毶毶叄閛 = 122029681591536
        if 栏详剔毶详剔閛剔閛剔閛详閛叄閛剔剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6648393)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6631154)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6670781')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3938466')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6675414')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3938466')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6680578')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3938466')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('207609368211')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3938466')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6648393)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6621008)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4027544)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4027583)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3768320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1770')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('67')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('585')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))()]))())
毶毶栏详剔叄叄毶栏剔叄毶毶叄毶叄毶 = 0
while 毶毶栏详剔叄叄毶栏剔叄毶毶叄毶叄毶 != 2:
    毶毶栏详剔叄叄毶栏剔叄毶毶叄毶叄毶 += 1
    try:
        raise VELIMATIX(毶毶栏详剔叄叄毶栏剔叄毶毶叄毶叄毶)
    except VELIMATIX as 閛剔剔剔叄閛剔剔栏详閛閛栏毶剔毶閛:
        if 閛剔剔剔叄閛剔剔栏详閛閛栏毶剔毶閛.args[0] == 1:
            惛抔鉒吿擹鷥()['姐憨銨贞唅闉'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9627040)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9627015)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1107109600')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('0407269')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6912')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))()]))())
        if 閛剔剔剔叄閛剔剔栏详閛閛栏毶剔毶閛.args[0] == 3:
            叄毶栏毶栏閛叄叄详叄閛剔剔栏叄叄閛 = 21799819805653
閛叄栏毶详叄毶剔栏栏剔毶栏閛剔详剔 = 0
while 閛叄栏毶详叄毶剔栏栏剔毶栏閛剔详剔 != 2:
    閛叄栏毶详叄毶剔栏栏剔毶栏閛剔详剔 += 1
    try:
        raise VELIMATIX(閛叄栏毶详叄毶剔栏栏剔毶栏閛剔详剔)
    except VELIMATIX as 详閛栏详叄栏閛剔毶叄毶毶叄剔閛毶剔:
        if 详閛栏详叄栏閛剔毶叄毶毶叄剔閛毶剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5559196)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5540277)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('47589376')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1997733888')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('524672')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~31546)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('639631360')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4558325)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4558290)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58880')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1053')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('981')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1044')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))())
        if 详閛栏详叄栏閛剔毶叄毶毶叄剔閛毶剔.args[0] == 3:
            毶閛栏栏叄剔叄叄閛详毶閛详毶栏閛详 = 97869535743729
叄剔栏閛栏详叄详栏閛叄閛毶栏栏详详 = 0
while 叄剔栏閛栏详叄详栏閛叄閛毶栏栏详详 != 2:
    叄剔栏閛栏详叄详栏閛叄閛毶栏栏详详 += 1
    try:
        raise VELIMATIX(叄剔栏閛栏详叄详栏閛叄閛毶栏栏详详)
    except VELIMATIX as 栏剔详毶详栏毶閛栏閛剔閛详栏栏详閛:
        if 栏剔详毶详栏毶閛栏閛剔閛详栏栏详閛.args[0] == 3:
            详剔剔详详閛叄叄閛毶剔栏閛叄閛剔閛 = 72563480361302
        if 栏剔详毶详栏毶閛栏閛剔閛详栏栏详閛.args[0] == 4:
            剔叄栏毶剔叄剔栏剔叄叄毶閛剔閛毶栏 = 130684429601572
        if 栏剔详毶详栏毶閛栏閛剔閛详栏栏详閛.args[0] == 1:
            惛抔鉒吿擹鷥()['罶蒉匮撔盈觴'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('319488')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('52')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))()]))())
剔毶毶剔栏详剔叄剔閛毶毶详栏剔閛閛 = 0
while 剔毶毶剔栏详剔叄剔閛毶毶详栏剔閛閛 != 2:
    剔毶毶剔栏详剔叄剔閛毶毶详栏剔閛閛 += 1
    try:
        raise VELIMATIX(剔毶毶剔栏详剔叄剔閛毶毶详栏剔閛閛)
    except VELIMATIX as 毶详毶叄剔叄栏閛详栏剔毶毶详閛栏閛:
        if 毶详毶叄剔叄栏閛详栏剔毶毶详閛栏閛.args[0] == 3:
            详剔栏閛栏剔栏详剔閛閛叄详閛栏閛毶 = 231880212982447
        if 毶详毶叄剔叄栏閛详栏剔毶毶详閛栏閛.args[0] == 4:
            閛剔叄閛详栏栏毶剔毶详剔剔叄毶栏详 = 267047957204923
        if 毶详毶叄剔叄栏閛详栏剔毶毶详閛栏閛.args[0] == 5:
            栏叄叄閛叄详栏閛叄剔閛叄栏叄毶栏閛 = 77917238204147
        if 毶详毶叄剔叄栏閛详栏剔毶毶详閛栏閛.args[0] == 1:
            惛抔鉒吿擹鷥()['浉簾视筿攧喻'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4854553')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4154584')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1703936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~122)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('237568')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('896')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7536640')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~42)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('752')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('752')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('134')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1744')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15728640')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('106496')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~36)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('970')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1000')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1050')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('27525120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~60)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6272')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('666')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~41)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('582')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('594')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('606')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12544')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('777')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('777')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~40)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110592')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53760')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('450')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~97)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7168')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('45')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))()]))())
叄详栏详栏閛叄叄毶毶剔详毶閛剔毶毶 = 0
while 叄详栏详栏閛叄叄毶毶剔详毶閛剔毶毶 != 2:
    叄详栏详栏閛叄叄毶毶剔详毶閛剔毶毶 += 1
    try:
        raise VELIMATIX(叄详栏详栏閛叄叄毶毶剔详毶閛剔毶毶)
    except VELIMATIX as 叄閛叄叄栏详栏栏閛閛栏详详剔栏閛剔:
        if 叄閛叄叄栏详栏栏閛閛栏详详剔栏閛剔.args[0] == 3:
            栏毶栏叄叄閛叄剔栏毶毶栏叄叄栏閛叄 = 218054577675200
        if 叄閛叄叄栏详栏栏閛閛栏详详剔栏閛剔.args[0] == 1:
            惛抔鉒吿擹鷥()['孪章冻邓舝掻'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('244277709')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1353626')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6263635')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1353626')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('15204352')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14155776')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~17)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~63)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58720256')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25427968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2070')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('342')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))()]))())
栏毶叄栏閛閛閛閛叄剔详栏閛閛叄详栏 = 0
while 栏毶叄栏閛閛閛閛叄剔详栏閛閛叄详栏 != 2:
    栏毶叄栏閛閛閛閛叄剔详栏閛閛叄详栏 += 1
    try:
        raise VELIMATIX(栏毶叄栏閛閛閛閛叄剔详栏閛閛叄详栏)
    except VELIMATIX as 閛閛閛剔閛毶毶剔閛閛栏栏详毶栏剔閛:
        if 閛閛閛剔閛毶毶剔閛閛栏栏详毶栏剔閛.args[0] == 1:
            惛抔鉒吿擹鷥()['砐翌眧吩冲交'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('151969116')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4466983')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896644)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896631)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896644)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896615)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3896758')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4466983')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896644)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3896621)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('224')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~117)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))()]))())
        if 閛閛閛剔閛毶毶剔閛閛栏栏详毶栏剔閛.args[0] == 3:
            详叄閛栏剔毶叄剔叄叄剔栏閛栏栏叄叄 = 92968794437629
        if 閛閛閛剔閛毶毶剔閛閛栏栏详毶栏剔閛.args[0] == 4:
            栏剔叄叄栏栏叄栏剔閛详剔毶毶剔毶剔 = 211252646000257
毶閛叄剔閛閛详毶毶閛毶详剔毶栏栏详 = 0
while 毶閛叄剔閛閛详毶毶閛毶详剔毶栏栏详 != 2:
    毶閛叄剔閛閛详毶毶閛毶详剔毶栏栏详 += 1
    try:
        raise VELIMATIX(毶閛叄剔閛閛详毶毶閛毶详剔毶栏栏详)
    except VELIMATIX as 栏毶叄详栏閛毶剔栏閛叄栏栏閛閛详详:
        if 栏毶叄详栏閛毶剔栏閛叄栏栏閛閛详详.args[0] == 1:
            惛抔鉒吿擹鷥()['雾軿蚖痳针麦'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('67793388')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2928371')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('201641872')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2928371')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1738393')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2928371')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('208595040')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2928371')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1738292)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1738304)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1738292)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1738267)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('217088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1589248')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~120)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1610')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('128')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1720320')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~126)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('130')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))())
        if 栏毶叄详栏閛毶剔栏閛叄栏栏閛閛详详.args[0] == 3:
            剔毶栏毶剔毶叄叄閛閛剔详閛详栏剔毶 = 134297971697507
        if 栏毶叄详栏閛毶剔栏閛叄栏栏閛閛详详.args[0] == 4:
            剔毶剔详详閛栏详閛毶详剔栏详閛详毶 = 183016299879760
毶详毶详详剔閛叄详叄閛详栏剔剔栏详 = 0
while 毶详毶详详剔閛叄详叄閛详栏剔剔栏详 != 2:
    毶详毶详详剔閛叄详叄閛详栏剔剔栏详 += 1
    try:
        raise VELIMATIX(毶详毶详详剔閛叄详叄閛详栏剔剔栏详)
    except VELIMATIX as 详叄閛毶详栏毶閛閛栏栏详剔详剔剔剔:
        if 详叄閛毶详栏毶閛閛栏栏详剔详剔剔剔.args[0] == 3:
            详栏栏栏详详叄剔详叄栏栏叄剔叄剔毶 = 113045625262300
        if 详叄閛毶详栏毶閛閛栏栏详剔详剔剔剔.args[0] == 4:
            栏栏栏详栏閛详閛栏详毶详剔叄叄详閛 = 41640290275490
        if 详叄閛毶详栏毶閛閛栏栏详剔详剔剔剔.args[0] == 5:
            叄栏毶剔閛毶剔毶毶毶详栏详剔叄毶毶 = 74602111773611
        if 详叄閛毶详栏毶閛閛栏栏详剔详剔剔剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4011309')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3668793')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4010866')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3668793')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3978663)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3982831)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3978663)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3981807)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4015992')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3668793')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4001480')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3668793')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6934489)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6934526)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))()]))())
剔叄毶叄详閛剔閛閛剔详详毶毶叄详剔 = 0
while 剔叄毶叄详閛剔閛閛剔详详毶毶叄详剔 != 2:
    剔叄毶叄详閛剔閛閛剔详详毶毶叄详剔 += 1
    try:
        raise VELIMATIX(剔叄毶叄详閛剔閛閛剔详详毶毶叄详剔)
    except VELIMATIX as 叄栏閛详毶叄详叄叄叄叄剔毶剔閛栏剔:
        if 叄栏閛详毶叄详叄叄叄叄剔毶剔閛栏剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('146798483940')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1305264')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4625031)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4646430)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('253018112')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1224540160')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~23309)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('44847104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('366481986')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4796939')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1024270166')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4796939')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~118)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('404')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('34')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~94)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('36')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('42')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~44)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('44')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4128768')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('544')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('43')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))()]))())
        if 叄栏閛详毶叄详叄叄叄叄剔毶剔閛栏剔.args[0] == 3:
            叄剔毶叄毶毶叄閛閛详剔栏栏叄閛栏叄 = 158524530296365
栏閛栏栏叄详剔剔剔栏剔剔详毶毶閛剔 = 0
while 栏閛栏栏叄详剔剔剔栏剔剔详毶毶閛剔 != 2:
    栏閛栏栏叄详剔剔剔栏剔剔详毶毶閛剔 += 1
    try:
        raise VELIMATIX(栏閛栏栏叄详剔剔剔栏剔剔详毶毶閛剔)
    except VELIMATIX as 详毶叄详閛叄毶剔毶栏栏閛閛閛叄剔剔:
        if 详毶叄详閛叄毶剔毶栏栏閛閛閛叄剔剔.args[0] == 3:
            閛毶毶栏详毶栏閛详栏閛剔閛閛叄剔剔 = 132617042185999
        if 详毶叄详閛叄毶剔毶栏栏閛閛閛叄剔剔.args[0] == 4:
            栏叄剔叄閛剔详毶閛栏叄叄栏栏毶毶叄 = 123486688285619
        if 详毶叄详閛叄毶剔毶栏栏閛閛閛叄剔剔.args[0] == 5:
            栏栏栏閛毶毶详毶栏详叄详閛毶毶閛叄 = 48997783520635
        if 详毶叄详閛叄毶剔毶栏栏閛閛閛叄剔剔.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5827738')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3613975')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5829159')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3613975')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('241033216')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('12436480')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~31976)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~34916)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5268930')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6788625')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('500543220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6788625')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5268876)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5268924)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3112960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('63')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~80)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('855')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~80)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('64')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('200704')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1140')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('68')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('380')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25690112')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('24903680')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('75')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1710')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('74')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~57)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20480')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~36)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('486')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~86)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('768')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('380')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('192')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('99')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('228')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1520')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('99')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('380')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('917504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('25088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~86)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14942208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('24903680')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('73')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))()]))())
毶毶叄毶閛详閛详毶叄剔閛叄详閛毶详 = 0
while 毶毶叄毶閛详閛详毶叄剔閛叄详閛毶详 != 2:
    毶毶叄毶閛详閛详毶叄剔閛叄详閛毶详 += 1
    try:
        raise VELIMATIX(毶毶叄毶閛详閛详毶叄剔閛叄详閛毶详)
    except VELIMATIX as 栏详详剔閛详栏栏叄毶叄閛详详详栏毶:
        if 栏详详剔閛详栏栏叄毶叄閛详详详栏毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4093245)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4128407)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4126083')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5423904')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('154487252790')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5423904')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4123108')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5423904')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4120041')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5423904')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4093245)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4073531)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('225')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~247)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('65536')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('243')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('223232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('352')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1144')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7854)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1331')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1900544')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7855)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7208960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('512')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54525952')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~242)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6720')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('654')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('114')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('630')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('642')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('606')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('19968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))())
        if 栏详详剔閛详栏栏叄毶叄閛详详详栏毶.args[0] == 3:
            叄叄毶閛閛閛剔剔详剔剔閛详栏剔閛剔 = 19205325801429
        if 栏详详剔閛详栏栏叄毶叄閛详详详栏毶.args[0] == 4:
            栏閛详叄叄閛栏叄详剔閛閛叄毶毶详叄 = 141673373935922
详详栏毶详剔叄叄毶閛閛毶閛栏叄详剔 = 0
while 详详栏毶详剔叄叄毶閛閛毶閛栏叄详剔 != 2:
    详详栏毶详剔叄叄毶閛閛毶閛栏叄详剔 += 1
    try:
        raise VELIMATIX(详详栏毶详剔叄叄毶閛閛毶閛栏叄详剔)
    except VELIMATIX as 叄详详详叄详栏毶毶叄閛详閛栏详叄叄:
        if 叄详详详叄详栏毶毶叄閛详閛栏详叄叄.args[0] == 3:
            剔叄栏毶叄叄栏详毶叄叄剔详剔剔毶閛 = 113235052588397
        if 叄详详详叄详栏毶毶叄閛详閛栏详叄叄.args[0] == 4:
            毶叄毶閛毶剔閛剔叄叄叄閛剔剔详閛剔 = 107216693002259
        if 叄详详详叄详栏毶毶叄閛详閛栏详叄叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('66730223736')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1301652')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9262336')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('24008')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2916352000')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21568')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('960397312')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9397737)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9397710)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1071342018')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7377939')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('10223616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))()]))())
閛閛閛栏閛详毶栏閛剔剔叄閛閛毶剔剔 = 0
while 閛閛閛栏閛详毶栏閛剔剔叄閛閛毶剔剔 != 2:
    閛閛閛栏閛详毶栏閛剔剔叄閛閛毶剔剔 += 1
    try:
        raise VELIMATIX(閛閛閛栏閛详毶栏閛剔剔叄閛閛毶剔剔)
    except VELIMATIX as 毶叄毶剔栏详閛毶毶毶閛详剔閛閛閛剔:
        if 毶叄毶剔栏详閛毶毶毶閛详剔閛閛閛剔.args[0] == 1:
            惛抔鉒吿擹鷥()['龽仑姄雚猧灐'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6688211')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2718866')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('648752684')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2718866')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6688172)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6688139)'))))()]))())
        if 毶叄毶剔栏详閛毶毶毶閛详剔閛閛閛剔.args[0] == 3:
            栏閛叄毶详栏剔详剔閛栏毶剔叄閛详叄 = 197784173350788
剔叄栏叄毶剔毶叄详毶閛叄叄毶叄毶閛 = 0
while 剔叄栏叄毶剔毶叄详毶閛叄叄毶叄毶閛 != 2:
    剔叄栏叄毶剔毶叄详毶閛叄叄毶叄毶閛 += 1
    try:
        raise VELIMATIX(剔叄栏叄毶剔毶叄详毶閛叄叄毶叄毶閛)
    except VELIMATIX as 閛详剔栏剔毶叄毶剔剔毶剔剔叄详叄栏:
        if 閛详剔栏剔毶叄毶剔剔毶剔剔叄详叄栏.args[0] == 3:
            详毶剔栏毶详剔毶剔閛閛栏剔閛详閛详 = 51853852092831
        if 閛详剔栏剔毶叄毶剔剔毶剔剔叄详叄栏.args[0] == 4:
            剔栏毶剔毶叄毶毶叄详毶剔栏详毶閛閛 = 36254111972194
        if 閛详剔栏剔毶叄毶剔剔毶剔剔叄详叄栏.args[0] == 1:
            惛抔鉒吿擹鷥()['躩嵎解缝頮螾'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2073265')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6223702')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2073226)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2073329)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2073351')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6223702')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2073226)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2073329)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('259153250')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6223702')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5111808')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))())
剔叄剔详详剔閛剔叄閛叄叄閛剔栏毶详 = 0
while 剔叄剔详详剔閛剔叄閛叄叄閛剔栏毶详 != 2:
    剔叄剔详详剔閛剔叄閛叄叄閛剔栏毶详 += 1
    try:
        raise VELIMATIX(剔叄剔详详剔閛剔叄閛叄叄閛剔栏毶详)
    except VELIMATIX as 剔剔毶栏详閛叄详详閛剔栏叄剔叄详閛:
        if 剔剔毶栏详閛叄详详閛剔栏叄剔叄详閛.args[0] == 3:
            详閛毶叄閛剔毶毶叄閛栏剔栏閛叄叄栏 = 138536790545931
        if 剔剔毶栏详閛叄详详閛剔栏叄剔叄详閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('240800052271')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1781347')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7456623')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1781347')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7431871)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7418405)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('836370432')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('342870')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29489')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1179785)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1179822)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108540220')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5879711')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('129776350')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5879711')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('20447232')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))()]))())
栏剔叄毶详毶详閛剔栏叄栏閛毶叄毶详 = 0
while 栏剔叄毶详毶详閛剔栏叄栏閛毶叄毶详 != 2:
    栏剔叄毶详毶详閛剔栏叄栏閛毶叄毶详 += 1
    try:
        raise VELIMATIX(栏剔叄毶详毶详閛剔栏叄栏閛毶叄毶详)
    except VELIMATIX as 叄栏栏叄叄閛详栏毶详閛叄剔栏栏毶详:
        if 叄栏栏叄叄閛详栏毶详閛叄剔栏栏毶详.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9761319)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9728640)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9796547')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9131679')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9761319)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9738259)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9761319)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~9741545)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('204718080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('520819')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2814279)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2814304)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('292685016')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9724182')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2814279)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2814259)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3801088')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('127')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('130')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('870')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~32)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('705')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('129')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6208')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('714')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('276')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('618')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('60817408')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30670848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51380224')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('134')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1919')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('133')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1881')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~124)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~125)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2204')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('120')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2090')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2204')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~61)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('118')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2109')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6976')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('432')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('222')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7208960')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6592')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('236')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('216')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('94')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1050')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1100')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('385024')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('198')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('188416')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~120)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('132')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1392')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~12)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~43)'))))()]))())
閛栏毶栏详叄详叄剔叄详閛閛详详详剔 = 0
while 閛栏毶栏详叄详叄剔叄详閛閛详详详剔 != 2:
    閛栏毶栏详叄详叄剔叄详閛閛详详详剔 += 1
    try:
        raise VELIMATIX(閛栏毶栏详叄详叄剔叄详閛閛详详详剔)
    except VELIMATIX as 叄详剔閛剔剔剔栏叄剔毶閛叄栏剔閛叄:
        if 叄详剔閛剔剔剔栏叄剔毶閛叄栏剔閛叄.args[0] == 1:
            惛抔鉒吿擹鷥()['腌勖猄餳匶詘'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4352553')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4152534')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8448')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54887')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3168')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('520')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7884)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('37')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('17891328')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~416)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7923')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~101)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~48)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~16)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~115)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2058616832')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7168')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('600')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2018048')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~107)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('832')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('40')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('236')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('259162112')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~47)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4140302336')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~19)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('524288')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~98)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7849)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~14)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~96)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8448')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))()]))())
        if 叄详剔閛剔剔剔栏叄剔毶閛叄栏剔閛叄.args[0] == 3:
            閛叄剔毶剔栏剔剔閛剔详栏閛閛剔栏详 = 219928168778108
        if 叄详剔閛剔剔剔栏叄剔毶閛叄栏剔閛叄.args[0] == 4:
            叄閛毶栏叄閛閛栏叄毶叄毶剔详栏剔叄 = 128389793836829
毶叄栏叄叄栏閛栏叄毶详剔栏叄详剔毶 = 0
while 毶叄栏叄叄栏閛栏叄毶详剔栏叄详剔毶 != 2:
    毶叄栏叄叄栏閛栏叄毶详剔栏叄详剔毶 += 1
    try:
        raise VELIMATIX(毶叄栏叄叄栏閛栏叄毶详剔栏叄详剔毶)
    except VELIMATIX as 閛详栏详详详详閛毶閛详叄閛详栏栏叄:
        if 閛详栏详详详详閛毶閛详叄閛详栏栏叄.args[0] == 3:
            毶閛详剔毶剔剔閛剔剔详详栏栏栏详详 = 240925569571821
        if 閛详栏详详详详閛毶閛详叄閛详栏栏叄.args[0] == 4:
            栏栏剔毶栏毶閛叄详毶详栏栏剔叄毶剔 = 244353320364020
        if 閛详栏详详详详閛毶閛详叄閛详栏栏叄.args[0] == 1:
            惛抔鉒吿擹鷥()['諌葖竦膙觲吗'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39936')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('670')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('222')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~106)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~104)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('102')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1712')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('976')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('440')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('107')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('36')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~108)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7911')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('128')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('432')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31516')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('64')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~105)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('112')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7864')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('99')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~33)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('99')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('851968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5616')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~45)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3549')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2072')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~109)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~3)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('35')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('312')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7856')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('336')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('96')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1638')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('770')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('224')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3899392')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('113')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('130')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1575')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('131')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('202')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8448')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('312')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))()]))())
详详剔详栏详详毶叄剔栏閛剔栏剔閛閛 = 0
while 详详剔详栏详详毶叄剔栏閛剔栏剔閛閛 != 2:
    详详剔详栏详详毶叄剔栏閛剔栏剔閛閛 += 1
    try:
        raise VELIMATIX(详详剔详栏详详毶叄剔栏閛剔栏剔閛閛)
    except VELIMATIX as 栏详详栏閛閛详毶栏剔毶栏叄閛栏毶毶:
        if 栏详详栏閛閛详毶栏剔毶栏叄閛栏毶毶.args[0] == 3:
            栏详剔详详閛毶閛详栏叄叄剔叄栏剔毶 = 29046909738506
        if 栏详详栏閛閛详毶栏剔毶栏叄閛栏毶毶.args[0] == 1:
            惛抔鉒吿擹鷥()['梒貾壡蟑昸媐'[::-1]] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('108448041')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9170872')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('233580396')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9170872')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2780830')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9170872')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2780719)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2780736)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('300317652')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9170872')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('88983008')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9170872')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('132')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~103)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1024')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('525')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('54784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1616')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('64')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78848')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('115')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7887')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('64')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('105')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('237')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))()]))())
閛毶毶栏剔毶毶栏閛详栏毶毶閛详详閛 = 0
while 閛毶毶栏剔毶毶栏閛详栏毶毶閛详详閛 != 2:
    閛毶毶栏剔毶毶栏閛详栏毶毶閛详详閛 += 1
    try:
        raise VELIMATIX(閛毶毶栏剔毶毶栏閛详栏毶毶閛详详閛)
    except VELIMATIX as 閛毶毶栏剔閛详叄毶叄叄详栏栏閛叄閛:
        if 閛毶毶栏剔閛详叄毶叄叄详栏栏閛叄閛.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4034906')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9343004')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4003439)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4016102)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4003439)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4033213)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81301839212')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9343004')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('228736')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4374134784')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('71')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4427778')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9377244')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4427739)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~4427772)'))))()]))())
剔栏毶剔详閛叄毶毶閛详叄详閛叄閛叄 = 0
while 剔栏毶剔详閛叄毶毶閛详叄详閛叄閛叄 != 2:
    剔栏毶剔详閛叄毶毶閛详叄详閛叄閛叄 += 1
    try:
        raise VELIMATIX(剔栏毶剔详閛叄毶毶閛详叄详閛叄閛叄)
    except VELIMATIX as 详毶閛閛叄閛栏毶閛毶毶详详栏栏详叄:
        if 详毶閛閛叄閛栏毶閛毶毶详详栏栏详叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2719666)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~2698575)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1978793984')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('10731388928')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8288512')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('229520')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~8)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~37473)'))))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('19968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('702')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('936')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('251296')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('117')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('160')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('17825792')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~50)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('116')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~18)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~242)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1890')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('81')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('512')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('472')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('420')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7875')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('464')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('232')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('128')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('19968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))()]))())
栏详栏毶详叄剔叄栏剔毶叄叄閛栏详详 = 0
while 栏详栏毶详叄剔叄栏剔毶叄叄閛栏详详 != 2:
    栏详栏毶详叄剔叄栏剔毶叄叄閛栏详详 += 1
    try:
        raise VELIMATIX(栏详栏毶详叄剔叄栏剔毶叄叄閛栏详详)
    except VELIMATIX as 详叄叄毶叄详剔详毶详閛栏栏剔栏剔叄:
        if 详叄叄毶叄详剔详毶详閛栏栏剔栏剔叄.args[0] == 3:
            叄毶閛剔毶閛毶毶毶毶剔剔叄叄剔毶详 = 26465567497449
        if 详叄叄毶叄详剔详毶详閛栏栏剔栏剔叄.args[0] == 4:
            栏栏毶栏栏閛閛栏毶毶閛栏剔剔详毶详 = 56084776244341
        if 详叄叄毶叄详剔详毶详閛栏栏剔栏剔叄.args[0] == 5:
            叄详栏毶详详栏剔閛毶叄详栏叄剔栏剔 = 93531143412618
        if 详叄叄毶叄详剔详毶详閛栏栏剔栏剔叄.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55060335522')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8314731')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1403729')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8314731')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1411082')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8314731')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48125061036')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8314731')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1374138)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~1339008)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('30286001520')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8314731')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('624')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('90')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29952')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('53760')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('288')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('9')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3538944')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~15)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~253)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('220')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('104')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('57671680')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('149207')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2128')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1387')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('4352')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('588')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('230')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('111')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('192')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('124')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~111)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7865)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('696')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('110')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7909)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~118)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~6)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~38)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('648')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('6')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('129089536')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('462')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('156')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2')")[::-1])))()]))())
栏閛栏閛叄毶毶详叄毶详閛剔栏详栏叄 = 0
while 栏閛栏閛叄毶毶详叄毶详閛剔栏详栏叄 != 2:
    栏閛栏閛叄毶毶详叄毶详閛剔栏详栏叄 += 1
    try:
        raise VELIMATIX(栏閛栏閛叄毶毶详叄毶详閛剔栏详栏叄)
    except VELIMATIX as 剔叄栏叄閛详閛毶剔叄閛毶详剔叄閛栏:
        if 剔叄栏叄閛详閛毶剔叄閛毶详剔叄閛栏.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('38305792')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21106')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('77836288')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('428230')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~11)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~39242)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('294987')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('78832338')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2431202')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2021425')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('2431202')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('517013504')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('48')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('61')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('216')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('433')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7907')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('225280')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1133')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('638')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('43')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('50')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('11')")[::-1])))()]))())
叄详閛閛閛剔栏栏叄閛栏叄详剔毶栏栏 = 0
while 叄详閛閛閛剔栏栏叄閛栏叄详剔毶栏栏 != 2:
    叄详閛閛閛剔栏栏叄閛栏叄详剔毶栏栏 += 1
    try:
        raise VELIMATIX(叄详閛閛閛剔栏栏叄閛栏叄详剔毶栏栏)
    except VELIMATIX as 剔叄栏剔栏閛叄详閛叄详剔閛详栏閛剔:
        if 剔叄栏剔栏閛叄详閛叄详剔閛详栏閛剔.args[0] == 1:
            惛抔鉒吿擹鷥()['澔橱嚥麦媋涩'[::-1]] = 逇朋謒鉂煆舌(')8_4_8_3_5_9_7_7_1_1-(+8_4_9_3_5_9_7_7_1_1'[::-1])
        if 剔叄栏剔栏閛叄详閛叄详剔閛详栏閛剔.args[0] == 3:
            毶剔剔剔毶叄閛閛毶栏栏剔详栏毶叄叄 = 240637487218447
        if 剔叄栏剔栏閛叄详閛叄详剔閛详栏閛剔.args[0] == 4:
            毶详叄详剔栏详毶毶栏閛毶详叄叄栏详 = 171483666162614
閛毶毶叄栏毶详叄毶详毶剔详閛閛剔叄 = 0
while 閛毶毶叄栏毶详叄毶详毶剔详閛閛剔叄 != 2:
    閛毶毶叄栏毶详叄毶详毶剔详閛閛剔叄 += 1
    try:
        raise VELIMATIX(閛毶毶叄栏毶详叄毶详毶剔详閛閛剔叄)
    except VELIMATIX as 详剔栏剔叄閛栏详详叄叄閛剔栏毶详毶:
        if 详剔栏剔叄閛栏详详叄叄閛剔栏毶详毶.args[0] == 1:
            惛抔鉒吿擹鷥()[(lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('217835883036')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7732965')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5692377)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~5659328)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5726621')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7732965')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('164800006527')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7732965')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('219327285810')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7732965')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('168391896414')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7732965')")[::-1])))()]))()] = 逇朋謒鉂煆舌((lambda: 裦伧掼蛙辜齖([(lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('109562349')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1929082')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('704512')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1521')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~100)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~45)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('121')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3146')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~13)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~99)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1339')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('416')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('123')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1352')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('31')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32165888')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('14336')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~39)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('29440')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7897')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('8')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('32768')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1080')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~442)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7917')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1802240')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('41')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3375104')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('480')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1560')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('51')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('1012096')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('119')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('224')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('756')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~7872)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('39')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('5120')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('812')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('55223')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('7')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('430080')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('21')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('256')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('819')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('3')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('99328')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('42')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('59')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('480')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~10)')) ^ 驠衽堍埑站睱(逇朋謒鉂煆舌('禑攅颿饥襓铹(~35)'))))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('43')")) - 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))(), (lambda: 繰际落噄柼暔(驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('390')")) // 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('01')")[::-1])))()]))())
        if 详剔栏剔叄閛栏详详叄叄閛剔栏毶详毶.args[0] == 3:
            剔栏栏叄栏毶详叄栏毶叄毶详栏剔閛叄 = 18681476635403
        if 详剔栏剔叄閛栏详详叄叄閛剔栏毶详毶.args[0] == 4:
            详详叄剔详毶閛栏叄剔叄剔栏閛毶详详 = 100124450219620
import re
import requests
from bs4 import BeautifulSoup
import os
import hashlib
叄叄详栏剔閛毶栏毶详栏栏剔毶叄閛叄 = 0
while 叄叄详栏剔閛毶栏毶详栏栏剔毶叄閛叄 != 2:
    叄叄详栏剔閛毶栏毶详栏栏剔毶叄閛叄 += 1
    try:
        raise VELIMATIX(叄叄详栏剔閛毶栏毶详栏栏剔毶叄閛叄)
    except VELIMATIX as 详详閛毶叄详叄详叄剔栏详详详毶毶剔:
        if 详详閛毶叄详叄详叄剔栏详详详毶毶剔.args[0] == 3:
            毶叄栏叄栏详剔叄剔剔閛毶叄详详剔毶 = 175230112173475
        if 详详閛毶叄详叄详叄剔栏详详详毶毶剔.args[0] == 4:
            详毶叄详叄毶叄叄剔閛详剔叄栏栏閛详 = 237496205534824
        if 详详閛毶叄详叄详叄剔栏详详详毶毶剔.args[0] == 1:
            USER_SESSION_FILE = 燄寅扭哄娙滤
剔閛叄栏剔详剔剔毶栏叄详剔剔详详叄 = 0
while 剔閛叄栏剔详剔剔毶栏叄详剔剔详详叄 != 2:
    剔閛叄栏剔详剔剔毶栏叄详剔剔详详叄 += 1
    try:
        raise VELIMATIX(剔閛叄栏剔详剔剔毶栏叄详剔剔详详叄)
    except VELIMATIX as 叄剔毶详叄閛叄閛剔閛详閛毶閛剔閛閛:
        if 叄剔毶详叄閛叄閛剔閛详閛毶閛剔閛閛.args[0] == 3:
            毶叄毶栏叄剔剔毶栏毶剔叄栏閛閛閛毶 = 170768740648676
        if 叄剔毶详叄閛叄閛剔閛详閛毶閛剔閛閛.args[0] == 4:
            毶详叄毶叄栏详叄栏叄详栏閛毶毶剔毶 = 28550917623694
        if 叄剔毶详叄閛叄閛剔閛详閛毶閛剔閛閛.args[0] == 5:
            栏栏栏剔毶叄閛閛栏毶叄毶閛栏叄详閛 = 133798738506526
        if 叄剔毶详叄閛叄閛剔閛详閛毶閛剔閛閛.args[0] == 1:
            session = requests.Session()

def isnumeric(value):
    详毶栏栏毶閛详详毶详栏毶叄剔栏剔叄 = 0
    while 详毶栏栏毶閛详详毶详栏毶叄剔栏剔叄 != 2:
        详毶栏栏毶閛详详毶详栏毶叄剔栏剔叄 += 1
        try:
            raise VELIMATIX(详毶栏栏毶閛详详毶详栏毶叄剔栏剔叄)
        except VELIMATIX as 閛閛剔栏叄毶叄閛毶剔叄栏叄閛栏閛栏:
            if 閛閛剔栏叄毶叄閛毶剔叄栏叄閛栏閛栏.args[0] == 1:
                try:
                    return 禑攅颿饥襓铹(value).isnumeric()
                except:
                    return 觎欔媶檅鞐眙
            if 閛閛剔栏叄毶叄閛毶剔叄栏叄閛栏閛栏.args[0] == 3:
                毶详详毶剔叄叄栏叄叄栏剔栏閛閛详毶 = 253490996364435
            if 閛閛剔栏叄毶叄閛毶剔叄栏叄閛栏閛栏.args[0] == 4:
                毶閛栏閛剔栏详栏剔閛栏剔叄剔详叄剔 = 275566681383574

def clean_cookie(cookie):
    叄閛閛详栏剔閛栏毶毶毶叄毶毶详閛栏 = 0
    while 叄閛閛详栏剔閛栏毶毶毶叄毶毶详閛栏 != 2:
        叄閛閛详栏剔閛栏毶毶毶叄毶毶详閛栏 += 1
        try:
            raise VELIMATIX(叄閛閛详栏剔閛栏毶毶毶叄毶毶详閛栏)
        except VELIMATIX as 详毶毶剔剔叄剔剔毶栏栏剔閛剔详叄剔:
            if 详毶毶剔剔叄剔剔毶栏栏剔閛剔详叄剔.args[0] == 1:
                return re.sub(轼鈺釸逭擢緧, 屎蘢釱诛褌痔, cookie)
            if 详毶毶剔剔叄剔剔毶栏栏剔閛剔详叄剔.args[0] == 3:
                栏栏閛閛毶剔叄毶毶叄叄毶详叄剔剔详 = 121304466015246
            if 详毶毶剔剔叄剔剔毶栏栏剔閛剔详叄剔.args[0] == 4:
                栏閛栏毶閛栏叄閛閛閛栏叄剔剔閛详毶 = 5280934136161
            if 详毶毶剔剔叄剔剔毶栏栏剔閛剔详叄剔.args[0] == 5:
                详详閛毶剔详毶剔叄剔详閛栏叄閛毶详 = 109581920948326

def check_login(cookie):
    叄叄閛栏叄栏栏毶叄剔栏详閛毶叄栏毶 = 0
    while 叄叄閛栏叄栏栏毶叄剔栏详閛毶叄栏毶 != 5:
        叄叄閛栏叄栏栏毶叄剔栏详閛毶叄栏毶 += 1
        try:
            raise VELIMATIX(叄叄閛栏叄栏栏毶叄剔栏详閛毶叄栏毶)
        except VELIMATIX as 详栏详毶剔栏详详閛叄叄详详閛剔栏剔:
            if 详栏详毶剔栏详详閛叄叄详详閛剔栏剔.args[0] == 1:
                cleaned_cookie = clean_cookie(cookie)
            if 详栏详毶剔栏详详閛叄叄详详閛剔栏剔.args[0] == 4:
                if 逊酻笎虳堈郙 in response:
                    return (嚁玗抪筆銠赫, None, None)
                elif 藩塽桳鈿茉鷪 in response:
                    return (傇廢稠遳覑肈, cleaned_cookie, response)
                else:
                    return (彈絍辰膟滔玷, None, None)
            if 详栏详毶剔栏详详閛叄叄详详閛剔栏剔.args[0] == 3:
                response = session.get(侒算墓萪戎苵, headers=headers).text
            if 详栏详毶剔栏详详閛叄叄详详閛剔栏剔.args[0] == 2:
                headers = {訇轎朡殰替寵: 觡豢聞熰寲殕, 愓蘕曃樺阫鳶: 嘨譛幂縿棟芥, 詖鵏衬軌羙橰: 车耷粢皯齵痨, 齷鮒顄菏撧怳: 嵯糍饍鿞蹆髰, 舭鱭桘櫢珗缵: 辌磒赕繽詙锚, 搈燻彼帺嬾賝: 笙菼旵铚作瞣, 鿥淲秆谱級蒫: 譻卌斡鷰宎廀, 韊繂蚎騚験輖: 扮杔呁脇泌垰, 視斅鎜葮譺槤: cleaned_cookie}

def get_info(html, 叄栏毶详閛栏毶閛详剔剔栏详详閛叄详):
    毶閛详栏叄閛详剔详详栏閛毶栏栏叄剔 = 0
    while 毶閛详栏叄閛详剔详详栏閛毶栏栏叄剔 != 5:
        毶閛详栏叄閛详剔详详栏閛毶栏栏叄剔 += 1
        try:
            raise VELIMATIX(毶閛详栏叄閛详剔详详栏閛毶栏栏叄剔)
        except VELIMATIX as 毶閛详详叄毶栏详剔剔剔栏叄剔栏毶叄:
            if 毶閛详详叄毶栏详剔剔剔栏叄剔栏毶叄.args[0] == 1:
                if (lambda 毶毶閛栏剔閛閛閛剔叄栏剔毶详栏毶剔: 毶毶閛栏剔閛閛閛剔叄栏剔毶详栏毶剔 - (lambda: 1220 ^ 1226)())(叄栏毶详閛栏毶閛详剔剔栏详详閛叄详):
                    soup = 逇朋謒鉂煆舌("禑攅颿饥襓铹('917504')")
                else:
                    soup = BeautifulSoup(html, 彮蝎塥仝翧甤)
            if 毶閛详详叄毶栏详剔剔剔栏叄剔栏毶叄.args[0] == 2:
                username_element = soup.find(徚趖屘奦霾汏, class_=懖锰騷燱惝社)
            if 毶閛详详叄毶栏详剔剔剔栏叄剔栏毶叄.args[0] == 3:
                if username_element:
                    username_parts = username_element.text.split(鑍囝垯錙咰澥)
                    username = username_parts[噱沇筳纠窚朽].strip()
                    amount = username_parts[濭鏕鰴賗雜啝].strip() if 碂剾鵣柇檿髙(username_parts) > 弯鶀鏀咙鹢甕 else 蛜瞟薷腩奙徝
                else:
                    username = 褬娩妧漑鯛却
                    amount = 臑煵懖貱珸繢
            if 毶閛详详叄毶栏详剔剔剔栏叄剔栏毶叄.args[0] == 4:
                return (username, amount)

def buy_like(cookie, id_post, amount):
    详栏剔閛剔毶閛閛栏剔详剔剔叄剔叄叄 = 0
    while 详栏剔閛剔毶閛閛栏剔详剔剔叄剔叄叄 != 6:
        详栏剔閛剔毶閛閛栏剔详剔剔叄剔叄叄 += 1
        try:
            raise VELIMATIX(详栏剔閛剔毶閛閛栏剔详剔剔叄剔叄叄)
        except VELIMATIX as 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔:
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 3:
                payload = {烌鈓蓒华訌苙: id_post, 睑謬惦掗穅掇: 岻坴榍綹移甙, 闉唅贞銨憨姐: 驠衽堍埑站睱(amount), 娩嫅眓耘笪颀: 觴盈撔匮蒉罶}
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 1:
                cleaned_cookie = clean_cookie(cookie)
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 5:
                return response.text
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 4:
                response = session.post(喻攧筿视簾浉, headers=headers, data=payload)
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 2:
                headers = {硟鲟瓿尭覻咶: 伛拡忞墯銛誁, 閏蕂田骁忞柰: 侲假蜔碙滭路, 棳琕皸舒橊犌: 呞裆惀鼆畡舞, 荃軽罔角豱鵜: 憩繁櫗娢纭贎, 搖沘玖康盼猍: 溹驋货撌蜋圳, 搽鑉桝闶塱疁: 隢杬犑愬袴板, 冻藴喑歠挶黙: 炗実鰪烫龁復, 魭諅囔忘艭署: 熶偪嶝辢戃愳, 豭荖搳闘镏孯: 鰴涿嫵晴鱐扈, 胠舶荙祓啘誨: 謢胀啬浝漂傿, 虡魣驸燚龹耄: 殰峳扫俩鍓譕, 硽緑靲謝鄝軦: 鷮彔殊箊碶願, 釦嚱詛菜燉睦: 祶耨吥餱祀嵘, 搟莶鵃蘠鶐摣: cleaned_cookie}
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 7:
                叄栏栏閛叄閛叄毶剔剔毶叄毶详详毶毶 = 82536978383149
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 8:
                毶叄栏叄閛剔剔详叄详详叄叄栏剔栏閛 = 144592936796586
            if 閛毶閛栏剔毶毶剔毶閛栏栏详详剔详剔.args[0] == 9:
                详叄剔叄详详栏栏栏叄详剔毶閛叄毶毶 = 138946495774544

def get_response(html, 毶叄毶剔毶毶剔叄毶閛详閛毶详毶叄详):
    栏閛閛叄叄详剔剔叄栏閛详剔栏閛閛详 = 0
    while 栏閛閛叄叄详剔剔叄栏閛详剔栏閛閛详 != 6:
        栏閛閛叄叄详剔剔叄栏閛详剔栏閛閛详 += 1
        try:
            raise VELIMATIX(栏閛閛叄叄详剔剔叄栏閛详剔栏閛閛详)
        except VELIMATIX as 详栏详毶叄叄毶详剔详剔栏毶栏详详閛:
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 5:
                try:
                    match = re.search(pattern, js_code)
                    message = match.group(蜏貜狯廢糡衭)
                    return message
                except 罬筓鑵璁姬蛬:
                    return 讪聆鍮璧梬崆
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 4:
                pattern = 篼璙碦釺嬂喊
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 3:
                js_code = script_tag.text if script_tag else 羆緋灈瑈金夡
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 7:
                详栏毶详剔栏栏栏叄详栏剔剔叄详叄毶 = 232660394715983
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 2:
                script_tag = soup.find(交冲吩眧翌砐, type=麦针痳蚖軿雾)
            if 详栏详毶叄叄毶详剔详剔栏毶栏详详閛.args[0] == 1:
                if (lambda 叄剔栏叄閛叄毶详叄叄栏閛详叄叄剔閛: 叄剔栏叄閛叄毶详叄叄栏閛详叄叄剔閛 - (lambda: 1806 ^ 1802)() - (lambda: 5717 ^ 5720)() - (lambda: 6902 ^ 6885)() + (lambda: 612 ^ 623)())(毶叄毶剔毶毶剔叄毶閛详閛毶详毶叄详):
                    soup = 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('58195968')")) >> 驠衽堍埑站睱(逇朋謒鉂煆舌("禑攅颿饥襓铹('91')")[::-1])
                else:
                    soup = BeautifulSoup(html, 掻舝邓冻章孪)

def load_user_sessions():
    剔叄叄剔剔剔毶详閛閛閛閛毶剔毶叄叄 = 0
    while 剔叄叄剔剔剔毶详閛閛閛閛毶剔毶叄叄 != 3:
        剔叄叄剔剔剔毶详閛閛閛閛毶剔毶叄叄 += 1
        try:
            raise VELIMATIX(剔叄叄剔剔剔毶详閛閛閛閛毶剔毶叄叄)
        except VELIMATIX as 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶:
            if 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶.args[0] == 2:
                return __builtins__.__dict__['set']()
            if 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶.args[0] == 1:
                if os.path.exists(USER_SESSION_FILE):
                    with 蔽穈筥号敕藵(USER_SESSION_FILE, 旈赕巀囪启牽) as file:
                        return __builtins__.__dict__['set']((line.strip() for line in file.readlines()))
            if 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶.args[0] == 4:
                详叄栏毶叄閛详剔毶栏剔閛栏详叄叄栏 = 26941720753109
            if 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶.args[0] == 5:
                叄閛栏剔详閛详详栏叄毶栏閛叄剔剔栏 = 63730608666927
            if 栏毶毶毶剔閛毶毶毶閛閛详栏叄閛毶毶.args[0] == 6:
                毶剔毶详閛閛详详閛详详栏详閛叄详叄 = 202220145546484

def save_user_session(session_hash):
    剔详叄毶剔叄閛详毶叄叄毶叄栏详详剔 = 0
    while 剔详叄毶剔叄閛详毶叄叄毶叄栏详详剔 != 2:
        剔详叄毶剔叄閛详毶叄叄毶叄栏详详剔 += 1
        try:
            raise VELIMATIX(剔详叄毶剔叄閛详毶叄叄毶叄栏详详剔)
        except VELIMATIX as 剔详详毶剔毶栏详栏栏栏剔閛剔详详毶:
            if 剔详详毶剔毶栏详栏栏栏剔閛剔详详毶.args[0] == 3:
                閛栏叄毶閛详叄毶叄叄叄详详叄叄閛剔 = 67503967436331
            if 剔详详毶剔毶栏详栏栏栏剔閛剔详详毶.args[0] == 4:
                详叄叄详栏毶毶閛毶毶详毶毶栏剔栏详 = 13725196526919
            if 剔详详毶剔毶栏详栏栏栏剔閛剔详详毶.args[0] == 5:
                剔栏叄剔剔毶閛详毶閛毶叄栏閛栏详閛 = 234618330964091
            if 剔详详毶剔毶栏详栏栏栏剔閛剔详详毶.args[0] == 1:
                with 蔽穈筥号敕藵(USER_SESSION_FILE, 灐猧雚姄仑龽) as file:
                    file.write(螾頮缝解嵎躩.format(session_hash, 纑悰咚掴奊猢))

def hash_cookie(cookie):
    毶详叄剔剔毶栏栏剔毶栏叄详閛閛毶閛 = 0
    while 毶详叄剔剔毶栏栏剔毶栏叄详閛閛毶閛 != 2:
        毶详叄剔剔毶栏栏剔毶栏叄详閛閛毶閛 += 1
        try:
            raise VELIMATIX(毶详叄剔剔毶栏栏剔毶栏叄详閛閛毶閛)
        except VELIMATIX as 叄剔叄详详毶详栏详栏閛栏详栏详栏叄:
            if 叄剔叄详详毶详栏详栏閛栏详栏详栏叄.args[0] == 1:
                return hashlib.sha256(cookie.encode()).hexdigest()
            if 叄剔叄详详毶详栏详栏閛栏详栏详栏叄.args[0] == 3:
                閛剔剔叄详叄剔剔毶閛栏毶剔毶栏毶栏 = 240390347850640
            if 叄剔叄详详毶详栏详栏閛栏详栏详栏叄.args[0] == 4:
                閛栏详详毶閛毶栏叄剔毶详叄閛閛閛閛 = 58312161417642
            if 叄剔叄详详毶详栏详栏閛栏详栏详栏叄.args[0] == 5:
                栏叄剔栏毶閛毶详閛閛叄閛閛栏栏毶详 = 150595931827613
閛叄剔閛详閛毶毶毶毶閛栏栏剔详毶详 = 0
while 閛叄剔閛详閛毶毶毶毶閛栏栏剔详毶详 != 2:
    閛叄剔閛详閛毶毶毶毶閛栏栏剔详毶详 += 1
    try:
        raise VELIMATIX(閛叄剔閛详閛毶毶毶毶閛栏栏剔详毶详)
    except VELIMATIX as 剔栏详剔毶栏叄毶閛详栏毶毶详栏閛剔:
        if 剔栏详剔毶栏叄毶閛详栏毶毶详栏閛剔.args[0] == 1:
            user_sessions = load_user_sessions()
详剔閛毶毶叄栏栏毶閛栏毶叄栏剔剔栏 = 0
while 详剔閛毶毶叄栏栏毶閛栏毶叄栏剔剔栏 != 2:
    详剔閛毶毶叄栏栏毶閛栏毶叄栏剔剔栏 += 1
    try:
        raise VELIMATIX(详剔閛毶毶叄栏栏毶閛栏毶叄栏剔剔栏)
    except VELIMATIX as 閛毶栏栏毶剔栏毶剔栏详剔栏毶栏剔栏:
        if 閛毶栏栏毶剔栏毶剔栏详剔栏毶栏剔栏.args[0] == 1:
            cookie = requests.get(肧覜樴囎憞鱿).text
        if 閛毶栏栏毶剔栏毶剔栏详剔栏毶栏剔栏.args[0] == 3:
            叄详详閛详详閛毶栏叄閛栏閛閛叄详详 = 57390102956425
毶剔剔详栏閛详毶毶剔剔剔閛閛閛剔栏 = 0
while 毶剔剔详栏閛详毶毶剔剔剔閛閛閛剔栏 != 2:
    毶剔剔详栏閛详毶毶剔剔剔閛閛閛剔栏 += 1
    try:
        raise VELIMATIX(毶剔剔详栏閛详毶毶剔剔剔閛閛閛剔栏)
    except VELIMATIX as 閛栏栏剔详叄叄叄毶栏详栏叄剔栏剔详:
        if 閛栏栏剔详叄叄叄毶栏详栏叄剔栏剔详.args[0] == 1:
            cookie_hash = hash_cookie(cookie)
        if 閛栏栏剔详叄叄叄毶栏详栏叄剔栏剔详.args[0] == 3:
            栏栏详叄毶栏閛剔栏閛栏详剔叄毶毶详 = 115176660920071
        if 閛栏栏剔详叄叄叄毶栏详栏叄剔栏剔详.args[0] == 4:
            毶毶详剔栏栏详叄剔閛详栏栏栏栏详閛 = 8752003908615
        if 閛栏栏剔详叄叄叄毶栏详栏叄剔栏剔详.args[0] == 5:
            详毶剔閛栏剔毶剔栏閛栏栏閛详閛剔叄 = 26563309061310
if cookie_hash in user_sessions:
    详閛详详剔毶剔详毶栏毶栏閛栏栏详閛 = 0
    while 详閛详详剔毶剔详毶栏毶栏閛栏栏详閛 != 3:
        详閛详详剔毶剔详毶栏毶栏閛栏栏详閛 += 1
        try:
            raise VELIMATIX(详閛详详剔毶剔详毶栏毶栏閛栏栏详閛)
        except VELIMATIX as 详剔毶叄叄毶叄毶详栏栏剔栏栏剔栏閛:
            if 详剔毶叄叄毶叄毶详栏栏剔栏栏剔栏閛.args[0] == 2:
                聰壏拢鉻菛埲()
            if 详剔毶叄叄毶叄毶详栏栏剔栏栏剔栏閛.args[0] == 1:
                漘柸旘紎妢鬱(詘匶餳猄勖腌)
閛栏閛栏閛叄叄详剔閛详閛叄閛閛剔栏 = 0
while 閛栏閛栏閛叄叄详剔閛详閛叄閛閛剔栏 != 2:
    閛栏閛栏閛叄叄详剔閛详閛叄閛閛剔栏 += 1
    try:
        raise VELIMATIX(閛栏閛栏閛叄叄详剔閛详閛叄閛閛剔栏)
    except VELIMATIX as 栏毶栏栏叄剔剔详栏叄閛叄详叄剔叄详:
        if 栏毶栏栏叄剔剔详栏叄閛叄详叄剔叄详.args[0] == 1:
            status, cookie, content = check_login(cookie)
if not status:
    栏栏剔閛閛叄叄详叄叄详剔叄毶剔详閛 = 0
    while 栏栏剔閛閛叄叄详叄叄详剔叄毶剔详閛 != 3:
        栏栏剔閛閛叄叄详叄叄详剔叄毶剔详閛 += 1
        try:
            raise VELIMATIX(栏栏剔閛閛叄叄详叄叄详剔叄毶剔详閛)
        except VELIMATIX as 详栏毶详详栏栏叄叄叄剔叄详叄叄栏毶:
            if 详栏毶详详栏栏叄叄叄剔叄详叄叄栏毶.args[0] == 2:
                聰壏拢鉻菛埲()
            if 详栏毶详详栏栏叄叄叄剔叄详叄叄栏毶.args[0] == 4:
                详毶閛栏剔详栏叄详叄毶叄毶剔閛毶栏 = 264652867464574
            if 详栏毶详详栏栏叄叄叄剔叄详叄叄栏毶.args[0] == 1:
                漘柸旘紎妢鬱(吗觲膙竦葖諌)
剔毶剔详叄毶閛栏详閛详閛毶栏栏剔栏 = 0
while 剔毶剔详叄毶閛栏详閛详閛毶栏栏剔栏 != 2:
    剔毶剔详叄毶閛栏详閛详閛毶栏栏剔栏 += 1
    try:
        raise VELIMATIX(剔毶剔详叄毶閛栏详閛详閛毶栏栏剔栏)
    except VELIMATIX as 栏叄閛毶叄剔毶毶閛剔剔剔叄閛剔叄详:
        if 栏叄閛毶叄剔毶毶閛剔剔剔叄閛剔叄详.args[0] == 3:
            毶叄详毶閛剔详详閛毶剔毶剔毶毶剔栏 = 164247668505924
        if 栏叄閛毶叄剔毶毶閛剔剔剔叄閛剔叄详.args[0] == 4:
            閛详閛叄剔閛毶閛详栏详剔閛剔栏閛閛 = 220055061455010
        if 栏叄閛毶叄剔毶毶閛剔剔剔叄閛剔叄详.args[0] == 5:
            剔閛閛栏栏详剔閛閛详栏叄閛毶毶详剔 = 200850363470351
        if 栏叄閛毶叄剔毶毶閛剔剔剔叄閛剔叄详.args[0] == 1:
            username, amount = get_info(content, 14)
漘柸旘紎妢鬱(媐昸蟑壡貾梒)
漘柸旘紎妢鬱(竫冉鳒佔澰艜)
叄剔剔剔详栏剔栏栏閛閛栏毶叄毶閛叄 = 0
while 叄剔剔剔详栏剔栏栏閛閛栏毶叄毶閛叄 != 2:
    叄剔剔剔详栏剔栏栏閛閛栏毶叄毶閛叄 += 1
    try:
        raise VELIMATIX(叄剔剔剔详栏剔栏栏閛閛栏毶叄毶閛叄)
    except VELIMATIX as 栏毶叄叄栏详剔栏閛叄毶閛栏叄毶详详:
        if 栏毶叄叄栏详剔栏閛叄毶閛栏叄毶详详.args[0] == 3:
            閛毶栏叄閛详毶毶详毶叄毶栏栏栏閛閛 = 234833027804042
        if 栏毶叄叄栏详剔栏閛叄毶閛栏叄毶详详.args[0] == 1:
            id_post = 爎峬胬蟰俣玞(勽痲鿩繹瀒鉩)
if not isnumeric(id_post):
    閛毶閛栏栏毶详剔叄閛详详详閛栏叄毶 = 0
    while 閛毶閛栏栏毶详剔叄閛详详详閛栏叄毶 != 3:
        閛毶閛栏栏毶详剔叄閛详详详閛栏叄毶 += 1
        try:
            raise VELIMATIX(閛毶閛栏栏毶详剔叄閛详详详閛栏叄毶)
        except VELIMATIX as 毶叄閛叄毶详閛叄详剔毶剔剔閛详剔叄:
            if 毶叄閛叄毶详閛叄详剔毶剔剔閛详剔叄.args[0] == 1:
                漘柸旘紎妢鬱(鲅玗遐裎餺嘘)
            if 毶叄閛叄毶详閛叄详剔毶剔剔閛详剔叄.args[0] == 4:
                毶剔毶毶剔详剔栏栏详叄毶叄栏閛毶閛 = 19564931813724
            if 毶叄閛叄毶详閛叄详剔毶剔剔閛详剔叄.args[0] == 5:
                叄毶剔剔叄栏閛栏閛毶栏详详叄详栏叄 = 258149799873052
            if 毶叄閛叄毶详閛叄详剔毶剔剔閛详剔叄.args[0] == 2:
                聰壏拢鉻菛埲()
叄閛閛閛叄剔剔閛叄毶叄剔毶叄叄毶毶 = 0
while 叄閛閛閛叄剔剔閛叄毶叄剔毶叄叄毶毶 != 2:
    叄閛閛閛叄剔剔閛叄毶叄剔毶叄叄毶毶 += 1
    try:
        raise VELIMATIX(叄閛閛閛叄剔剔閛叄毶叄剔毶叄叄毶毶)
    except VELIMATIX as 栏详栏毶栏叄剔栏详栏详閛详详叄详毶:
        if 栏详栏毶栏叄剔栏详栏详閛详详叄详毶.args[0] == 3:
            详详详栏閛栏剔毶栏閛详详叄栏閛详閛 = 251735068713590
        if 栏详栏毶栏叄剔栏详栏详閛详详叄详毶.args[0] == 1:
            amount = 爎峬胬蟰俣玞(鈠剨鑶頒饁棁)
if not isnumeric(amount) or 驠衽堍埑站睱(amount) > 涩媋麦嚥橱澔:
    详閛剔閛叄閛毶閛閛剔栏叄剔毶閛毶栏 = 0
    while 详閛剔閛叄閛毶閛閛剔栏叄剔毶閛毶栏 != 3:
        详閛剔閛叄閛毶閛閛剔栏叄剔毶閛毶栏 += 1
        try:
            raise VELIMATIX(详閛剔閛叄閛毶閛閛剔栏叄剔毶閛毶栏)
        except VELIMATIX as 剔栏剔閛栏剔閛栏剔閛毶叄详剔叄详叄:
            if 剔栏剔閛栏剔閛栏剔閛毶叄详剔叄详叄.args[0] == 1:
                漘柸旘紎妢鬱(镼脙藄焗隂玎)
            if 剔栏剔閛栏剔閛栏剔閛毶叄详剔叄详叄.args[0] == 4:
                閛毶剔剔叄详详毶剔栏閛叄剔剔剔栏叄 = 248359786698661
            if 剔栏剔閛栏剔閛栏剔閛毶叄详剔叄详叄.args[0] == 5:
                叄栏叄毶叄详毶閛详毶閛剔详剔剔閛閛 = 60686373769361
            if 剔栏剔閛栏剔閛栏剔閛毶叄详剔叄详叄.args[0] == 2:
                聰壏拢鉻菛埲()
毶详剔栏閛剔毶叄毶详毶剔剔详剔閛閛 = 0
while 毶详剔栏閛剔毶叄毶详毶剔剔详剔閛閛 != 2:
    毶详剔栏閛剔毶叄毶详毶剔剔详剔閛閛 += 1
    try:
        raise VELIMATIX(毶详剔栏閛剔毶叄毶详毶剔剔详剔閛閛)
    except VELIMATIX as 剔毶閛详栏毶详详叄栏详毶閛剔叄毶详:
        if 剔毶閛详栏毶详详叄栏详毶閛剔叄毶详.args[0] == 1:
            response = buy_like(cookie, id_post, amount)
剔叄栏剔閛叄详閛閛閛叄剔剔閛剔栏剔 = 0
while 剔叄栏剔閛叄详閛閛閛叄剔剔閛剔栏剔 != 2:
    剔叄栏剔閛叄详閛閛閛叄剔剔閛剔栏剔 += 1
    try:
        raise VELIMATIX(剔叄栏剔閛叄详閛閛閛叄剔剔閛剔栏剔)
    except VELIMATIX as 详详毶栏毶栏毶剔栏详栏剔详栏毶閛详:
        if 详详毶栏毶栏毶剔栏详栏剔详栏毶閛详.args[0] == 1:
            response = get_response(response, 25)
漘柸旘紎妢鬱(response)
save_user_session(cookie_hash)