class VELIMATIX(MemoryError):0
__import__('builtins').匨釬巊佱錠鵄=getattr
__import__('builtins').貣癃季哹糹崗=dir
__import__('builtins').氫燔槕騿鈭洠=__import__
__import__('builtins').黭椭瓛佖雹闑=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('eurT'[::-1])])
__import__('builtins').嶺壚什羺瘁迒=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('eslaF'[::-1])])
__import__('builtins').糤丗推褮寏籩=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('loob'[::-1])])
__import__('builtins').跳嗔欃晌烴昱=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('epyt'[::-1])])
__import__('builtins').籄椟炧閆斯蓺=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rts'[::-1])])
__import__('builtins').姌叿裯秞翧隨=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tni'[::-1])])
__import__('builtins').殀睆茘舉愩毅=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('cexe'[::-1])])
__import__('builtins').粙宅狸锼潤站=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tnirp'[::-1])])
__import__('builtins').亸覤症埼摛卤=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rttates'[::-1])])
__import__('builtins').烇圼欧儋挸皓=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('srav'[::-1])])
__import__('builtins').瀧顲恣咀傳趆=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rhc'[::-1])])
__import__('builtins').崁莭聟溈慡覃=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tsil'[::-1])])
__import__('builtins').諠鮞璈洋斗裹=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('nepo'[::-1])])
__import__('builtins').貣癃季哹糹崗=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rid'[::-1])])
__import__('builtins').嗇奸娅瀅夅潰=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tcid'[::-1])])
__import__('builtins').竌鸒嶸胈宧镈=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('elput'[::-1])])
__import__('builtins').厹苭射馿塝箎=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('mus'[::-1])])
__import__('builtins').遃駉暼炰笅蕨=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('detros'[::-1])])
__import__('builtins').燘師瓥殁燧谋=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('dnuor'[::-1])])
__import__('builtins').碍封驇迅欵蔓=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rper'[::-1])])
__import__('builtins').惲挈裏呺淬绦=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('wop'[::-1])])
__import__('builtins').眬匬迩蝊坭逿=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tco'[::-1])])
__import__('builtins').剂嫤蚴鍿抑惕=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('txena'[::-1])])
__import__('builtins').炃碞譍鷏悳捦=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('txen'[::-1])])
__import__('builtins').猘翍瘮焟荩軝=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('nim'[::-1])])
__import__('builtins').渐枒緿刮壯傐=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('xam'[::-1])])
__import__('builtins').褺崌堾蠖麆鄕=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('slacol'[::-1])])
__import__('builtins').燿国鵲坩阱蜇=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('reti'[::-1])])
__import__('builtins').弓镗鱗迁巇垫=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('ssalcbussi'[::-1])])
__import__('builtins').瞃筛悒跥抚嵬=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrElacoLdnuobnU'[::-1])])
__import__('builtins').筀圲鑲衙纃闄=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('di'[::-1])])
__import__('builtins').傷蛕笳顙俆是=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('hsah'[::-1])])
__import__('builtins').鍰砵闕鮇穞砢=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rttasah'[::-1])])
__import__('builtins').竱睊灠怸杫嶻=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tamrof'[::-1])])
__import__('builtins').雎僄鳂臎帪褏=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('domvid'[::-1])])
__import__('builtins').譪鯣穮嗾狇醨=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rttaled'[::-1])])
__import__('builtins').伮霔蝍戮抹樲=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('elballac'[::-1])])
__import__('builtins').邠眳輠紶獈枰=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tniopkaerb'[::-1])])
__import__('builtins').潽隉噯猞趂篻=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('nib'[::-1])])
__import__('builtins').鎉飔花緺狶螡=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('iicsa'[::-1])])
__import__('builtins').蔐吣变俚錱戻=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('yna'[::-1])])
__import__('builtins').簎蕭觊胒煓俏=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('lla'[::-1])])
__import__('builtins').尨渘鰍龪漗鴤=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('sba'[::-1])])
__import__('builtins').縞塈穝駪半迄=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('xeh'[::-1])])
__import__('builtins').搃闯惨仇遥唧=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('desrever'[::-1])])
__import__('builtins').督捃沇睂魣鍺=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('dro'[::-1])])
__import__('builtins').旵姡楒銖狓珖=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tiuq'[::-1])])
__import__('builtins').葥枏凟汛眣琲=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tixe'[::-1])])
__import__('builtins').嬌虐庪枵弬怼=匨釬巊佱錠鵄(氫燔槕騿鈭洠('stseuqer'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('stseuqer'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('stseuqer'[::-1])).index('teg'[::-1])])
__import__('builtins').筲緦鷗懳擊赢=匨釬巊佱錠鵄(氫燔槕騿鈭洠('stseuqer'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('stseuqer'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('stseuqer'[::-1])).index('tsop'[::-1])])
__import__('builtins').觅摕襎慡掣謑=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('etaremune'[::-1])])
__import__('builtins').処鿎瑜至腚幉=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('pam'[::-1])])
__import__('builtins').儝薣唟髃化拙=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrExatnyS'[::-1])])
__import__('builtins').塞箋右碹櫴鿑=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEemaN'[::-1])])
__import__('builtins').屘罉廿璳纾帡=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEdnuoFtoNeliF'[::-1])])
__import__('builtins').棿旞縞卝庻燅=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEnoissimreP'[::-1])])
__import__('builtins').賡焂鴝悄緂畳=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrESO'[::-1])])
__import__('builtins').蟿凤祐蠏禶蟬=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEedocnEedocinU'[::-1])])
__import__('builtins').耛昘靎棤谶騿=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEtropmI'[::-1])])
__import__('builtins').栫胚椯饸錊墴=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEedoceDedocinU'[::-1])])
__import__('builtins').殪藍歩漹末欒=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('egnar'[::-1])])
__import__('builtins').鉪襉堘慥厹洜=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('elipmoc'[::-1])])
__import__('builtins').呎絟佱筄齺雄=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('slabolg'[::-1])])
__import__('builtins').娌雜郸唼紶叺=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEetubirttA'[::-1])])
__import__('builtins').郟麬傭祷橰馾=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEdnuoFtoNeludoM'[::-1])])
__import__('builtins').鐪逞伩差鞀鈩=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('noitpecxE'[::-1])])
__import__('builtins').懍蜴軤瞒睙娸=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEeulaV'[::-1])])
__import__('builtins').幇捠侄蠝鄙稀=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrExednI'[::-1])])
__import__('builtins').妕搘库妠灩殭=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tpurretnIdraobyeK'[::-1])])
__import__('builtins').巣砰鬮艥褵靜=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('ecnatsnisi'[::-1])])
__import__('builtins').鬰謈碐糢锠釢=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('nel'[::-1])])
__import__('builtins').碧暋続絰啴鱿=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('tupni'[::-1])])
__import__('builtins').侏跰鮵波遽菚=匨釬巊佱錠鵄(氫燔槕騿鈭洠('lahsram'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('lahsram'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('lahsram'[::-1])).index('sdaol'[::-1])])
__import__('builtins').猡皙杋玅祧繱=侏跰鮵波遽菚(b'\xda\x00').join
__import__('builtins').谤孺岮嬘婸傧=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('taolf'[::-1])])
__import__('builtins').籉旔虿浄醒嫏=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('rorrEFOE'[::-1])])
__import__('builtins').糞楫畒榌骤鯾=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('setyb'[::-1])])
__import__('builtins').欵喧埜懔怶蠝=匨釬巊佱錠鵄(氫燔槕騿鈭洠('sys'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('sys'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('sys'[::-1])).index('tixe'[::-1])])
__import__('builtins').援腷葠典爕歡=匨釬巊佱錠鵄(氫燔槕騿鈭洠('snitliub'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('snitliub'[::-1])).index('lave'[::-1])])
__import__('builtins').屟狢翂粫琙欭=匨釬巊佱錠鵄(氫燔槕騿鈭洠('bilz'[::-1]),貣癃季哹糹崗(氫燔槕騿鈭洠('bilz'[::-1]))[貣癃季哹糹崗(氫燔槕騿鈭洠('bilz'[::-1])).index('sserpmoced'[::-1])])
貈绵貈跣跣窵绵绵绵窵貈伖貈貈貈芏芏 = 0
while 貈绵貈跣跣窵绵绵绵窵貈伖貈貈貈芏芏 != 2:
    貈绵貈跣跣窵绵绵绵窵貈伖貈貈貈芏芏 += 1
    try:
        raise VELIMATIX(貈绵貈跣跣窵绵绵绵窵貈伖貈貈貈芏芏)
    except VELIMATIX as 跣貈绵伖绵跣绵窵跣绵绵貈貈貈貈芏伖:
        if 跣貈绵伖绵跣绵窵跣绵绵貈貈貈貈芏伖.args[0] == 3:
            绵貈芏貈芏貈貈跣芏绵跣跣伖跣绵貈绵 = 405498374741
        if 跣貈绵伖绵跣绵窵跣绵绵貈貈貈貈芏伖.args[0] == 4:
            貈伖跣绵跣芏跣芏绵绵貈伖貈绵绵貈芏 = 163910522798746
        if 跣貈绵伖绵跣绵窵跣绵绵貈貈貈貈芏伖.args[0] == 1:
            烇圼欧儋挸皓()['灖瞑拓繍鱔轈'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4496963')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4296944')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4496973')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4296944')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('530637032')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4296944')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('341766224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4296944')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('368')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('928')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1966080')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('130')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('546')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))()]))())
绵伖窵绵伖芏芏伖窵貈跣窵绵绵窵伖窵 = 0
while 绵伖窵绵伖芏芏伖窵貈跣窵绵绵窵伖窵 != 2:
    绵伖窵绵伖芏芏伖窵貈跣窵绵绵窵伖窵 += 1
    try:
        raise VELIMATIX(绵伖窵绵伖芏芏伖窵貈跣窵绵绵窵伖窵)
    except VELIMATIX as 芏伖伖窵芏伖貈芏伖跣貈绵绵伖窵绵跣:
        if 芏伖伖窵芏伖貈芏伖跣貈绵绵伖窵绵跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9439603')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2023049')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9425217')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2023049')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('267455274486')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2023049')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9426155')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2023049')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9403202)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9381680)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9443075')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2023049')")[::-1])))()]))()] = not 糤丗推褮寏籩(籄椟炧閆斯蓺(嶺壚什羺瘁迒))
        if 芏伖伖窵芏伖貈芏伖跣貈绵绵伖窵绵跣.args[0] == 3:
            貈跣绵芏跣芏跣芏伖芏芏窵伖跣跣窵绵 = 220667408445183
跣绵绵绵绵跣绵跣伖芏跣跣绵貈伖跣貈 = 0
while 跣绵绵绵绵跣绵跣伖芏跣跣绵貈伖跣貈 != 2:
    跣绵绵绵绵跣绵跣伖芏跣跣绵貈伖跣貈 += 1
    try:
        raise VELIMATIX(跣绵绵绵绵跣绵跣伖芏跣跣绵貈伖跣貈)
    except VELIMATIX as 窵绵伖窵貈貈貈窵芏貈跣跣跣貈绵芏绵:
        if 窵绵伖窵貈貈貈窵芏貈跣跣跣貈绵芏绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6143070)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6146760)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6143070)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6107198)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('158012046540')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0703416')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('239856168150')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0703416')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6143070)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6155023)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('222448')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6272831')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2972726')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6272857')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2972726')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272792)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272891)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272792)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272891)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272792)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6272893)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3584')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))()]))())
        if 窵绵伖窵貈貈貈窵芏貈跣跣跣貈绵芏绵.args[0] == 3:
            跣伖窵跣貈伖芏绵伖芏伖芏貈伖芏貈貈 = 69907547874655
貈貈芏貈窵伖貈窵跣伖窵绵伖芏跣跣貈 = 0
while 貈貈芏貈窵伖貈窵跣伖窵绵伖芏跣跣貈 != 2:
    貈貈芏貈窵伖貈窵跣伖窵绵伖芏跣跣貈 += 1
    try:
        raise VELIMATIX(貈貈芏貈窵伖貈窵跣伖窵绵伖芏跣跣貈)
    except VELIMATIX as 跣绵芏貈貈绵跣芏窵伖跣跣跣窵窵跣貈:
        if 跣绵芏貈貈绵跣芏窵伖跣跣跣窵窵跣貈.args[0] == 1:
            烇圼欧儋挸皓()['围芠譈絴夽鍬'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('336053796')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8616880')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('870293164')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1034011680')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8616764)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8616776)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('404987908')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8616764)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8616788)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('999544624')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4676168')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28573696')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('792')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('130')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('202752')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('108')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1320')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3840')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~41)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('525')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('999')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57671680')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('24641536')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1920')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('884736')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~54)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('56')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('368')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~49)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('180224')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1260')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1308')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50855936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1919')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('385024')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('794624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1534')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1365')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1326')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('397312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1236')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25856')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107520')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1090')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('282')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('672')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('618')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('264')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('48')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~41)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~44)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('966656')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1851392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('75')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('376832')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('728')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1261')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1404')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1365')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6336')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('582')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('696')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('630')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('901120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1495')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6720')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('618')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('103')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('135')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3178496')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1545')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('915')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1470')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('417792')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~54)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1469')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~48)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('624')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('64')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('48')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))())
        if 跣绵芏貈貈绵跣芏窵伖跣跣跣窵窵跣貈.args[0] == 3:
            芏伖窵伖芏貈跣芏芏伖伖芏伖跣伖芏窵 = 109335357275578
伖跣跣伖跣绵芏绵貈伖跣伖伖芏伖绵伖 = 0
while 伖跣跣伖跣绵芏绵貈伖跣伖伖芏伖绵伖 != 2:
    伖跣跣伖跣绵芏绵貈伖跣伖伖芏伖绵伖 += 1
    try:
        raise VELIMATIX(伖跣跣伖跣绵芏绵貈伖跣伖伖芏伖绵伖)
    except VELIMATIX as 貈跣貈跣貈貈貈伖绵绵貈伖窵芏芏貈貈:
        if 貈跣貈跣貈貈貈伖绵绵貈伖窵芏芏貈貈.args[0] == 3:
            芏芏绵伖貈窵跣芏绵芏窵伖伖跣伖窵窵 = 229015054174020
        if 貈跣貈跣貈貈貈伖绵绵貈伖窵芏芏貈貈.args[0] == 4:
            伖绵跣窵芏芏貈貈芏绵绵绵跣貈貈绵芏 = 200655396725078
        if 貈跣貈跣貈貈貈伖绵绵貈伖窵芏芏貈貈.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('380976')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('763840')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102410')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39476)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12592349184')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('16916152320')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1366631)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1366592)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366746')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366631')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366732')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366631')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1366631)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1366532)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366676')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1366631')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('792')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1703936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('368640')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('130')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('360')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1776')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3456')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('44')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))()]))())
貈伖芏窵貈绵芏窵窵貈芏绵芏跣跣芏绵 = 0
while 貈伖芏窵貈绵芏窵窵貈芏绵芏跣跣芏绵 != 2:
    貈伖芏窵貈绵芏窵窵貈芏绵芏跣跣芏绵 += 1
    try:
        raise VELIMATIX(貈伖芏窵貈绵芏窵窵貈芏绵芏跣跣芏绵)
    except VELIMATIX as 绵貈伖绵芏貈貈窵绵伖芏跣貈伖跣跣窵:
        if 绵貈伖绵芏貈貈窵绵伖芏跣貈伖跣跣窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107813761889')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7563583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3879028')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7563583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('16260268032')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~40660)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39733)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('17509376')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6090699)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6090732)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('383714037')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9960906')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6090748')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9960906')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('237537261')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9960906')")[::-1])))()]))())
        if 绵貈伖绵芏貈貈窵绵伖芏跣貈伖跣跣窵.args[0] == 3:
            跣芏绵跣伖伖绵窵跣芏绵芏跣跣貈窵貈 = 123282910895513
        if 绵貈伖绵芏貈貈窵绵伖芏跣貈伖跣跣窵.args[0] == 4:
            跣绵绵芏伖窵绵跣绵窵貈跣芏伖伖芏芏 = 196962337456363
芏芏貈芏伖跣伖貈貈绵窵绵芏芏貈芏芏 = 0
while 芏芏貈芏伖跣伖貈貈绵窵绵芏芏貈芏芏 != 2:
    芏芏貈芏伖跣伖貈貈绵窵绵芏芏貈芏芏 += 1
    try:
        raise VELIMATIX(芏芏貈芏伖跣伖貈貈绵窵绵芏芏貈芏芏)
    except VELIMATIX as 伖伖窵绵貈跣貈伖芏貈貈伖伖窵窵貈芏:
        if 伖伖窵绵貈跣貈伖芏貈貈伖伖窵窵貈芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6870602)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6835180)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6870602)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6837034)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4711552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25423')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('33244')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('284130')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5438095')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6508345')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('625376440')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6508345')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13238272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50688')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('405504')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('468')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('444')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14942208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1853')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))()]))())
        if 伖伖窵绵貈跣貈伖芏貈貈伖伖窵窵貈芏.args[0] == 3:
            伖貈芏芏窵芏窵芏伖貈貈绵绵伖芏貈跣 = 8648898418779
        if 伖伖窵绵貈跣貈伖芏貈貈伖伖窵窵貈芏.args[0] == 4:
            芏貈貈貈跣跣跣绵跣伖芏跣跣芏窵伖窵 = 128502593665205
绵绵芏芏跣窵窵伖伖芏貈跣窵跣窵绵跣 = 0
while 绵绵芏芏跣窵窵伖伖芏貈跣窵跣窵绵跣 != 2:
    绵绵芏芏跣窵窵伖伖芏貈跣窵跣窵绵跣 += 1
    try:
        raise VELIMATIX(绵绵芏芏跣窵窵伖伖芏貈跣窵跣窵绵跣)
    except VELIMATIX as 跣窵芏伖窵绵芏跣绵貈貈跣绵芏伖跣貈:
        if 跣窵芏伖窵绵芏跣绵貈貈跣绵芏伖跣貈.args[0] == 3:
            芏芏窵窵貈芏窵貈貈伖跣貈绵伖窵伖貈 = 156325604178503
        if 跣窵芏伖窵绵芏跣绵貈貈跣绵芏伖跣貈.args[0] == 1:
            烇圼欧儋挸皓()['坜孻悴郔啭庢'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('346804497')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8892457')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('578007495')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('978166530')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8892423)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8892515)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8892537')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8892534')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3242988')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13762560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~51)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))()]))())
芏绵貈貈窵窵绵窵貈跣窵绵芏绵芏貈貈 = 0
while 芏绵貈貈窵窵绵窵貈跣窵绵芏绵芏貈貈 != 2:
    芏绵貈貈窵窵绵窵貈跣窵绵芏绵芏貈貈 += 1
    try:
        raise VELIMATIX(芏绵貈貈窵窵绵窵貈跣窵绵芏绵芏貈貈)
    except VELIMATIX as 伖貈伖绵跣跣伖伖窵貈跣伖绵绵伖伖伖:
        if 伖貈伖绵跣跣伖伖窵貈跣伖绵绵伖伖伖.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3837568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('263242')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20098')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7001604096')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25202')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~21799)'))))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('247832052')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8664536')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6354785')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8664536')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('711722816')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8664536')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6354668)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6354571)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('103')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~47)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('202')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('101')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('29952')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('933888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1313')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1482')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('226')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('230')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4992')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))()]))())
伖伖绵窵绵伖芏跣窵跣伖跣伖跣伖伖芏 = 0
while 伖伖绵窵绵伖芏跣窵跣伖跣伖跣伖伖芏 != 2:
    伖伖绵窵绵伖芏跣窵跣伖跣伖跣伖伖芏 += 1
    try:
        raise VELIMATIX(伖伖绵窵绵伖芏跣窵跣伖跣伖跣伖伖芏)
    except VELIMATIX as 跣窵芏貈窵芏绵窵绵绵跣窵芏芏貈跣绵:
        if 跣窵芏貈窵芏绵窵绵绵跣窵芏芏貈跣绵.args[0] == 1:
            烇圼欧儋挸皓()['杗汅忢硾罧娟'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1220806')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7670221')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1220767)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1220782)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1220806')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7670221')")[::-1])))()]))())
伖芏窵伖窵伖绵芏貈芏伖伖貈貈窵芏绵 = 0
while 伖芏窵伖窵伖绵芏貈芏伖伖貈貈窵芏绵 != 2:
    伖芏窵伖窵伖绵芏貈芏伖伖貈貈窵芏绵 += 1
    try:
        raise VELIMATIX(伖芏窵伖窵伖绵芏貈芏伖伖貈貈窵芏绵)
    except VELIMATIX as 绵绵伖绵窵貈跣窵芏绵跣貈窵绵窵绵窵:
        if 绵绵伖绵窵貈跣窵芏绵跣貈窵绵窵绵窵.args[0] == 1:
            烇圼欧儋挸皓()['膋蔓施掊飮靬'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('990')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('816')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('348')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~46)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('315')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('348')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('159744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
        if 绵绵伖绵窵貈跣窵芏绵跣貈窵绵窵绵窵.args[0] == 3:
            伖跣伖窵跣窵窵貈窵窵貈伖伖貈窵芏跣 = 207039441313182
跣伖貈跣貈窵伖貈芏芏绵伖芏窵窵跣绵 = 0
while 跣伖貈跣貈窵伖貈芏芏绵伖芏窵窵跣绵 != 2:
    跣伖貈跣貈窵伖貈芏芏绵伖芏窵窵跣绵 += 1
    try:
        raise VELIMATIX(跣伖貈跣貈窵伖貈芏芏绵伖芏窵窵跣绵)
    except VELIMATIX as 芏绵跣貈芏窵跣貈芏芏貈跣跣貈跣绵绵:
        if 芏绵跣貈芏窵跣貈芏芏貈跣跣貈跣绵绵.args[0] == 1:
            烇圼欧儋挸皓()['眷炢铸逘嗷頪'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('199316247')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3760115')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5110788')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3760115')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('495735281')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3760115')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('446464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('909312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27525120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~123)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('440')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('10223616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
        if 芏绵跣貈芏窵跣貈芏芏貈跣跣貈跣绵绵.args[0] == 3:
            貈绵伖窵跣窵绵跣芏貈跣貈伖伖貈绵芏 = 152662420005089
跣跣窵芏貈伖跣貈绵芏貈窵窵芏跣绵窵 = 0
while 跣跣窵芏貈伖跣貈绵芏貈窵窵芏跣绵窵 != 2:
    跣跣窵芏貈伖跣貈绵芏貈窵窵芏跣绵窵 += 1
    try:
        raise VELIMATIX(跣跣窵芏貈伖跣貈绵芏貈窵窵芏跣绵窵)
    except VELIMATIX as 伖芏跣芏绵芏伖跣貈貈貈伖窵跣绵跣芏:
        if 伖芏跣芏绵芏伖跣貈貈貈伖窵跣绵跣芏.args[0] == 1:
            烇圼欧儋挸皓()['伿栞塤潰巇箚'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6474223)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6474184)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6474338')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3224746')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('653896523')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3224746')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6488064')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2949120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~118)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1856')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1622016')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1456')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1554')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1414')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5111808')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))())
跣伖绵貈貈貈貈跣伖绵窵伖貈跣貈跣窵 = 0
while 跣伖绵貈貈貈貈跣伖绵窵伖貈跣貈跣窵 != 2:
    跣伖绵貈貈貈貈跣伖绵窵伖貈跣貈跣窵 += 1
    try:
        raise VELIMATIX(跣伖绵貈貈貈貈跣伖绵窵伖貈跣貈跣窵)
    except VELIMATIX as 貈貈貈伖窵貈伖伖伖貈貈绵窵貈跣绵跣:
        if 貈貈貈伖窵貈伖伖伖貈貈绵窵貈跣绵跣.args[0] == 1:
            烇圼欧儋挸皓()['绺煦蕽傞蹣佟'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8797563')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4257978')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8797634')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4257978')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8797621')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4257978')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8797524)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8797474)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8797524)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8797501)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13184')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('679')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~115)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('707')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~32)'))))()]))())
        if 貈貈貈伖窵貈伖伖伖貈貈绵窵貈跣绵跣.args[0] == 3:
            绵跣貈芏芏芏窵芏绵貈貈窵伖窵芏绵窵 = 251994414524816
        if 貈貈貈伖窵貈伖伖伖貈貈绵窵貈跣绵跣.args[0] == 4:
            绵伖芏绵芏绵芏绵伖伖绵跣跣绵芏芏伖 = 69205838467797
貈绵伖貈貈窵伖跣貈貈貈貈跣伖芏貈伖 = 0
while 貈绵伖貈貈窵伖跣貈貈貈貈跣伖芏貈伖 != 2:
    貈绵伖貈貈窵伖跣貈貈貈貈跣伖芏貈伖 += 1
    try:
        raise VELIMATIX(貈绵伖貈貈窵伖跣貈貈貈貈跣伖芏貈伖)
    except VELIMATIX as 貈绵窵跣芏伖伖芏芏跣貈跣跣伖貈窵绵:
        if 貈绵窵跣芏伖伖芏芏跣貈跣跣伖貈窵绵.args[0] == 1:
            烇圼欧儋挸皓()['櫲灲猴圁霠鹼'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4786353')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4136874')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('550426110')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4136874')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4786314)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4786415)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('473845086')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4136874')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('108')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('105')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3407872')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('180')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('200')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('202')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
绵跣窵貈绵跣跣绵跣绵跣伖伖貈芏貈貈 = 0
while 绵跣窵貈绵跣跣绵跣绵跣伖伖貈芏貈貈 != 2:
    绵跣窵貈绵跣跣绵跣绵跣伖伖貈芏貈貈 += 1
    try:
        raise VELIMATIX(绵跣窵貈绵跣跣绵跣绵跣伖伖貈芏貈貈)
    except VELIMATIX as 芏伖窵窵绵绵跣芏貈绵伖芏绵绵跣貈芏:
        if 芏伖窵窵绵绵跣芏貈绵伖芏绵绵跣貈芏.args[0] == 1:
            烇圼欧儋挸皓()['挾雌湍眑詭彵'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1464569)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1464542)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1464569)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1464477)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1464680')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9654641')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('43')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))()]))())
        if 芏伖窵窵绵绵跣芏貈绵伖芏绵绵跣貈芏.args[0] == 3:
            芏跣伖绵芏跣窵貈芏绵窵貈跣窵芏窵芏 = 236674141272784
        if 芏伖窵窵绵绵跣芏貈绵伖芏绵绵跣貈芏.args[0] == 4:
            跣芏伖貈窵伖貈貈芏窵跣芏芏跣窵跣跣 = 29291206969887
        if 芏伖窵窵绵绵跣芏貈绵伖芏绵绵跣貈芏.args[0] == 5:
            伖貈窵跣窵伖窵绵芏芏芏绵貈窵跣伖绵 = 128831664162214
伖跣窵伖绵窵芏貈窵绵绵芏绵芏跣跣窵 = 0
while 伖跣窵伖绵窵芏貈窵绵绵芏绵芏跣跣窵 != 2:
    伖跣窵伖绵窵芏貈窵绵绵芏绵芏跣跣窵 += 1
    try:
        raise VELIMATIX(伖跣窵伖绵窵芏貈窵绵绵芏绵芏跣跣窵)
    except VELIMATIX as 绵芏跣伖窵伖跣貈伖跣窵跣窵跣貈窵跣:
        if 绵芏跣伖窵伖跣貈伖跣窵跣窵跣貈窵跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('215285760')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~37451)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38487)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31498')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28574')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('523224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('319309224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6147818')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25427968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1782')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14680064')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13824')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7208960')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~119)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1872')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('198656')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('404')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
        if 绵芏跣伖窵伖跣貈伖跣窵跣窵跣貈窵跣.args[0] == 3:
            绵貈绵窵绵伖绵窵芏绵伖窵貈跣芏芏绵 = 210972097534224
窵绵貈貈伖芏窵芏貈貈芏绵貈芏貈伖芏 = 0
while 窵绵貈貈伖芏窵芏貈貈芏绵貈芏貈伖芏 != 2:
    窵绵貈貈伖芏窵芏貈貈芏绵貈芏貈伖芏 += 1
    try:
        raise VELIMATIX(窵绵貈貈伖芏窵芏貈貈芏绵貈芏貈伖芏)
    except VELIMATIX as 伖跣芏窵跣绵伖跣绵跣芏伖绵跣貈貈绵:
        if 伖跣芏窵跣绵伖跣绵跣芏伖绵跣貈貈绵.args[0] == 1:
            烇圼欧儋挸皓()['耪袈吋喚牷疊'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2090864')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5280902')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2090825)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2090815)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2090930')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5280902')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2090825)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2090852)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2090911')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5280902')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23068672')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('137')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~122)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1121')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2147')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('80')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('753664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~55)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('88')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3342336')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('129')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('737280')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('84')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~92)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('226')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('480')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('560')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1140')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('69')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~123)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('480')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('753664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112640')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('56320')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('54')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('170')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~63)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('904')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~62)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~51)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('138')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52953088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1121')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1159')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('768')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6029312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13893632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('702')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
        if 伖跣芏窵跣绵伖跣绵跣芏伖绵跣貈貈绵.args[0] == 3:
            伖伖窵窵窵窵貈伖窵窵伖跣绵伖跣伖绵 = 232114447035381
芏伖芏芏芏貈窵窵跣跣芏伖窵芏跣跣绵 = 0
while 芏伖芏芏芏貈窵窵跣跣芏伖窵芏跣跣绵 != 2:
    芏伖芏芏芏貈窵窵跣跣芏伖窵芏跣跣绵 += 1
    try:
        raise VELIMATIX(芏伖芏芏芏貈窵窵跣跣芏伖窵芏跣跣绵)
    except VELIMATIX as 窵跣芏芏窵绵芏芏伖跣窵伖绵窵窵窵窵:
        if 窵跣芏芏窵绵芏芏伖跣窵伖绵窵窵窵窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('197132566240')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0409006')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('182158038560')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0409006')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6049958')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0409006')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('140497364240')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0409006')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('165705287040')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0409006')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6009040)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6016339)'))))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9222281')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2422229')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('268')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('222')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1776')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('808')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))()]))())
        if 窵跣芏芏窵绵芏芏伖跣窵伖绵窵窵窵窵.args[0] == 3:
            绵伖窵绵窵跣伖窵窵跣貈绵伖窵跣伖伖 = 185299177853829
        if 窵跣芏芏窵绵芏芏伖跣窵伖绵窵窵窵窵.args[0] == 4:
            跣绵绵貈伖芏伖绵芏跣伖伖貈窵伖绵伖 = 230089509080653
        if 窵跣芏芏窵绵芏芏伖跣窵伖绵窵窵窵窵.args[0] == 5:
            貈貈窵芏绵伖貈芏貈窵伖跣窵跣芏绵跣 = 211385285746875
绵芏伖伖绵跣绵窵伖貈伖窵貈窵貈伖伖 = 0
while 绵芏伖伖绵跣绵窵伖貈伖窵貈窵貈伖伖 != 2:
    绵芏伖伖绵跣绵窵伖貈伖窵貈窵貈伖伖 += 1
    try:
        raise VELIMATIX(绵芏伖伖绵跣绵窵伖貈伖窵貈窵貈伖伖)
    except VELIMATIX as 跣跣芏芏跣绵貈窵绵伖窵芏窵貈绵伖芏:
        if 跣跣芏芏跣绵貈窵绵伖窵芏窵貈绵伖芏.args[0] == 1:
            烇圼欧儋挸皓()['礜桹霐嘒帰邬'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4923690)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4923661)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~56)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('94')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('94')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('218')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7864320')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1664')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~62)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('736')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1568')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('227328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~44)'))))()]))())
        if 跣跣芏芏跣绵貈窵绵伖窵芏窵貈绵伖芏.args[0] == 3:
            芏貈貈窵跣芏绵窵窵跣芏跣窵芏窵窵貈 = 256264808397743
        if 跣跣芏芏跣绵貈窵绵伖窵芏窵貈绵伖芏.args[0] == 4:
            窵跣貈伖芏绵伖伖跣貈绵窵芏伖貈绵芏 = 99878036154206
貈貈绵芏伖貈芏窵窵窵跣跣绵伖貈绵绵 = 0
while 貈貈绵芏伖貈芏窵窵窵跣跣绵伖貈绵绵 != 2:
    貈貈绵芏伖貈芏窵窵窵跣跣绵伖貈绵绵 += 1
    try:
        raise VELIMATIX(貈貈绵芏伖貈芏窵窵窵跣跣绵伖貈绵绵)
    except VELIMATIX as 貈跣伖窵绵窵窵芏跣跣窵貈绵貈伖窵绵:
        if 貈跣伖窵绵窵窵芏跣跣窵貈绵貈伖窵绵.args[0] == 3:
            绵伖跣跣伖跣跣绵绵伖跣绵芏绵芏窵伖 = 89303750167157
        if 貈跣伖窵绵窵窵芏跣跣窵貈绵貈伖窵绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('155564754597')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1706916')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6196071)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6218653)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('152262248754')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1706916')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('199548928')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28399')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20113784832')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9500674')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0460059')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1092573600')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0460059')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9500741')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0460059')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3712')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~81)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('545')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('555')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('29952')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('928')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('320')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('835584')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1521')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7208960')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1856')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55050240')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~59)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7872')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('38')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('666')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25344')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('928')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13762560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1654784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8388608')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~47)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~50)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('94')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27648')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('888')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('880')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('312')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('256')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('133')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('384')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('67')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('42')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))()]))())
貈芏绵跣芏跣伖跣绵伖芏跣绵绵芏绵窵 = 0
while 貈芏绵跣芏跣伖跣绵伖芏跣绵绵芏绵窵 != 2:
    貈芏绵跣芏跣伖跣绵伖芏跣绵绵芏绵窵 += 1
    try:
        raise VELIMATIX(貈芏绵跣芏跣伖跣绵伖芏跣绵绵芏绵窵)
    except VELIMATIX as 绵貈貈貈跣貈窵绵跣跣伖绵绵绵窵芏跣:
        if 绵貈貈貈跣貈窵绵跣跣伖绵绵绵窵芏跣.args[0] == 1:
            烇圼欧儋挸皓()['薋蔓烃誗琤吴'[::-1]] = not 糤丗推褮寏籩(籄椟炧閆斯蓺(嶺壚什羺瘁迒))
貈伖窵芏貈貈貈窵绵伖芏芏伖窵貈绵芏 = 0
while 貈伖窵芏貈貈貈窵绵伖芏芏伖窵貈绵芏 != 2:
    貈伖窵芏貈貈貈窵绵伖芏芏伖窵貈绵芏 += 1
    try:
        raise VELIMATIX(貈伖窵芏貈貈貈窵绵伖芏芏伖窵貈绵芏)
    except VELIMATIX as 跣绵绵芏伖芏伖窵窵跣跣貈芏绵绵跣跣:
        if 跣绵绵芏伖芏伖窵窵跣跣貈芏绵绵跣跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9925912)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9904008)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1628800')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('224238')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7969701888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('99968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8956674048')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('339383733')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7412078')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2366983984')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7412078')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8702406')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7412078')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8702147)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8702125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8702250')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7412078')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8702179')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7412078')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8702147)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8702107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('468')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15690')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
        if 跣绵绵芏伖芏伖窵窵跣跣貈芏绵绵跣跣.args[0] == 3:
            貈伖伖跣伖绵貈绵貈窵窵窵窵跣窵伖窵 = 267803207772289
        if 跣绵绵芏伖芏伖窵窵跣跣貈芏绵绵跣跣.args[0] == 4:
            芏窵跣貈伖窵貈貈窵貈貈窵绵貈绵窵跣 = 114172908280041
        if 跣绵绵芏伖芏伖窵窵跣跣貈芏绵绵跣跣.args[0] == 5:
            伖跣芏绵绵伖芏窵跣伖芏芏伖貈伖跣伖 = 232217507353970
窵伖窵貈跣伖跣绵绵窵窵貈伖貈伖伖芏 = 0
while 窵伖窵貈跣伖跣绵绵窵窵貈伖貈伖伖芏 != 2:
    窵伖窵貈跣伖跣绵绵窵窵貈伖貈伖伖芏 += 1
    try:
        raise VELIMATIX(窵伖窵貈跣伖跣绵绵窵窵貈伖貈伖伖芏)
    except VELIMATIX as 伖绵窵貈芏伖芏绵芏绵貈跣芏跣伖跣伖:
        if 伖绵窵貈芏伖芏绵芏绵貈跣芏跣伖跣伖.args[0] == 3:
            跣跣貈貈跣绵跣绵伖芏绵芏绵绵窵伖绵 = 252531632365822
        if 伖绵窵貈芏伖芏绵芏绵貈跣芏跣伖跣伖.args[0] == 4:
            跣芏绵窵窵绵伖绵窵芏窵跣跣貈窵貈芏 = 152523887519152
        if 伖绵窵貈芏伖芏绵芏绵貈跣芏跣伖跣伖.args[0] == 1:
            烇圼欧儋挸皓()['闙鎂禮堆师屰'[::-1]] = 糤丗推褮寏籩(~嶺壚什羺瘁迒 or (黭椭瓛佖雹闑 and 嶺壚什羺瘁迒))
貈伖绵跣貈芏貈绵伖貈窵跣跣貈伖貈芏 = 0
while 貈伖绵跣貈芏貈绵伖貈窵跣跣貈伖貈芏 != 2:
    貈伖绵跣貈芏貈绵伖貈窵跣跣貈伖貈芏 += 1
    try:
        raise VELIMATIX(貈伖绵跣貈芏貈绵伖貈窵跣跣貈伖貈芏)
    except VELIMATIX as 芏芏伖貈跣貈绵绵芏绵貈芏绵窵跣芏窵:
        if 芏芏伖貈跣貈绵绵芏绵貈芏绵窵跣芏窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8558477312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('420318')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~22213)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36164)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('19761664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35534)'))))()]))()] = not 糤丗推褮寏籩(籄椟炧閆斯蓺(嶺壚什羺瘁迒))
伖貈跣芏芏窵窵窵伖貈貈绵伖貈窵芏绵 = 0
while 伖貈跣芏芏窵窵窵伖貈貈绵伖貈窵芏绵 != 2:
    伖貈跣芏芏窵窵窵伖貈貈绵伖貈窵芏绵 += 1
    try:
        raise VELIMATIX(伖貈跣芏芏窵窵窵伖貈貈绵伖貈窵芏绵)
    except VELIMATIX as 伖绵窵芏貈貈伖貈窵伖跣跣芏窵绵貈貈:
        if 伖绵窵芏貈貈伖貈窵伖跣跣芏窵绵貈貈.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('155312587832')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8141554')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4574761')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8141554')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4575578')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8141554')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('139164156768')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8141554')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104159200930')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8141554')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('493273088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5687518)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5687545)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5687622')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8157865')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3801088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('24117248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1843')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('133')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2185')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~118)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))()]))())
        if 伖绵窵芏貈貈伖貈窵伖跣跣芏窵绵貈貈.args[0] == 3:
            貈窵绵跣窵貈芏貈伖窵跣窵貈绵芏芏芏 = 276975894705530
        if 伖绵窵芏貈貈伖貈窵伖跣跣芏窵绵貈貈.args[0] == 4:
            跣貈绵貈芏绵跣貈绵伖伖窵貈芏伖貈绵 = 189039657688856
        if 伖绵窵芏貈貈伖貈窵伖跣跣芏窵绵貈貈.args[0] == 5:
            伖跣貈窵窵绵窵伖芏伖窵芏貈貈伖绵窵 = 35354166162853
伖芏跣跣绵绵窵绵窵伖伖绵伖芏伖绵伖 = 0
while 伖芏跣跣绵绵窵绵窵伖伖绵伖芏伖绵伖 != 2:
    伖芏跣跣绵绵窵绵窵伖伖绵伖芏伖绵伖 += 1
    try:
        raise VELIMATIX(伖芏跣跣绵绵窵绵窵伖伖绵伖芏伖绵伖)
    except VELIMATIX as 芏貈伖芏芏伖貈窵芏绵绵伖绵跣貈窵芏:
        if 芏貈伖芏芏伖貈窵芏绵绵伖绵跣貈窵芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1137285)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1116129)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5785600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35501)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~26598)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4549632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21274')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5064608)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5064583)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5064712')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8064605')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5064608)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5064597)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('10223616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
        if 芏貈伖芏芏伖貈窵芏绵绵伖绵跣貈窵芏.args[0] == 3:
            绵芏伖窵貈芏芏芏伖伖貈绵绵绵芏伖伖 = 248557945355953
        if 芏貈伖芏芏伖貈窵芏绵绵伖绵跣貈窵芏.args[0] == 4:
            伖芏窵绵伖跣伖貈窵窵貈绵伖貈芏芏貈 = 156506440850476
        if 芏貈伖芏芏伖貈窵芏绵绵伖绵跣貈窵芏.args[0] == 5:
            跣貈貈伖伖窵跣貈跣伖跣窵伖跣绵跣貈 = 99944929821055
伖貈绵绵窵窵绵跣伖跣芏伖跣跣窵绵芏 = 0
while 伖貈绵绵窵窵绵跣伖跣芏伖跣跣窵绵芏 != 2:
    伖貈绵绵窵窵绵跣伖跣芏伖跣跣窵绵芏 += 1
    try:
        raise VELIMATIX(伖貈绵绵窵窵绵跣伖跣芏伖跣跣窵绵芏)
    except VELIMATIX as 芏跣芏跣绵窵芏貈芏窵跣貈芏貈貈貈貈:
        if 芏跣芏跣绵窵芏貈芏窵跣貈芏貈貈貈貈.args[0] == 1:
            烇圼欧儋挸皓()['媳皡锋蠛鍼漟'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3387927')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8887833')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('348952464')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8887833')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3387888)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3387778)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('328625136')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8887833')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('630')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('696')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23592960')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('135')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('139')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('159744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
        if 芏跣芏跣绵窵芏貈芏窵跣貈芏貈貈貈貈.args[0] == 3:
            绵绵窵跣芏貈绵貈貈窵貈跣貈芏芏跣伖 = 185594274902737
芏窵跣伖伖窵窵伖貈跣绵伖貈绵貈跣绵 = 0
while 芏窵跣伖伖窵窵伖貈跣绵伖貈绵貈跣绵 != 2:
    芏窵跣伖伖窵窵伖貈跣绵伖貈绵貈跣绵 += 1
    try:
        raise VELIMATIX(芏窵跣伖伖窵窵伖貈跣绵伖貈绵貈跣绵)
    except VELIMATIX as 跣窵跣绵芏跣绵芏貈芏跣伖绵芏貈窵貈:
        if 跣窵跣绵芏跣绵芏貈芏跣伖绵芏貈窵貈.args[0] == 3:
            绵跣绵跣跣伖绵跣跣芏绵芏伖芏窵绵貈 = 51446398005093
        if 跣窵跣绵芏跣绵芏貈芏跣伖绵芏貈窵貈.args[0] == 4:
            跣貈貈貈窵绵伖芏芏芏芏貈跣貈貈伖绵 = 167075141324439
        if 跣窵跣绵芏跣绵芏貈芏跣伖绵芏貈窵貈.args[0] == 5:
            伖窵貈芏窵绵伖窵跣芏窵跣跣窵跣跣伖 = 155342983816300
        if 跣窵跣绵芏跣绵芏貈芏跣伖绵芏貈窵貈.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4748522)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4718699)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4778629')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2258474')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25407488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('300290')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('227130')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34771)'))))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1308582')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3458031')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1308667')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3458031')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51033177')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3458031')")[::-1])))()]))())
绵伖绵伖窵跣绵芏貈芏跣芏伖伖貈绵伖 = 0
while 绵伖绵伖窵跣绵芏貈芏跣芏伖伖貈绵伖 != 2:
    绵伖绵伖窵跣绵芏貈芏跣芏伖伖貈绵伖 += 1
    try:
        raise VELIMATIX(绵伖绵伖窵跣绵芏貈芏跣芏伖伖貈绵伖)
    except VELIMATIX as 绵绵绵伖伖伖跣跣绵貈窵貈窵跣芏窵貈:
        if 绵绵绵伖伖伖跣跣绵貈窵貈窵跣芏窵貈.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13769728')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~40484)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3495952384')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39675')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8478523392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('546390')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))()] = 援腷葠典爕歡(')5_8_1_3_0_6_7_7_1_4-(+5_8_1_3_0_6_7_7_1_4'[::-1])
        if 绵绵绵伖伖伖跣跣绵貈窵貈窵跣芏窵貈.args[0] == 3:
            貈芏窵绵绵跣跣貈貈绵伖貈绵窵芏跣跣 = 245618876174674
        if 绵绵绵伖伖伖跣跣绵貈窵貈窵跣芏窵貈.args[0] == 4:
            伖貈窵伖窵貈芏跣绵窵伖伖绵窵伖芏绵 = 154259846156684
        if 绵绵绵伖伖伖跣跣绵貈窵貈窵跣芏窵貈.args[0] == 5:
            伖跣貈貈貈伖窵窵伖绵芏绵伖跣貈绵窵 = 213028128307117
窵伖跣貈窵貈芏伖貈貈窵窵芏貈窵芏跣 = 0
while 窵伖跣貈窵貈芏伖貈貈窵窵芏貈窵芏跣 != 2:
    窵伖跣貈窵貈芏伖貈貈窵窵芏貈窵芏跣 += 1
    try:
        raise VELIMATIX(窵伖跣貈窵貈芏伖貈貈窵窵芏貈窵芏跣)
    except VELIMATIX as 绵貈貈跣绵跣跣跣伖芏跣芏貈貈窵伖绵:
        if 绵貈貈跣绵跣跣跣伖芏跣芏貈貈窵伖绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8666768')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2564368')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1241920')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('145525')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('33968')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('179000')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('29831')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('24576')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('405')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('405')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('441')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('167936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
窵窵窵伖跣貈跣窵芏貈跣跣伖跣貈伖芏 = 0
while 窵窵窵伖跣貈跣窵芏貈跣跣伖跣貈伖芏 != 2:
    窵窵窵伖跣貈跣窵芏貈跣跣伖跣貈伖芏 += 1
    try:
        raise VELIMATIX(窵窵窵伖跣貈跣窵芏貈跣跣伖跣貈伖芏)
    except VELIMATIX as 芏貈貈伖跣窵跣窵芏芏窵貈芏绵绵貈貈:
        if 芏貈貈伖跣窵跣窵芏芏窵貈芏绵绵貈貈.args[0] == 1:
            烇圼欧儋挸皓()['芆驭甝冋鐔埐'[::-1]] = 援腷葠典爕歡(')8_6_9_5_2_3_2_8_4_1-(+9_6_9_5_2_3_2_8_4_1'[::-1])
        if 芏貈貈伖跣窵跣窵芏芏窵貈芏绵绵貈貈.args[0] == 3:
            窵绵窵伖绵貈窵绵貈伖窵貈绵绵芏芏跣 = 64889125395453
        if 芏貈貈伖跣窵跣窵芏芏窵貈芏绵绵貈貈.args[0] == 4:
            窵伖貈绵貈跣貈窵貈芏跣绵绵绵伖跣绵 = 7861449522450
        if 芏貈貈伖跣窵跣窵芏芏窵貈芏绵绵貈貈.args[0] == 5:
            跣跣芏窵绵貈芏绵绵跣貈芏芏芏窵貈绵 = 105530431136362
貈窵跣芏绵窵伖貈芏伖跣芏芏伖跣跣窵 = 0
while 貈窵跣芏绵窵伖貈芏伖跣芏芏伖跣跣窵 != 2:
    貈窵跣芏绵窵伖貈芏伖跣芏芏伖跣跣窵 += 1
    try:
        raise VELIMATIX(貈窵跣芏绵窵伖貈芏伖跣芏芏伖跣跣窵)
    except VELIMATIX as 窵伖跣跣跣跣绵伖貈跣窵芏跣芏伖芏绵:
        if 窵伖跣跣跣跣绵伖貈跣窵芏跣芏伖芏绵.args[0] == 3:
            窵芏芏芏貈绵伖绵绵貈貈绵貈貈伖跣伖 = 159271227365692
        if 窵伖跣跣跣跣绵伖貈跣窵芏跣芏伖芏绵.args[0] == 1:
            烇圼欧儋挸皓()['晷糪閲橌蜓厥'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('319488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~70)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7995392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('56320')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('412')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('472')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('218')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1028259840')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('495616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
芏伖貈跣芏窵窵伖窵绵窵绵窵窵窵绵伖 = 0
while 芏伖貈跣芏窵窵伖窵绵窵绵窵窵窵绵伖 != 2:
    芏伖貈跣芏窵窵伖窵绵窵绵窵窵窵绵伖 += 1
    try:
        raise VELIMATIX(芏伖貈跣芏窵窵伖窵绵窵绵窵窵窵绵伖)
    except VELIMATIX as 窵绵绵貈芏跣跣伖跣窵芏跣芏芏伖跣绵:
        if 窵绵绵貈芏跣跣伖跣窵芏跣芏芏伖跣绵.args[0] == 3:
            跣窵绵芏伖跣跣绵窵窵跣绵跣绵窵貈跣 = 205405731339274
        if 窵绵绵貈芏跣跣伖跣窵芏跣芏芏伖跣绵.args[0] == 4:
            貈绵芏貈貈芏貈绵跣伖绵伖窵窵貈芏芏 = 216684833490569
        if 窵绵绵貈芏跣跣伖跣窵芏跣芏芏伖跣绵.args[0] == 5:
            芏绵貈芏伖窵芏貈窵貈貈窵窵跣伖伖跣 = 238629363361861
        if 窵绵绵貈芏跣跣伖跣窵芏跣芏芏伖跣绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1489664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('220584')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38024)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4526440448')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('473484')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~31966)'))))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('76')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127926272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14417920')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1751')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('544')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1972')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('253')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~49)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('133')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6815744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7861)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('46')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))()]))())
貈窵伖跣伖伖绵芏绵伖貈跣窵芏窵芏窵 = 0
while 貈窵伖跣伖伖绵芏绵伖貈跣窵芏窵芏窵 != 2:
    貈窵伖跣伖伖绵芏绵伖貈跣窵芏窵芏窵 += 1
    try:
        raise VELIMATIX(貈窵伖跣伖伖绵芏绵伖貈跣窵芏窵芏窵)
    except VELIMATIX as 貈窵绵貈貈跣跣窵伖窵窵窵绵窵跣芏跣:
        if 貈窵绵貈貈跣跣窵伖窵窵窵绵窵跣芏跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6744965120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~26693)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34290')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('33891')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('229544')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('73902')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1636037)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1636066)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1636112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7306361')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('416')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('488')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('220')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52736')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8192')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7424')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~234)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('192')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47070')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('234')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))()]))())
绵芏窵绵芏跣绵绵窵跣貈貈伖伖貈跣绵 = 0
while 绵芏窵绵芏跣绵绵窵跣貈貈伖伖貈跣绵 != 2:
    绵芏窵绵芏跣绵绵窵跣貈貈伖伖貈跣绵 += 1
    try:
        raise VELIMATIX(绵芏窵绵芏跣绵绵窵跣貈貈伖伖貈跣绵)
    except VELIMATIX as 貈绵跣跣绵跣窵绵绵伖伖貈窵芏芏芏窵:
        if 貈绵跣跣绵跣窵绵绵伖伖貈窵芏芏芏窵.args[0] == 3:
            跣跣跣芏窵伖芏窵伖貈跣貈貈伖伖伖绵 = 231164067971014
        if 貈绵跣跣绵跣窵绵绵伖伖貈窵芏芏芏窵.args[0] == 4:
            芏貈芏窵貈窵窵貈貈芏窵伖窵绵伖伖芏 = 145932571511714
        if 貈绵跣跣绵跣窵绵绵伖伖貈窵芏芏芏窵.args[0] == 5:
            貈貈窵貈伖跣绵绵伖芏芏绵伖伖窵跣绵 = 166529834098264
        if 貈绵跣跣绵跣窵绵绵伖伖貈窵芏芏芏窵.args[0] == 1:
            烇圼欧儋挸皓()['墉韩窗痱浠溸'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5414771')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2374145')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5414797')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2374145')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414732)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414703)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414732)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414703)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414732)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5414697)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1835008')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('475136')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('468')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
跣伖芏跣芏伖貈芏跣跣跣貈窵窵貈绵绵 = 0
while 跣伖芏跣芏伖貈芏跣跣跣貈窵窵貈绵绵 != 2:
    跣伖芏跣芏伖貈芏跣跣跣貈窵窵貈绵绵 += 1
    try:
        raise VELIMATIX(跣伖芏跣芏伖貈芏跣跣跣貈窵窵貈绵绵)
    except VELIMATIX as 跣伖窵绵绵貈芏貈绵伖貈貈跣窵绵绵绵:
        if 跣伖窵绵绵貈芏貈绵伖貈貈跣窵绵绵绵.args[0] == 3:
            伖窵窵芏芏伖貈貈芏绵伖窵芏貈跣窵绵 = 110732355499467
        if 跣伖窵绵绵貈芏貈绵伖貈貈跣窵绵绵绵.args[0] == 4:
            貈绵伖貈貈跣跣跣跣绵伖绵芏跣跣貈绵 = 184003147259945
        if 跣伖窵绵绵貈芏貈绵伖貈貈跣窵绵绵绵.args[0] == 5:
            芏跣绵绵跣绵窵跣貈窵窵貈伖伖貈芏伖 = 52386161378309
        if 跣伖窵绵绵貈芏貈绵伖貈貈跣窵绵绵绵.args[0] == 1:
            烇圼欧儋挸皓()['鿒箉駃芥筊袹'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3854331)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3854300)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('447102396')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1334583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3854432')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1334583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('245760')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('26624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('864')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('352')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('388')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('198')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112640')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~37)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1200')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7424')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('648')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~45)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62914560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2052')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('836')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2052')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1680')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('396')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('99')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('222')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3080192')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1920')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('75')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('129')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('77')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('768')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~62)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('912')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~60)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('606')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('282')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12713984')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2006')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1734')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5767168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('446464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~109)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1212')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~123)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('528')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('218')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('98')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('413696')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('564')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1164')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3670016')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1344')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('235')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~62)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('305')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~53)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('230')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('280')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('220')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6356992')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28672')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('432')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('101')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('430080')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58195968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2090')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('893')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('134')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25856')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('800')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('737280')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('776')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('330')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('241664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~54)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1078')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~56)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30932992')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1998848')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~63)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('690')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))()]))())
伖跣跣伖芏貈芏伖貈跣貈伖跣跣伖芏窵 = 0
while 伖跣跣伖芏貈芏伖貈跣貈伖跣跣伖芏窵 != 2:
    伖跣跣伖芏貈芏伖貈跣貈伖跣跣伖芏窵 += 1
    try:
        raise VELIMATIX(伖跣跣伖芏貈芏伖貈跣貈伖跣跣伖芏窵)
    except VELIMATIX as 芏绵绵绵绵绵貈绵伖貈绵窵跣芏窵绵芏:
        if 芏绵绵绵绵绵貈绵伖貈绵窵跣芏窵绵芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3110089')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6680703')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3092516')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6680703')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3070866)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3055938)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118381884300')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6680703')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('67826217342')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6680703')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232072')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7818047)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7818008)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7818047)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7818108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('867803217')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7408187')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('901120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3712')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3309568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3604480')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('237568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('924')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('429')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))()]))())
绵跣窵绵貈伖伖窵伖窵伖伖芏貈伖伖貈 = 0
while 绵跣窵绵貈伖伖窵伖窵伖伖芏貈伖伖貈 != 2:
    绵跣窵绵貈伖伖窵伖窵伖伖芏貈伖伖貈 += 1
    try:
        raise VELIMATIX(绵跣窵绵貈伖伖窵伖窵伖伖芏貈伖伖貈)
    except VELIMATIX as 芏绵绵跣伖绵窵貈窵伖貈貈窵貈跣窵伖:
        if 芏绵绵跣伖绵窵貈窵伖貈貈窵貈跣窵伖.args[0] == 1:
            烇圼欧儋挸皓()['淅牣鏜罣妇繦'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5407561)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5407598)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('696')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('666')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~41)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('714')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('315')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11796480')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('135')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2052')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1944')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1998')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13238272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1700')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('663')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))())
貈绵伖绵窵伖芏芏窵跣跣绵窵伖貈跣跣 = 0
while 貈绵伖绵窵伖芏芏窵跣跣绵窵伖貈跣跣 != 2:
    貈绵伖绵窵伖芏芏窵跣跣绵窵伖貈跣跣 += 1
    try:
        raise VELIMATIX(貈绵伖绵窵伖芏芏窵跣跣绵窵伖貈跣跣)
    except VELIMATIX as 貈芏窵窵窵伖绵芏绵跣芏貈伖伖芏绵绵:
        if 貈芏窵窵窵伖绵芏绵跣芏貈伖伖芏绵绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7948530')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8587297')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7958711')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8587297')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7927858)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7893514)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7927858)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7908879)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('199726526594')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8587297')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4070572032')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2931271')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2321392')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('811008')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1352')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1313')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30408704')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1824')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('444')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
窵绵貈绵伖窵貈貈伖伖窵芏伖芏绵窵貈 = 0
while 窵绵貈绵伖窵貈貈伖伖窵芏伖芏绵窵貈 != 2:
    窵绵貈绵伖窵貈貈伖伖窵芏伖芏绵窵貈 += 1
    try:
        raise VELIMATIX(窵绵貈绵伖窵貈貈伖伖窵芏伖芏绵窵貈)
    except VELIMATIX as 貈窵芏伖貈窵绵伖伖貈芏芏跣芏窵伖绵:
        if 貈窵芏伖貈窵绵伖伖貈芏芏跣芏窵伖绵.args[0] == 1:
            烇圼欧儋挸皓()['稧繺刢碜点瀌'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6848135')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6908486')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6848205')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6908486')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('397312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1440')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1236')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1212')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('73')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('786432')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('546')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))()]))())
        if 貈窵芏伖貈窵绵伖伖貈芏芏跣芏窵伖绵.args[0] == 3:
            跣跣窵跣窵窵跣貈跣绵窵伖伖伖窵绵窵 = 92940280247974
芏窵绵跣伖跣芏芏伖芏绵跣芏貈窵芏伖 = 0
while 芏窵绵跣伖跣芏芏伖芏绵跣芏貈窵芏伖 != 2:
    芏窵绵跣伖跣芏芏伖芏绵跣芏貈窵芏伖 += 1
    try:
        raise VELIMATIX(芏窵绵跣伖跣芏芏伖芏绵跣芏貈窵芏伖)
    except VELIMATIX as 芏跣跣窵伖绵芏窵伖跣绵芏伖伖貈貈窵:
        if 芏跣跣窵伖绵芏窵伖跣绵芏伖伖貈貈窵.args[0] == 1:
            烇圼欧儋挸皓()['菫攢旈娢濶髎'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1887406)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1887369)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('217051690')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6047881')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1887507')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6047881')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51904512')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2949120')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~115)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('720')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('133')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1744')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('401408')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1212')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))()]))())
        if 芏跣跣窵伖绵芏窵伖跣绵芏伖伖貈貈窵.args[0] == 3:
            窵窵跣伖窵跣芏貈跣貈貈窵窵跣窵伖窵 = 216453320480829
        if 芏跣跣窵伖绵芏窵伖跣绵芏伖伖貈貈窵.args[0] == 4:
            窵跣貈窵伖绵跣芏绵伖芏跣绵貈伖跣绵 = 166456840766033
绵绵跣跣貈芏貈芏芏貈芏貈芏绵貈貈芏 = 0
while 绵绵跣跣貈芏貈芏芏貈芏貈芏绵貈貈芏 != 2:
    绵绵跣跣貈芏貈芏芏貈芏貈芏绵貈貈芏 += 1
    try:
        raise VELIMATIX(绵绵跣跣貈芏貈芏芏貈芏貈芏绵貈貈芏)
    except VELIMATIX as 貈窵芏芏芏窵貈伖伖窵窵绵伖伖貈跣绵:
        if 貈窵芏芏芏窵貈伖伖窵窵绵伖伖貈跣绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1148668)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1168416)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1148668)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1177581)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1169170')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8668411')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27540463968')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8668411')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('69942')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25221')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~58)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))()]))())
        if 貈窵芏芏芏窵貈伖伖窵窵绵伖伖貈跣绵.args[0] == 3:
            跣伖芏绵芏窵伖伖貈伖貈芏伖跣芏伖窵 = 267177981578436
        if 貈窵芏芏芏窵貈伖伖窵窵绵伖伖貈跣绵.args[0] == 4:
            芏窵跣芏芏貈跣窵貈伖窵貈貈貈跣貈伖 = 59607011766985
窵貈跣窵窵跣绵跣绵绵窵芏绵伖窵伖貈 = 0
while 窵貈跣窵窵跣绵跣绵绵窵芏绵伖窵伖貈 != 2:
    窵貈跣窵窵跣绵跣绵绵窵芏绵伖窵伖貈 += 1
    try:
        raise VELIMATIX(窵貈跣窵窵跣绵跣绵绵窵芏绵伖窵伖貈)
    except VELIMATIX as 跣伖绵伖芏貈跣跣伖貈绵芏芏窵窵绵窵:
        if 跣伖绵伖芏貈跣跣伖貈绵芏芏窵窵绵窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3165132')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6960413')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3140696)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3105734)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1273462784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~37980)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20279')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34743')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5111808')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25344')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('53')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('388')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~47)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('397312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('233472')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14286848')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1277952')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))()]))())
窵绵窵伖跣绵窵跣窵跣窵绵芏伖绵伖芏 = 0
while 窵绵窵伖跣绵窵跣窵跣窵绵芏伖绵伖芏 != 2:
    窵绵窵伖跣绵窵跣窵跣窵绵芏伖绵伖芏 += 1
    try:
        raise VELIMATIX(窵绵窵伖跣绵窵跣窵跣窵绵芏伖绵伖芏)
    except VELIMATIX as 绵窵芏绵芏窵伖伖伖跣伖芏貈绵芏伖窵:
        if 绵窵芏绵芏窵伖伖伖跣伖芏貈绵芏伖窵.args[0] == 1:
            烇圼欧儋挸皓()['婽爁淇鶹戠綞'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('103555842')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8725562')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2655312')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8725562')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('172593070')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8725562')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('450560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1638400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1596')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1818624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1470')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('69632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('429')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))()]))())
        if 绵窵芏绵芏窵伖伖伖跣伖芏貈绵芏伖窵.args[0] == 3:
            貈绵窵伖跣窵跣绵芏绵绵芏貈貈绵芏芏 = 136930778078380
        if 绵窵芏绵芏窵伖伖伖跣伖芏貈绵芏伖窵.args[0] == 4:
            芏窵窵伖绵伖伖芏窵芏芏伖伖跣芏芏绵 = 218888166075660
芏窵貈伖伖貈绵貈伖貈绵伖跣伖伖跣窵 = 0
while 芏窵貈伖伖貈绵貈伖貈绵伖跣伖伖跣窵 != 2:
    芏窵貈伖伖貈绵貈伖貈绵伖跣伖伖跣窵 += 1
    try:
        raise VELIMATIX(芏窵貈伖伖貈绵貈伖貈绵伖跣伖伖跣窵)
    except VELIMATIX as 伖绵窵绵窵窵貈伖跣绵绵貈芏芏伖芏绵:
        if 伖绵窵绵窵窵貈伖跣绵绵貈芏芏伖芏绵.args[0] == 1:
            烇圼欧儋挸皓()['馑嶀壢珧枢誽'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3867320')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1827683')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('515')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3735552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('397312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1260')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30146560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6488064')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1872')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14942208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('765')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1938')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1989')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('827392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1508')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('638976')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))()]))())
        if 伖绵窵绵窵窵貈伖跣绵绵貈芏芏伖芏绵.args[0] == 3:
            窵窵跣芏芏窵芏貈窵伖貈芏伖伖芏绵窵 = 262901449745027
绵芏芏窵貈芏窵跣窵貈伖跣伖伖貈窵貈 = 0
while 绵芏芏窵貈芏窵跣窵貈伖跣伖伖貈窵貈 != 2:
    绵芏芏窵貈芏窵跣窵貈伖跣伖伖貈窵貈 += 1
    try:
        raise VELIMATIX(绵芏芏窵貈芏窵跣窵貈伖跣伖伖貈窵貈)
    except VELIMATIX as 貈跣窵芏伖芏芏绵绵跣貈芏窵窵跣窵窵:
        if 貈跣窵芏伖芏芏绵绵跣貈芏窵窵跣窵窵.args[0] == 3:
            芏貈跣伖绵绵绵芏窵绵芏芏貈窵跣芏跣 = 172099412762908
        if 貈跣窵芏伖芏芏绵绵跣貈芏窵窵跣窵窵.args[0] == 4:
            伖跣芏跣伖芏绵窵跣窵窵伖跣伖貈貈貈 = 40802354652319
        if 貈跣窵芏伖芏芏绵绵跣貈芏窵窵跣窵窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8129840)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8152049)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1612160')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34240)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('190410')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31352')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('152220')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('490')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~45)'))))()]))())
窵窵窵跣伖伖窵伖跣窵貈窵芏窵绵芏绵 = 0
while 窵窵窵跣伖伖窵伖跣窵貈窵芏窵绵芏绵 != 2:
    窵窵窵跣伖伖窵伖跣窵貈窵芏窵绵芏绵 += 1
    try:
        raise VELIMATIX(窵窵窵跣伖伖窵伖跣窵貈窵芏窵绵芏绵)
    except VELIMATIX as 芏芏芏芏芏芏貈绵伖芏貈绵跣窵绵绵窵:
        if 芏芏芏芏芏芏貈绵伖芏貈绵跣窵绵绵窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119350746340')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3007414')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('89521353761')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3007414')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4147003)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4184165)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4147003)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4141473)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34135040')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28943')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1080784')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5470801')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119962695')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5470801')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('933888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1365')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1339')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('507')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))()]))())
窵绵貈伖芏伖绵芏窵跣跣窵绵绵貈伖伖 = 0
while 窵绵貈伖芏伖绵芏窵跣跣窵绵绵貈伖伖 != 2:
    窵绵貈伖芏伖绵芏窵跣跣窵绵绵貈伖伖 += 1
    try:
        raise VELIMATIX(窵绵貈伖芏伖绵芏窵跣跣窵绵绵貈伖伖)
    except VELIMATIX as 窵窵绵芏貈芏芏芏貈绵跣伖窵窵伖跣貈:
        if 窵窵绵芏貈芏芏芏貈绵跣伖窵窵伖跣貈.args[0] == 3:
            绵伖跣跣跣芏绵窵伖貈芏伖窵芏貈窵芏 = 115651113810360
        if 窵窵绵芏貈芏芏芏貈绵跣伖窵窵伖跣貈.args[0] == 1:
            烇圼欧儋挸皓()['凅咞埙穦蕿鑫'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7085035)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7085004)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('736843640')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5305807')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7085151')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5305807')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7085151')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5305807')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7085035)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7084955)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7085035)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7084952)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30408704')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('893')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('893')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~119)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('137')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2071')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2280')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3407872')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1455')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1830')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1545')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27648')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('909312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1339')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))()]))())
伖跣芏伖貈窵貈芏貈窵窵跣伖窵窵窵跣 = 0
while 伖跣芏伖貈窵貈芏貈窵窵跣伖窵窵窵跣 != 2:
    伖跣芏伖貈窵貈芏貈窵窵跣伖窵窵窵跣 += 1
    try:
        raise VELIMATIX(伖跣芏伖貈窵貈芏貈窵窵跣伖窵窵窵跣)
    except VELIMATIX as 绵伖伖绵绵芏绵芏芏芏芏窵貈绵跣芏芏:
        if 绵伖伖绵绵芏绵芏芏芏芏窵貈绵跣芏芏.args[0] == 3:
            跣跣窵芏绵貈芏芏芏绵窵窵跣窵貈芏貈 = 200450672692737
        if 绵伖伖绵绵芏绵芏芏芏芏窵貈绵跣芏芏.args[0] == 4:
            芏伖伖跣窵绵伖伖窵貈绵窵绵窵绵窵绵 = 116055370898911
        if 绵伖伖绵绵芏绵芏芏芏芏窵貈绵跣芏芏.args[0] == 1:
            烇圼欧儋挸皓()['蓿箣愙忏揗烁'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('181835706')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('536182210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4662555')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4662553')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('209810430')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4662556')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('470907854')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4662570')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4542664')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('811008')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106496')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1150')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6720')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('19968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))())
芏窵伖跣貈绵貈芏绵跣绵绵跣貈伖跣伖 = 0
while 芏窵伖跣貈绵貈芏绵跣绵绵跣貈伖跣伖 != 2:
    芏窵伖跣貈绵貈芏绵跣绵绵跣貈伖跣伖 += 1
    try:
        raise VELIMATIX(芏窵伖跣貈绵貈芏绵跣绵绵跣貈伖跣伖)
    except VELIMATIX as 伖貈跣貈跣窵窵貈跣绵跣芏芏跣貈芏跣:
        if 伖貈跣貈跣窵窵貈跣绵跣芏芏跣貈芏跣.args[0] == 3:
            貈貈貈窵跣绵绵伖貈窵芏貈芏貈跣芏芏 = 83111724353403
        if 伖貈跣貈跣窵窵貈跣绵跣芏芏跣貈芏跣.args[0] == 4:
            跣伖芏芏绵伖貈绵窵貈窵芏跣窵芏芏跣 = 116438980242590
        if 伖貈跣貈跣窵窵貈跣绵跣芏芏跣貈芏跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1493496)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1465662)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1524665')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6943941')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('136794112')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6472073216')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('602802')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28431')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6989130')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1909896')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7360')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('24832')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~40)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1680')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~109)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14417920')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('663')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))())
貈窵芏跣窵芏窵芏芏伖绵貈伖芏窵跣芏 = 0
while 貈窵芏跣窵芏窵芏芏伖绵貈伖芏窵跣芏 != 2:
    貈窵芏跣窵芏窵芏芏伖绵貈伖芏窵跣芏 += 1
    try:
        raise VELIMATIX(貈窵芏跣窵芏窵芏芏伖绵貈伖芏窵跣芏)
    except VELIMATIX as 窵跣窵绵绵伖绵貈跣绵伖跣芏伖貈绵窵:
        if 窵跣窵绵绵伖绵貈跣绵伖跣芏伖貈绵窵.args[0] == 1:
            烇圼欧儋挸皓()['釜熺腮牏濊凪'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2156170)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2156205)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('247959550')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0716512')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2156170)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2156271)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2156269')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0716512')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5760')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('714')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13238272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1972')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25344')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1474560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('404')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))()]))())
        if 窵跣窵绵绵伖绵貈跣绵伖跣芏伖貈绵窵.args[0] == 3:
            伖貈跣跣绵芏芏跣绵貈芏绵窵貈芏芏芏 = 5351244802821
        if 窵跣窵绵绵伖绵貈跣绵伖跣芏伖貈绵窵.args[0] == 4:
            跣伖窵绵伖伖绵芏芏貈窵窵芏貈跣伖伖 = 222513021781195
        if 窵跣窵绵绵伖绵貈跣绵伖跣芏伖貈绵窵.args[0] == 5:
            芏窵绵窵貈窵窵跣跣绵貈窵绵跣伖跣芏 = 113993532564750
窵跣跣窵窵跣伖跣貈窵貈跣芏跣伖芏跣 = 0
while 窵跣跣窵窵跣伖跣貈窵貈跣芏跣伖芏跣 != 2:
    窵跣跣窵窵跣伖跣貈窵貈跣芏跣伖芏跣 += 1
    try:
        raise VELIMATIX(窵跣跣窵窵跣伖跣貈窵貈跣芏跣伖芏跣)
    except VELIMATIX as 伖跣伖绵伖跣貈跣窵伖窵伖芏跣绵绵伖:
        if 伖跣伖绵伖跣貈跣窵伖窵伖芏跣绵绵伖.args[0] == 3:
            窵绵芏绵伖芏芏芏绵窵绵貈芏伖貈窵伖 = 15889489090917
        if 伖跣伖绵伖跣貈跣窵伖窵伖芏跣绵绵伖.args[0] == 4:
            貈伖跣窵貈窵芏伖芏窵窵貈伖伖伖绵绵 = 46446693271019
        if 伖跣伖绵伖跣貈跣窵伖窵伖芏跣绵绵伖.args[0] == 5:
            伖貈绵跣跣伖跣窵窵窵绵绵貈伖貈伖貈 = 64407037374807
        if 伖跣伖绵伖跣貈跣窵伖窵伖芏跣绵绵伖.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7232475')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9937917')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7197399)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7160729)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1594880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('26376')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('187122')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1044086784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71008002')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8170281')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820718)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820736)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1820815')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8170281')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1820836')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8170281')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820718)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820743)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('187533954')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8170281')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('176609646')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8170281')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820718)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1820762)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('413696')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))()]))())
绵芏芏绵跣窵伖芏跣跣跣窵貈绵窵跣跣 = 0
while 绵芏芏绵跣窵伖芏跣跣跣窵貈绵窵跣跣 != 2:
    绵芏芏绵跣窵伖芏跣跣跣窵貈绵窵跣跣 += 1
    try:
        raise VELIMATIX(绵芏芏绵跣窵伖芏跣跣跣窵貈绵窵跣跣)
    except VELIMATIX as 芏貈绵窵貈伖芏窵芏貈芏貈绵跣窵窵伖:
        if 芏貈绵窵貈伖芏窵芏貈芏貈绵跣窵窵伖.args[0] == 1:
            烇圼欧儋挸皓()['颺曇琂藠尌魨'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2478740)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2478771)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('285055100')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0478742')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1654784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('113')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('630')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1428')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('928')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('425984')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('129')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1212')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('10223616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
        if 芏貈绵窵貈伖芏窵芏貈芏貈绵跣窵窵伖.args[0] == 3:
            跣窵跣跣绵芏貈伖貈绵伖窵跣绵绵貈跣 = 153364607109611
绵跣窵貈芏跣窵芏伖窵绵伖芏芏芏芏跣 = 0
while 绵跣窵貈芏跣窵芏伖窵绵伖芏芏芏芏跣 != 2:
    绵跣窵貈芏跣窵芏伖窵绵伖芏芏芏芏跣 += 1
    try:
        raise VELIMATIX(绵跣窵貈芏跣窵芏伖窵绵伖芏芏芏芏跣)
    except VELIMATIX as 窵跣窵貈窵绵貈跣绵绵貈绵芏芏跣貈窵:
        if 窵跣窵貈窵绵貈跣绵绵貈绵芏芏跣貈窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('142540')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('73786')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57636')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('890880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34740')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116925')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('67')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('53')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9984')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))()]))())
        if 窵跣窵貈窵绵貈跣绵绵貈绵芏芏跣貈窵.args[0] == 3:
            伖跣跣绵貈跣绵伖貈绵貈绵芏窵芏伖芏 = 113888089033545
        if 窵跣窵貈窵绵貈跣绵绵貈绵芏芏跣貈窵.args[0] == 4:
            芏绵貈芏芏伖绵伖伖绵貈芏伖跣伖貈窵 = 182205289119645
        if 窵跣窵貈窵绵貈跣绵绵貈绵芏芏跣貈窵.args[0] == 5:
            伖芏貈跣芏窵貈窵窵跣绵窵貈跣窵窵芏 = 34486520893591
貈貈窵绵窵貈伖伖伖芏伖绵绵貈伖伖芏 = 0
while 貈貈窵绵窵貈伖伖伖芏伖绵绵貈伖伖芏 != 2:
    貈貈窵绵窵貈伖伖伖芏伖绵绵貈伖伖芏 += 1
    try:
        raise VELIMATIX(貈貈窵绵窵貈伖伖伖芏伖绵绵貈伖伖芏)
    except VELIMATIX as 貈绵跣伖绵跣芏跣芏绵伖芏貈跣窵跣芏:
        if 貈绵跣伖绵跣芏跣芏绵伖芏貈跣窵跣芏.args[0] == 1:
            烇圼欧儋挸皓()['晢劼盱滬唡轊'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1277952')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('130')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1485')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1530')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1740')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1560')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('675')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1500')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52953088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2185')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))()]))())
芏绵貈绵伖跣窵伖貈伖貈芏窵芏伖貈窵 = 0
while 芏绵貈绵伖跣窵伖貈伖貈芏窵芏伖貈窵 != 2:
    芏绵貈绵伖跣窵伖貈伖貈芏窵芏伖貈窵 += 1
    try:
        raise VELIMATIX(芏绵貈绵伖跣窵伖貈伖貈芏窵芏伖貈窵)
    except VELIMATIX as 芏窵芏绵貈伖窵貈貈窵窵伖窵貈跣貈窵:
        if 芏窵芏绵貈伖窵貈貈窵窵伖窵貈跣貈窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('295428001050')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5742039')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9302475)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9269218)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9325229')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5742039')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9342949')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5742039')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9327974')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5742039')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9337861')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5742039')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('382893771')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817789)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817817)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817789)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817810)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9817888')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817789)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9817800)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1070139001')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9817890')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9817899')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9817905')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9877189')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2555904')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))()]))())
        if 芏窵芏绵貈伖窵貈貈窵窵伖窵貈跣貈窵.args[0] == 3:
            窵貈貈伖貈跣芏窵貈绵绵窵跣跣伖芏芏 = 131910675245330
        if 芏窵芏绵貈伖窵貈貈窵窵伖窵貈跣貈窵.args[0] == 4:
            貈窵跣绵窵窵伖跣芏芏跣芏芏貈伖芏芏 = 225008677568100
芏貈窵窵伖绵窵窵貈窵窵伖绵伖窵伖窵 = 0
while 芏貈窵窵伖绵窵窵貈窵窵伖绵伖窵伖窵 != 2:
    芏貈窵窵伖绵窵窵貈窵窵伖绵伖窵伖窵 += 1
    try:
        raise VELIMATIX(芏貈窵窵伖绵窵窵貈窵窵伖绵伖窵伖窵)
    except VELIMATIX as 绵窵绵跣绵跣貈窵绵伖窵窵绵伖绵貈窵:
        if 绵窵绵跣绵跣貈窵绵伖窵窵绵伖绵貈窵.args[0] == 1:
            烇圼欧儋挸皓()['韥韏粔氛傟秭'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866457)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866494)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('668776098')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7546685')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5866558')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7546685')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866457)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866431)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('592512157')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7546685')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5866571')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7546685')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866457)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866428)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866457)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5866411)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5866496')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7546685')")[::-1])))()]))())
绵窵伖芏跣跣跣貈芏绵跣窵窵窵绵伖貈 = 0
while 绵窵伖芏跣跣跣貈芏绵跣窵窵窵绵伖貈 != 2:
    绵窵伖芏跣跣跣貈芏绵跣窵窵窵绵伖貈 += 1
    try:
        raise VELIMATIX(绵窵伖芏跣跣跣貈芏绵跣窵窵窵绵伖貈)
    except VELIMATIX as 芏窵貈窵伖窵窵窵绵绵貈窵跣窵跣伖芏:
        if 芏窵貈窵伖窵窵窵绵绵貈窵跣窵跣伖芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8227195')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5452028')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('330816842395')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5452028')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('164272368715')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5452028')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('292839059045')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5452028')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8202545)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8233485)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('165240269025')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5452028')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('314798328')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2571708')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('839462208')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2571708')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7602176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('928')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('752')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('752')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3276800')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1933312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~118)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1456')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('136')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1470')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('644')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1372')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1428')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('99')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('101')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1753088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3080192')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1712')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('800')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~96)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('425984')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1344')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~43)'))))()]))())
跣貈芏绵貈窵跣貈跣伖窵跣伖绵芏跣貈 = 0
while 跣貈芏绵貈窵跣貈跣伖窵跣伖绵芏跣貈 != 2:
    跣貈芏绵貈窵跣貈跣伖窵跣伖绵芏跣貈 += 1
    try:
        raise VELIMATIX(跣貈芏绵貈窵跣貈跣伖窵跣伖绵芏跣貈)
    except VELIMATIX as 跣貈伖伖伖绵跣貈伖绵芏貈窵跣伖窵貈:
        if 跣貈伖伖伖绵跣貈伖绵芏貈窵跣伖窵貈.args[0] == 3:
            伖貈绵跣伖貈伖貈芏貈跣窵窵芏绵绵伖 = 228393750516939
        if 跣貈伖伖伖绵跣貈伖绵芏貈窵跣伖窵貈.args[0] == 1:
            烇圼欧儋挸皓()['椪搜侲鹬酮亊'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632778)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632813)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9632875')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8772369')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('953645022')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8772369')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632778)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632873)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632778)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9632879)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('270')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('618')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3104')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('505')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))()]))())
绵伖貈芏绵窵芏貈绵绵芏窵跣绵伖跣跣 = 0
while 绵伖貈芏绵窵芏貈绵绵芏窵跣绵伖跣跣 != 2:
    绵伖貈芏绵窵芏貈绵绵芏窵跣绵伖跣跣 += 1
    try:
        raise VELIMATIX(绵伖貈芏绵窵芏貈绵绵芏窵跣绵伖跣跣)
    except VELIMATIX as 貈跣伖芏芏窵芏貈伖芏伖芏貈窵窵芏窵:
        if 貈跣伖芏芏窵芏貈伖芏伖芏貈窵窵芏窵.args[0] == 1:
            烇圼欧儋挸皓()['嬭烶戟棅冮瘧'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('281264997')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3291127')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15104')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('352256')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~66)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~32)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~122)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1356')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~49)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('576')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('233472')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('528')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('82')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('984')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('708')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('732')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('458752')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('204')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~57)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~63)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('48')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~53)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~46)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~108)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~87)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~81)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7995392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('393216')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('702')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('572')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13238272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28160')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30932992')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('29622272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('79')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('864')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('828')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('702')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
        if 貈跣伖芏芏窵芏貈伖芏伖芏貈窵窵芏窵.args[0] == 3:
            窵貈貈窵窵绵绵貈绵绵窵绵貈绵绵芏绵 = 217817887660080
貈貈窵窵芏窵芏芏芏伖窵跣绵芏窵跣貈 = 0
while 貈貈窵窵芏窵芏芏芏伖窵跣绵芏窵跣貈 != 2:
    貈貈窵窵芏窵芏芏芏伖窵跣绵芏窵跣貈 += 1
    try:
        raise VELIMATIX(貈貈窵窵芏窵芏芏芏伖窵跣绵芏窵跣貈)
    except VELIMATIX as 跣绵芏跣芏貈芏绵伖窵伖跣貈跣貈绵伖:
        if 跣绵芏跣芏貈芏绵伖窵伖跣貈跣貈绵伖.args[0] == 3:
            绵窵绵绵绵绵伖绵绵跣貈绵绵跣貈绵芏 = 84239474639877
        if 跣绵芏跣芏貈芏绵伖窵伖跣貈跣貈绵伖.args[0] == 4:
            窵跣绵芏芏跣伖芏芏绵跣貈伖貈芏伖窵 = 273366493812418
        if 跣绵芏跣芏貈芏绵伖窵伖跣貈跣貈绵伖.args[0] == 5:
            窵窵跣绵伖貈窵伖伖绵貈貈芏貈芏绵跣 = 256027872089802
        if 跣绵芏跣芏貈芏绵伖窵伖跣貈跣貈绵伖.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28898304')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2379808768')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~26206)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('30972')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21682')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28071')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2416608')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9656142')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8781824')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1887')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('444')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13238272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~54)'))))()]))())
绵貈芏跣窵窵窵貈窵绵芏窵貈芏绵跣貈 = 0
while 绵貈芏跣窵窵窵貈窵绵芏窵貈芏绵跣貈 != 2:
    绵貈芏跣窵窵窵貈窵绵芏窵貈芏绵跣貈 += 1
    try:
        raise VELIMATIX(绵貈芏跣窵窵窵貈窵绵芏窵貈芏绵跣貈)
    except VELIMATIX as 窵跣绵跣绵貈芏伖跣绵伖跣绵绵貈芏跣:
        if 窵跣绵跣绵貈芏伖跣绵伖跣绵绵貈芏跣.args[0] == 1:
            烇圼欧儋挸皓()['隻弆嫣箵蒬彥'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('217787076')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4824855')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('586349820')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4824855')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5584384')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4824855')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('217787076')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4824855')")[::-1])))()]))())
        if 窵跣绵跣绵貈芏伖跣绵伖跣绵绵貈芏跣.args[0] == 3:
            芏窵貈窵伖芏窵跣跣跣绵跣跣伖绵跣貈 = 37717002039557
绵窵跣芏窵绵伖跣伖伖貈窵芏跣芏芏绵 = 0
while 绵窵跣芏窵绵伖跣伖伖貈窵芏跣芏芏绵 != 2:
    绵窵跣芏窵绵伖跣伖伖貈窵芏跣芏芏绵 += 1
    try:
        raise VELIMATIX(绵窵跣芏窵绵伖跣伖伖貈窵芏跣芏芏绵)
    except VELIMATIX as 窵芏芏窵芏跣伖绵跣窵窵貈窵绵貈窵芏:
        if 窵芏芏窵芏跣伖绵跣窵窵貈窵绵貈窵芏.args[0] == 3:
            伖窵窵貈芏窵伖绵跣绵绵绵窵跣窵貈伖 = 81136288369983
        if 窵芏芏窵芏跣伖绵跣窵窵貈窵绵貈窵芏.args[0] == 4:
            伖貈芏芏窵貈窵芏绵伖貈貈跣芏芏貈伖 = 173688014119252
        if 窵芏芏窵芏跣伖绵跣窵窵貈窵绵貈窵芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('17799168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~30571)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31888')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34995)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~21582)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('327618')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262406)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262433)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('260176690')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6042622')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262406)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262499)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2262520')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6042622')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262406)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2262512)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2262507')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6042622')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1867776')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('24320')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('888')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~122)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('800')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~109)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))()]))())
芏绵窵窵貈貈芏跣跣貈伖窵跣绵貈伖伖 = 0
while 芏绵窵窵貈貈芏跣跣貈伖窵跣绵貈伖伖 != 2:
    芏绵窵窵貈貈芏跣跣貈伖窵跣绵貈伖伖 += 1
    try:
        raise VELIMATIX(芏绵窵窵貈貈芏跣跣貈伖窵跣绵貈伖伖)
    except VELIMATIX as 伖芏貈绵芏跣貈貈跣芏窵貈芏窵貈芏跣:
        if 伖芏貈绵芏跣貈貈跣芏窵貈芏窵貈芏跣.args[0] == 1:
            烇圼欧儋挸皓()['軇诠擫贲罧髛'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2722390)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2722417)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2722505')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0932272')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('472')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('638976')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))()]))())
        if 伖芏貈绵芏跣貈貈跣芏窵貈芏窵貈芏跣.args[0] == 3:
            芏貈窵窵芏跣窵绵伖绵窵跣貈绵伖貈窵 = 79230443169629
        if 伖芏貈绵芏跣貈貈跣芏窵貈芏窵貈芏跣.args[0] == 4:
            貈窵芏窵窵芏窵伖伖绵绵貈芏貈貈窵伖 = 177767921663819
貈伖绵伖绵绵芏伖跣窵跣绵绵芏绵芏貈 = 0
while 貈伖绵伖绵绵芏伖跣窵跣绵绵芏绵芏貈 != 2:
    貈伖绵伖绵绵芏伖跣窵跣绵绵芏绵芏貈 += 1
    try:
        raise VELIMATIX(貈伖绵伖绵绵芏伖跣窵跣绵绵芏绵芏貈)
    except VELIMATIX as 伖跣芏窵跣绵芏芏绵貈芏芏芏伖伖跣跣:
        if 伖跣芏窵跣绵芏芏绵貈芏芏芏伖伖跣跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('238652893215')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5365539')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9394439')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5365539')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9355635)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9347366)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('513744')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23908')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23689')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3467272)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3467311)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3467387')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2727643')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('374465376')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2727643')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3467272)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3467311)'))))()]))())
芏跣伖跣芏伖貈芏芏跣伖貈跣伖芏芏跣 = 0
while 芏跣伖跣芏伖貈芏芏跣伖貈跣伖芏芏跣 != 2:
    芏跣伖跣芏伖貈芏芏跣伖貈跣伖芏芏跣 += 1
    try:
        raise VELIMATIX(芏跣伖跣芏伖貈芏芏跣伖貈跣伖芏芏跣)
    except VELIMATIX as 伖窵貈窵窵绵伖窵绵伖绵芏跣绵跣貈貈:
        if 伖窵貈窵窵绵伖窵绵伖绵芏跣绵跣貈貈.args[0] == 3:
            窵窵伖绵绵伖芏伖貈貈芏伖貈伖伖绵跣 = 146292276613669
        if 伖窵貈窵窵绵伖窵绵伖绵芏跣绵跣貈貈.args[0] == 4:
            貈伖伖芏跣跣绵貈貈窵窵貈伖貈窵伖貈 = 138649126827765
        if 伖窵貈窵窵绵伖窵绵伖绵芏跣绵跣貈貈.args[0] == 1:
            烇圼欧儋挸皓()['曪隀塣煛愪勚'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9375944)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9375983)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('471040')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15335424')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~115)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('663')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))())
伖跣芏貈伖伖绵芏伖窵窵芏窵貈窵跣跣 = 0
while 伖跣芏貈伖伖绵芏伖窵窵芏窵貈窵跣跣 != 2:
    伖跣芏貈伖伖绵芏伖窵窵芏窵貈窵跣跣 += 1
    try:
        raise VELIMATIX(伖跣芏貈伖伖绵芏伖窵窵芏窵貈窵跣跣)
    except VELIMATIX as 芏跣芏跣绵芏窵窵伖跣窵跣窵绵伖伖伖:
        if 芏跣芏跣绵芏窵窵伖跣窵跣窵绵伖伖伖.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('350140502272')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2358829')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107780')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14830010368')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('726123')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('508953')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('138712')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('201972342')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8778715')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('319488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))()]))())
芏绵芏绵窵绵貈伖芏芏伖窵貈绵貈芏窵 = 0
while 芏绵芏绵窵绵貈伖芏芏伖窵貈绵貈芏窵 != 2:
    芏绵芏绵窵绵貈伖芏芏伖窵貈绵貈芏窵 += 1
    try:
        raise VELIMATIX(芏绵芏绵窵绵貈伖芏芏伖窵貈绵貈芏窵)
    except VELIMATIX as 伖跣绵窵芏窵窵芏绵窵貈伖跣窵窵窵绵:
        if 伖跣绵窵芏窵窵芏绵窵貈伖跣窵窵窵绵.args[0] == 3:
            窵绵伖窵芏芏绵绵跣貈伖跣跣貈跣貈伖 = 222862904489723
        if 伖跣绵窵芏窵窵芏绵窵貈伖跣窵窵窵绵.args[0] == 4:
            貈窵芏芏跣芏窵跣芏芏芏窵芏绵芏貈芏 = 161287595779302
        if 伖跣绵窵芏窵窵芏绵窵貈伖跣窵窵窵绵.args[0] == 5:
            跣绵窵伖窵貈芏窵窵貈芏窵绵伖跣跣跣 = 271678535490220
        if 伖跣绵窵芏窵窵芏绵窵貈伖跣窵窵窵绵.args[0] == 1:
            烇圼欧儋挸皓()['诚袀鉕楞玡闣'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('256905402')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8137856')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7602176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3680')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('63')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~42)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96256')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('129')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('892928')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('598')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('101')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('105')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('46')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('99')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('210944')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('517')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1122')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('108')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1089')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1078')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1177')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('517')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107520')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1753088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1414')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1652')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('64')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1568')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('53248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('48')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))())
貈伖跣窵绵绵芏伖窵窵芏绵绵伖绵绵芏 = 0
while 貈伖跣窵绵绵芏伖窵窵芏绵绵伖绵绵芏 != 2:
    貈伖跣窵绵绵芏伖窵窵芏绵绵伖绵绵芏 += 1
    try:
        raise VELIMATIX(貈伖跣窵绵绵芏伖窵窵芏绵绵伖绵绵芏)
    except VELIMATIX as 貈窵跣貈跣貈芏跣伖窵跣芏貈跣窵貈绵:
        if 貈窵跣貈跣貈芏跣伖窵跣芏貈跣窵貈绵.args[0] == 3:
            绵貈跣窵伖伖貈芏芏貈伖芏跣伖跣貈跣 = 168991561334061
        if 貈窵跣貈跣貈芏跣伖窵跣芏貈跣窵貈绵.args[0] == 1:
            烇圼欧儋挸皓()['鬜恮掿櫾坞噻'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7986923)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7986892)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('830639992')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3296897')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('926483068')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3296897')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('870574607')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3296897')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7987031')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3296897')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7986969')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3296897')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1835008')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('235520')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('319488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))()]))())
窵跣跣跣伖伖绵貈跣伖貈窵绵绵窵绵貈 = 0
while 窵跣跣跣伖伖绵貈跣伖貈窵绵绵窵绵貈 != 2:
    窵跣跣跣伖伖绵貈跣伖貈窵绵绵窵绵貈 += 1
    try:
        raise VELIMATIX(窵跣跣跣伖伖绵貈跣伖貈窵绵绵窵绵貈)
    except VELIMATIX as 绵绵芏芏绵窵伖跣伖跣伖跣貈貈芏貈绵:
        if 绵绵芏芏绵窵伖跣伖跣伖跣貈貈芏貈绵.args[0] == 1:
            烇圼欧儋挸皓()['葋夞瑾懚紩懖'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('156')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('198')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7296')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55050240')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('135')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))()]))())
        if 绵绵芏芏绵窵伖跣伖跣伖跣貈貈芏貈绵.args[0] == 3:
            芏貈绵貈跣貈绵绵绵芏绵芏貈伖貈貈貈 = 80577453732114
伖窵伖窵芏窵跣跣貈貈跣跣伖貈跣貈芏 = 0
while 伖窵伖窵芏窵跣跣貈貈跣跣伖貈跣貈芏 != 2:
    伖窵伖窵芏窵跣跣貈貈跣跣伖貈跣貈芏 += 1
    try:
        raise VELIMATIX(伖窵伖窵芏窵跣跣貈貈跣跣伖貈跣貈芏)
    except VELIMATIX as 跣貈貈跣伖伖芏貈窵绵伖绵芏窵窵貈窵:
        if 跣貈貈跣伖伖芏貈窵绵伖绵芏窵窵貈窵.args[0] == 3:
            芏貈芏跣伖窵跣绵伖绵跣绵貈伖芏芏芏 = 242443126386171
        if 跣貈貈跣伖伖芏貈窵绵伖绵芏窵窵貈窵.args[0] == 4:
            窵跣绵芏伖伖跣伖伖芏伖貈跣貈跣绵跣 = 57838313451257
        if 跣貈貈跣伖伖芏貈窵绵伖绵芏窵窵貈窵.args[0] == 5:
            绵绵伖伖芏窵跣绵芏跣窵芏跣芏貈窵跣 = 65593751812261
        if 跣貈貈跣伖伖芏貈窵绵伖绵芏窵窵貈窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2167654')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5900412')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('80191499745')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5900412')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47721978405')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5900412')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2175594')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5900412')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2140095)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2150965)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('476448')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6305775')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6375036')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6305852')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6375036')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('235')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12713984')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1649')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~17)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1683')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('912')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('108')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('348')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36)'))))()]))())
伖貈伖窵芏窵伖貈窵跣芏芏伖伖芏貈伖 = 0
while 伖貈伖窵芏窵伖貈窵跣芏芏伖伖芏貈伖 != 2:
    伖貈伖窵芏窵伖貈窵跣芏芏伖伖芏貈伖 += 1
    try:
        raise VELIMATIX(伖貈伖窵芏窵伖貈窵跣芏芏伖伖芏貈伖)
    except VELIMATIX as 伖伖芏绵绵窵跣跣跣貈貈貈窵绵绵貈窵:
        if 伖伖芏绵绵窵跣跣跣貈貈貈窵绵绵貈窵.args[0] == 3:
            貈芏貈貈窵跣貈绵芏伖伖绵跣芏芏伖貈 = 59237166665941
        if 伖伖芏绵绵窵跣跣跣貈貈貈窵绵绵貈窵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50262005376')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4556442')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('79772339724')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4556442')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('84013056')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('356292')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('486684')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2720923648')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('222384981')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9712075')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5111808')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))()]))())
伖貈伖窵貈窵窵貈跣伖跣跣伖跣窵窵芏 = 0
while 伖貈伖窵貈窵窵貈跣伖跣跣伖跣窵窵芏 != 2:
    伖貈伖窵貈窵窵貈跣伖跣跣伖跣窵窵芏 += 1
    try:
        raise VELIMATIX(伖貈伖窵貈窵窵貈跣伖跣跣伖跣窵窵芏)
    except VELIMATIX as 伖窵跣窵芏貈绵跣伖伖跣跣伖伖窵绵芏:
        if 伖窵跣窵芏貈绵跣伖伖跣跣伖伖窵绵芏.args[0] == 3:
            貈伖绵貈伖伖伖绵跣跣窵貈芏伖窵芏绵 = 220312453649709
        if 伖窵跣窵芏貈绵跣伖伖跣跣伖伖窵绵芏.args[0] == 4:
            绵窵窵貈伖跣貈跣跣跣窵跣绵绵芏芏窵 = 248462142049076
        if 伖窵跣窵芏貈绵跣伖伖跣跣伖伖窵绵芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9892535')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4993589')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('10658304')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71524352')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~36689)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('38290')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9041664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('19968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('981')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('827392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7360')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('210944')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1111')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('237568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('384')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('46')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1310720')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('630')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~83)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~83)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2228224')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~16)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~55)'))))()]))())
貈窵貈伖芏芏伖芏芏貈伖窵窵绵跣跣伖 = 0
while 貈窵貈伖芏芏伖芏芏貈伖窵窵绵跣跣伖 != 2:
    貈窵貈伖芏芏伖芏芏貈伖窵窵绵跣跣伖 += 1
    try:
        raise VELIMATIX(貈窵貈伖芏芏伖芏芏貈伖窵窵绵跣跣伖)
    except VELIMATIX as 跣貈窵窵跣绵窵绵伖伖绵貈芏绵绵绵跣:
        if 跣貈窵窵跣绵窵绵伖伖绵貈芏绵绵绵跣.args[0] == 1:
            烇圼欧儋挸皓()['洂雦詗妜禗綑'[::-1]] = 援腷葠典爕歡(')0-(-1'[::-1])
        if 跣貈窵窵跣绵窵绵伖伖绵貈芏绵绵绵跣.args[0] == 3:
            跣窵窵伖伖跣窵窵跣伖芏跣芏绵芏芏伖 = 169396452576318
窵绵芏绵跣窵绵绵貈伖绵跣窵跣绵伖窵 = 0
while 窵绵芏绵跣窵绵绵貈伖绵跣窵跣绵伖窵 != 2:
    窵绵芏绵跣窵绵绵貈伖绵跣窵跣绵伖窵 += 1
    try:
        raise VELIMATIX(窵绵芏绵跣窵绵绵貈伖绵跣窵跣绵伖窵)
    except VELIMATIX as 貈绵伖芏绵貈窵貈貈跣貈窵伖窵窵貈貈:
        if 貈绵伖芏绵貈窵貈貈跣貈窵伖窵窵貈貈.args[0] == 3:
            绵貈芏伖芏绵绵绵窵跣绵跣貈跣伖貈芏 = 109373462855197
        if 貈绵伖芏绵貈窵貈貈跣貈窵伖窵窵貈貈.args[0] == 4:
            伖绵芏绵窵伖跣绵芏跣貈貈芏窵貈绵伖 = 93283506250081
        if 貈绵伖芏绵貈窵貈貈跣貈窵伖窵窵貈貈.args[0] == 1:
            烇圼欧儋挸皓()['殕龾鉪凵偓穦'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6621425)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6621398)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6621500')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5241266')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106496')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~254)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1030')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('320')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('246')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~42)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('126')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7844)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('33')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7841')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('103')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('32768')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1160')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115200')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('420')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('111')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('234')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('103')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('35')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
貈芏绵芏貈芏跣跣跣窵窵貈伖绵窵窵芏 = 0
while 貈芏绵芏貈芏跣跣跣窵窵貈伖绵窵窵芏 != 2:
    貈芏绵芏貈芏跣跣跣窵窵貈伖绵窵窵芏 += 1
    try:
        raise VELIMATIX(貈芏绵芏貈芏跣跣跣窵窵貈伖绵窵窵芏)
    except VELIMATIX as 绵伖绵绵窵跣绵跣绵伖跣绵绵芏窵芏跣:
        if 绵伖绵绵窵跣绵跣绵伖跣绵绵芏窵芏跣.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8773913')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0022578')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8782511')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0022578')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('332021760')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13193216')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~29417)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23440')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6517070')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1307156')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6517145')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1307156')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6517070')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1307156')")[::-1])))()]))())
        if 绵伖绵绵窵跣绵跣绵伖跣绵绵芏窵芏跣.args[0] == 3:
            伖伖伖绵芏跣绵伖貈窵跣伖伖绵绵绵跣 = 21213762094312
        if 绵伖绵绵窵跣绵跣绵伖跣绵绵芏窵芏跣.args[0] == 4:
            伖芏芏绵跣貈绵绵绵窵伖芏貈芏绵芏窵 = 53071349236941
        if 绵伖绵绵窵跣绵跣绵伖跣绵绵芏窵芏跣.args[0] == 5:
            窵跣貈芏跣窵窵绵窵貈跣跣绵伖貈貈貈 = 231366232925041
貈跣芏绵貈绵窵跣绵芏伖绵窵伖窵跣芏 = 0
while 貈跣芏绵貈绵窵跣绵芏伖绵窵伖窵跣芏 != 2:
    貈跣芏绵貈绵窵跣绵芏伖绵窵伖窵跣芏 += 1
    try:
        raise VELIMATIX(貈跣芏绵貈绵窵跣绵芏伖绵窵伖窵跣芏)
    except VELIMATIX as 跣窵貈伖伖貈窵绵跣跣跣伖窵伖窵跣窵:
        if 跣窵貈伖伖貈窵绵跣跣跣伖窵伖窵跣窵.args[0] == 1:
            烇圼欧儋挸皓()['皓鋦鎠薊殖竗'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6633323)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6633292)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6633323)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6633226)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('19968')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))()]))())
貈窵伖伖窵芏跣芏跣跣芏伖伖跣跣窵窵 = 0
while 貈窵伖伖窵芏跣芏跣跣芏伖伖跣跣窵窵 != 2:
    貈窵伖伖窵芏跣芏跣跣芏伖伖跣跣窵窵 += 1
    try:
        raise VELIMATIX(貈窵伖伖窵芏跣芏跣跣芏伖伖跣跣窵窵)
    except VELIMATIX as 绵跣貈貈伖芏绵绵绵芏窵绵跣伖貈窵貈:
        if 绵跣貈貈伖芏绵绵绵芏窵绵跣伖貈窵貈.args[0] == 3:
            窵窵貈貈绵窵跣貈芏窵芏跣貈芏伖绵芏 = 84691850537369
        if 绵跣貈貈伖芏绵绵绵芏窵绵跣伖貈窵貈.args[0] == 1:
            烇圼欧儋挸皓()['甒藮埈噱撏罐'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57634629')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1187741')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1477811)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1477832)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1477811)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1477838)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('181770753')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1187741')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8192000')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))()]))())
芏芏芏窵窵跣伖绵貈伖貈窵貈窵跣芏芏 = 0
while 芏芏芏窵窵跣伖绵貈伖貈窵貈窵跣芏芏 != 2:
    芏芏芏窵窵跣伖绵貈伖貈窵貈窵跣芏芏 += 1
    try:
        raise VELIMATIX(芏芏芏窵窵跣伖绵貈伖貈窵貈窵跣芏芏)
    except VELIMATIX as 窵芏貈窵绵伖伖窵伖窵绵芏绵貈芏貈跣:
        if 窵芏貈窵绵伖伖窵伖窵绵芏绵貈芏貈跣.args[0] == 3:
            芏跣伖貈芏貈窵伖窵窵跣跣芏绵貈窵伖 = 248357884547502
        if 窵芏貈窵绵伖伖窵伖窵绵芏绵貈芏貈跣.args[0] == 1:
            烇圼欧儋挸皓()['擟蠜箤嫼尩瓞'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3853098')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9503583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('354481428')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9503583')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3853059)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3853165)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3853059)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3853092)'))))()]))())
伖芏跣绵貈跣芏伖跣貈伖伖窵貈伖绵跣 = 0
while 伖芏跣绵貈跣芏伖跣貈伖伖窵貈伖绵跣 != 2:
    伖芏跣绵貈跣芏伖跣貈伖伖窵貈伖绵跣 += 1
    try:
        raise VELIMATIX(伖芏跣绵貈跣芏伖跣貈伖伖窵貈伖绵跣)
    except VELIMATIX as 伖貈跣窵貈窵伖跣绵跣绵貈绵绵貈跣跣:
        if 伖貈跣窵貈窵伖跣绵跣绵貈绵绵貈跣跣.args[0] == 1:
            烇圼欧儋挸皓()['腖嫜阶舸阁簻'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3100935)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3100960)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20480')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9216')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~87)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('581')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('76')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('581')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('90')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('37376')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~77)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('70')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('58')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~109)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('882')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('505')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1835008')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~55)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('217088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1368')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1212')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~121)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1344')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('68')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~122)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1344')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~127)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('624')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~58)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('472')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('485')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('515')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('580')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1998848')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~91)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('72')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~57)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1455')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('960')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('345')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('92')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14336')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3136')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('38912')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~72)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6750208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1200')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8832')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('784')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('93')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~72)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('528')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~65)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('327')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('246')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('363')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~58)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('432')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('146')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('35651584')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('80896')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('660')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2490368')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~68)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~92)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('33792')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~75)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12672')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('147456')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~73)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1265')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('101')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('22016')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3276800')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('884736')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('22784')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('124')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('896')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('108')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1072')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12845056')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('315392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1464')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1188')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('129')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39424')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1098')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('801')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~77)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~67)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~114)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('79')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('92')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('75')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20185088')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('77824')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('77')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('76')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1150')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('970')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11136')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('80')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('35328')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~109)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~101)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('801')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1044')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1062')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('69')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('204')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('100')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('19398656')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~100)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1764')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('45613056')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('137')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1463')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('44040192')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1387')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1064960')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1638')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~67)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~77)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('104')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7616')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('79')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~67)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('294')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110592')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21248')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('74')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~92)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~81)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('720')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('416')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13952')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('749')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20447232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~70)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('69')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1368')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~120)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('102400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15466496')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('16777216')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1805')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('136')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1843')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1938')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1622016')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('854')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('221184')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1067')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('407')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~79)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('477')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('432')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~44)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('450')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12288')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('320')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('84')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7040')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~126)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('18944')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('38')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('48')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('65')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('225280')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('409600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1368')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('240')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('54')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('240')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~32)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13369344')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~80)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('666')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~32)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('600')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('44')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~38)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~49)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('144')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~66)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('229376')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1188')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~11)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~92)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3309568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~66)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('945')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~125)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('333')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~59)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('79')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('434176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52224')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('65')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('460')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('540')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~47)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~10)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~56)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('480')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81920')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('825')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('83')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('95')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('308')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('152')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~65)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('210')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('438272')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1184')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~53)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('76')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('505')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('495')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('454656')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1343488')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2368')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('56')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~54)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('402')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~110)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('654')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('222')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~64)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1605632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~61)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27262976')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~61)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('912')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~61)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('67')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('65')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('912')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('148')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('52')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('39424')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('100352')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1050')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1080')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25856')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('296')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('400')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6144')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('90')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('714')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~53)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~65)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~50)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~48)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('53')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~52)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~49)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('413')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('273')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7')")[::-1])))()]))())
        if 伖貈跣窵貈窵伖跣绵跣绵貈绵绵貈跣跣.args[0] == 3:
            跣伖芏伖绵绵伖窵貈绵窵跣伖伖貈跣伖 = 71207227704021
        if 伖貈跣窵貈窵伖跣绵跣绵貈绵绵貈跣跣.args[0] == 4:
            伖绵貈窵芏跣貈貈窵跣窵窵伖绵芏芏芏 = 190747343710358
窵绵跣窵窵貈窵窵窵芏伖绵芏跣芏绵芏 = 0
while 窵绵跣窵窵貈窵窵窵芏伖绵芏跣芏绵芏 != 2:
    窵绵跣窵窵貈窵窵窵芏伖绵芏跣芏绵芏 += 1
    try:
        raise VELIMATIX(窵绵跣窵窵貈窵窵窵芏伖绵芏跣芏绵芏)
    except VELIMATIX as 窵跣窵芏貈貈跣芏绵窵窵绵芏伖窵伖芏:
        if 窵跣窵芏貈貈跣芏绵窵窵绵芏伖窵伖芏.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('73637888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('373669888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~20300)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('310509568')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('25876')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~13)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39024)'))))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4854250')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1124584')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('320377926')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1124584')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4854211)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4853602)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4854321')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1124584')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1024')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('26624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7873)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('40')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8945664')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('447')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7916)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('396')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('484')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~34)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('198')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7855')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7168')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('64')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1638400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7897')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1386')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1703936')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('448')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('132')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('110726')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~46)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1526')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7895)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~122)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2048')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7841)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('450560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('66')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('40')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))()]))())
        if 窵跣窵芏貈貈跣芏绵窵窵绵芏伖窵伖芏.args[0] == 3:
            窵伖貈貈伖貈跣跣伖貈貈跣貈貈芏伖跣 = 71372942537711
窵芏绵跣窵伖绵窵绵伖芏绵伖绵绵绵芏 = 0
while 窵芏绵跣窵伖绵窵绵伖芏绵伖绵绵绵芏 != 2:
    窵芏绵跣窵伖绵窵绵伖芏绵伖绵绵绵芏 += 1
    try:
        raise VELIMATIX(窵芏绵跣窵伖绵窵绵伖芏绵伖绵绵绵芏)
    except VELIMATIX as 伖貈貈芏芏跣貈窵伖跣芏貈跣绵芏芏芏:
        if 伖貈貈芏芏跣貈窵伖跣芏貈跣绵芏芏芏.args[0] == 3:
            绵绵绵跣绵跣貈绵绵芏窵伖芏伖绵跣伖 = 178808376152823
        if 伖貈貈芏芏跣貈窵伖跣芏貈跣绵芏芏芏.args[0] == 4:
            绵芏芏芏跣窵绵绵窵窵貈跣伖绵伖窵貈 = 232529714124063
        if 伖貈貈芏芏跣貈窵伖跣芏貈跣绵芏芏芏.args[0] == 1:
            烇圼欧儋挸皓()['趸绽坱微瞸賈'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5779602')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3659775')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('387230721')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3659775')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5779563)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5779460)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5779563)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~5779460)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28049408')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1890')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1818')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~50)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1926')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~230)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('121')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('576')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('122')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15814')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('32')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('109')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4130865152')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~123)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~124)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7882')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~112)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('608')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('416')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~434)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('194')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('546')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8288')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28160')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~111)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('40')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('26624')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7845)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('256')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7602176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('116736')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2340')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('120')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2048')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('202')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~99)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('29440')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('232')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6464')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('192')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~39)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('234')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))()]))())
绵绵窵窵伖芏貈跣伖窵芏芏绵伖芏芏芏 = 0
while 绵绵窵窵伖芏貈跣伖窵芏芏绵伖芏芏芏 != 2:
    绵绵窵窵伖芏貈跣伖窵芏芏绵伖芏芏芏 += 1
    try:
        raise VELIMATIX(绵绵窵窵伖芏貈跣伖窵芏芏绵伖芏芏芏)
    except VELIMATIX as 跣貈芏跣芏貈绵绵窵貈芏芏绵芏绵绵绵:
        if 跣貈芏跣芏貈绵绵窵貈芏芏绵芏绵绵绵.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15872000')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('20454400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('414842880')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('40005632')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('218970')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('393110')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749713)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749750)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749713)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749765)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('971218143')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3179478')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749713)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~8749822)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('55296')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('8388608')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('84')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('135')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1836')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~116)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('94')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('123')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1926')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('808')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('35')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('231')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~106)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7878)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('330')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('240')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('416')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('239')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))()]))())
貈绵绵窵跣窵绵绵芏貈貈芏芏跣芏芏伖 = 0
while 貈绵绵窵跣窵绵绵芏貈貈芏芏跣芏芏伖 != 2:
    貈绵绵窵跣窵绵绵芏貈貈芏芏跣芏芏伖 += 1
    try:
        raise VELIMATIX(貈绵绵窵跣窵绵绵芏貈貈芏芏跣芏芏伖)
    except VELIMATIX as 伖芏跣伖芏芏窵伖窵跣绵窵绵窵跣跣伖:
        if 伖芏跣伖芏芏窵伖窵跣绵窵绵窵跣跣伖.args[0] == 1:
            烇圼欧儋挸皓()['嚝鈑靝顩児肳'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6897543')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4057986')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6897504)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6897479)'))))()]))())
        if 伖芏跣伖芏芏窵伖窵跣绵窵绵窵跣跣伖.args[0] == 3:
            绵伖跣绵貈伖跣芏伖跣绵芏绵貈绵跣貈 = 239477952309549
        if 伖芏跣伖芏芏窵伖窵跣绵窵绵窵跣跣伖.args[0] == 4:
            伖绵貈貈貈貈伖貈伖伖绵窵窵芏貈绵绵 = 185929201808402
窵芏芏貈芏芏跣绵貈跣窵貈芏跣绵芏伖 = 0
while 窵芏芏貈芏芏跣绵貈跣窵貈芏跣绵芏伖 != 2:
    窵芏芏貈芏芏跣绵貈跣窵貈芏跣绵芏伖 += 1
    try:
        raise VELIMATIX(窵芏芏貈芏芏跣绵貈跣窵貈芏跣绵芏伖)
    except VELIMATIX as 跣伖绵伖貈跣窵窵伖跣跣绵伖绵跣貈窵:
        if 跣伖绵伖貈跣窵窵伖跣跣绵伖绵跣貈窵.args[0] == 1:
            烇圼欧儋挸皓()['騂脄擫邲掗睘'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('141991941')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9180463')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3640897')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9180463')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('832')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('23559')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~115)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('96')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('76')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('204')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('35')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('50176')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('14336')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('420')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('524288')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1933312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('13762560')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('71')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4126670848')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('91')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~19)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~103)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('59392')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('320')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('49')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('01')")[::-1])))()]))())
        if 跣伖绵伖貈跣窵窵伖跣跣绵伖绵跣貈窵.args[0] == 3:
            貈跣跣窵貈貈跣貈芏伖绵跣窵芏绵绵窵 = 157568013104512
        if 跣伖绵伖貈跣窵窵伖跣跣绵伖绵跣貈窵.args[0] == 4:
            窵绵跣绵貈跣伖伖伖貈伖跣跣绵芏芏貈 = 271796920060254
绵窵跣绵芏窵窵芏跣伖伖伖伖伖貈貈伖 = 0
while 绵窵跣绵芏窵窵芏跣伖伖伖伖伖貈貈伖 != 2:
    绵窵跣绵芏窵窵芏跣伖伖伖伖伖貈貈伖 += 1
    try:
        raise VELIMATIX(绵窵跣绵芏窵窵芏跣伖伖伖伖伖貈貈伖)
    except VELIMATIX as 窵伖芏芏绵绵窵窵跣伖跣跣跣窵绵跣芏:
        if 窵伖芏芏绵绵窵窵跣伖跣跣跣窵绵跣芏.args[0] == 3:
            貈貈伖窵芏窵芏窵芏跣貈绵貈窵跣貈伖 = 210363649941048
        if 窵伖芏芏绵绵窵窵跣伖跣跣跣窵绵跣芏.args[0] == 4:
            绵伖绵绵伖貈芏窵芏窵绵窵绵窵跣绵貈 = 166782933215321
        if 窵伖芏芏绵绵窵窵跣伖跣跣跣窵绵跣芏.args[0] == 1:
            烇圼欧儋挸皓()['尔砊嶛撲暰葹'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('143882037')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3829863')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3689283)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3689237)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('431646111')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3829863')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3440640')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~47)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1620')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~253)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('125')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('843776')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1048576')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~15)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~97)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('119')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('117795')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('127')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('47')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('146')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~69)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('32')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('99')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('224')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('106')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~33)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~119)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('105')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7872')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~117)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('64')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~105)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7907')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~1)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~113)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('65536')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('11')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('28311552')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7893)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('51')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('57')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))()]))())
窵窵貈芏伖伖跣伖芏貈绵芏跣跣绵貈绵 = 0
while 窵窵貈芏伖伖跣伖芏貈绵芏跣跣绵貈绵 != 2:
    窵窵貈芏伖伖跣伖芏貈绵芏跣跣绵貈绵 += 1
    try:
        raise VELIMATIX(窵窵貈芏伖伖跣伖芏貈绵芏跣跣绵貈绵)
    except VELIMATIX as 芏窵芏貈伖芏貈伖芏芏绵伖绵跣伖跣貈:
        if 芏窵芏貈伖芏貈伖芏芏绵伖绵跣伖跣貈.args[0] == 3:
            貈窵窵跣窵芏貈芏绵跣貈绵貈窵跣貈貈 = 268134764140906
        if 芏窵芏貈伖芏貈伖芏芏绵伖绵跣伖跣貈.args[0] == 1:
            烇圼欧儋挸皓()[(lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6940397')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2173096')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6903712)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6895777)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('216272585824')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2173096')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6903712)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~6933769)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6941142')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2173096')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('262658626752')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2173096')")[::-1])))()]))()] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898895)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('821610360')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0298989')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9906809')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0298989')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9898952')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0298989')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898948)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898520)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('9906827')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0298989')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898950)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898959)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898898)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('316765440')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('0298989')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898920)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~9898895)'))))()]))())
绵伖貈貈跣跣跣窵绵跣貈貈伖伖窵伖跣 = 0
while 绵伖貈貈跣跣跣窵绵跣貈貈伖伖窵伖跣 != 2:
    绵伖貈貈跣跣跣窵绵跣貈貈伖伖窵伖跣 += 1
    try:
        raise VELIMATIX(绵伖貈貈跣跣跣窵绵跣貈貈伖伖窵伖跣)
    except VELIMATIX as 绵芏窵伖貈绵貈伖绵绵绵窵跣窵貈绵伖:
        if 绵芏窵伖貈绵貈伖绵绵绵窵跣窵貈绵伖.args[0] == 1:
            烇圼欧儋挸皓()['袤鴁扌蔹哊橉'[::-1]] = 援腷葠典爕歡(')7_2_3_7_8_7_6_7_6_6-(+7_2_4_7_8_7_6_7_6_6'[::-1])
        if 绵芏窵伖貈绵貈伖绵绵绵窵跣窵貈绵伖.args[0] == 3:
            伖貈伖伖跣伖跣芏窵芏跣窵芏芏伖窵跣 = 280078684164614
        if 绵芏窵伖貈绵貈伖绵绵绵窵跣窵貈绵伖.args[0] == 4:
            伖芏芏貈窵伖芏芏跣芏芏跣跣绵窵貈窵 = 257761482913795
貈跣貈芏芏貈伖芏跣伖伖芏芏伖跣绵芏 = 0
while 貈跣貈芏芏貈伖芏跣伖伖芏芏伖跣绵芏 != 2:
    貈跣貈芏芏貈伖芏跣伖伖芏芏伖跣绵芏 += 1
    try:
        raise VELIMATIX(貈跣貈芏芏貈伖芏跣伖伖芏芏伖跣绵芏)
    except VELIMATIX as 跣绵貈貈伖绵跣芏芏窵貈伖跣跣窵芏貈:
        if 跣绵貈貈伖绵跣芏芏窵貈伖跣跣窵芏貈.args[0] == 3:
            绵伖芏伖芏伖跣貈伖伖跣窵跣芏伖窵绵 = 81172970757874
        if 跣绵貈貈伖绵跣芏芏窵貈伖跣跣窵芏貈.args[0] == 4:
            绵伖跣窵窵芏窵伖貈伖跣跣绵伖窵伖窵 = 37044916614038
        if 跣绵貈貈伖绵跣芏芏窵貈伖跣跣窵芏貈.args[0] == 5:
            伖貈跣伖伖窵貈貈绵芏跣芏芏绵跣绵跣 = 211129472456084
        if 跣绵貈貈伖绵跣芏芏窵貈伖跣跣窵芏貈.args[0] == 1:
            烇圼欧儋挸皓()['鈓裇當绷潃埁'[::-1]] = 援腷葠典爕歡((lambda: 猡皙杋玅祧繱([(lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('78')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('87')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1680')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('36')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~4)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~104)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('968')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('114')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('107')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('128')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1802240')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('41')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~14)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~102)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('62824')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('115')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('345')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('7892')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('3')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~3)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~35)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('442368')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('5184')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31628')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('112')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('421888')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~12)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~44)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('27262976')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~7921)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~98)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('576')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1728')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('4')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('31516')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('34')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~42)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('118')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('15778')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~2)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~107)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('64')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('2')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('1118208')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('397312')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('384')")) // 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('61')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('60')")) - 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('21')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('12582912')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1])))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~59)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~51)'))))(), (lambda: 瀧顲恣咀傳趆(姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~18)')) ^ 姌叿裯秞翧隨(援腷葠典爕歡('籄椟炧閆斯蓺(~53)'))))()]))())
import re
import requests
from bs4 import BeautifulSoup
import os
import sys
import hashlib
伖伖伖绵芏伖芏窵跣绵跣芏伖窵伖绵貈 = 0
while 伖伖伖绵芏伖芏窵跣绵跣芏伖窵伖绵貈 != 2:
    伖伖伖绵芏伖芏窵跣绵跣芏伖窵伖绵貈 += 1
    try:
        raise VELIMATIX(伖伖伖绵芏伖芏窵跣绵跣芏伖窵伖绵貈)
    except VELIMATIX as 绵貈貈芏绵跣芏芏跣芏伖跣伖貈窵貈绵:
        if 绵貈貈芏绵跣芏芏跣芏伖跣伖貈窵貈绵.args[0] == 1:
            USER_SESSION_FILE = 轈鱔繍拓瞑灖
        if 绵貈貈芏绵跣芏芏跣芏伖跣伖貈窵貈绵.args[0] == 3:
            窵芏跣伖绵跣芏跣窵芏芏貈貈绵芏伖绵 = 143107669669639
        if 绵貈貈芏绵跣芏芏跣芏伖跣伖貈窵貈绵.args[0] == 4:
            貈绵窵绵窵窵跣窵窵绵绵跣绵窵窵窵貈 = 176377785601940
芏貈貈窵芏貈伖貈绵伖绵貈芏伖跣伖跣 = 0
while 芏貈貈窵芏貈伖貈绵伖绵貈芏伖跣伖跣 != 2:
    芏貈貈窵芏貈伖貈绵伖绵貈芏伖跣伖跣 += 1
    try:
        raise VELIMATIX(芏貈貈窵芏貈伖貈绵伖绵貈芏伖跣伖跣)
    except VELIMATIX as 伖貈跣绵芏芏貈跣貈芏窵貈伖芏芏跣绵:
        if 伖貈跣绵芏芏貈跣貈芏窵貈伖芏芏跣绵.args[0] == 1:
            session = requests.Session()

def isnumeric(value):
    貈貈跣伖绵貈伖绵窵窵跣跣跣绵伖貈貈 = 0
    while 貈貈跣伖绵貈伖绵窵窵跣跣跣绵伖貈貈 != 2:
        貈貈跣伖绵貈伖绵窵窵跣跣跣绵伖貈貈 += 1
        try:
            raise VELIMATIX(貈貈跣伖绵貈伖绵窵窵跣跣跣绵伖貈貈)
        except VELIMATIX as 跣窵芏绵芏貈绵绵跣窵绵貈伖跣伖绵芏:
            if 跣窵芏绵芏貈绵绵跣窵绵貈伖跣伖绵芏.args[0] == 3:
                伖绵跣貈绵芏绵绵跣跣芏貈貈貈芏貈绵 = 202501283101521
            if 跣窵芏绵芏貈绵绵跣窵绵貈伖跣伖绵芏.args[0] == 4:
                芏窵窵跣窵貈窵跣貈绵窵貈芏窵芏貈绵 = 194297111126868
            if 跣窵芏绵芏貈绵绵跣窵绵貈伖跣伖绵芏.args[0] == 1:
                try:
                    return 籄椟炧閆斯蓺(value).isnumeric()
                except:
                    return 踱嗿漛妩屲鯁

def check_login(cookie, 伖伖伖芏伖芏貈伖芏绵伖伖伖伖绵貈芏):
    绵绵绵貈绵窵芏跣绵芏伖芏绵绵绵伖窵 = 0
    while 绵绵绵貈绵窵芏跣绵芏伖芏绵绵绵伖窵 != 4:
        绵绵绵貈绵窵芏跣绵芏伖芏绵绵绵伖窵 += 1
        try:
            raise VELIMATIX(绵绵绵貈绵窵芏跣绵芏伖芏绵绵绵伖窵)
        except VELIMATIX as 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵:
            if 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵.args[0] == 1:
                if (lambda 窵跣跣窵芏伖绵跣跣貈伖跣貈芏跣芏跣: 窵跣跣窵芏伖绵跣跣貈伖跣貈芏跣芏跣 - (lambda: 5371 ^ 5374)() - (lambda: 3009 ^ 3016)() - (lambda: 2601 ^ 2604)())(伖伖伖芏伖芏貈伖芏绵伖伖伖伖绵貈芏):
                    headers = {皖豠摺颅坑沞: 鍬夽絴譈芠围, 崃崾倂騱巒縉: 浉挛礦黇鬦薖, 鶦蕠迉捈臕麎: 庢啭郔悴孻坜, 甝鋦乻桕扠唵: 娟罧硾忢汅杗, 靬飮掊施蔓膋: 頪嗷逘铸炢眷, 箚巇潰塤栞伿: 佟蹣傞蕽煦绺, 鹼霠圁猴灲櫲: 彵詭眑湍雌挾, 暨鉆陚竽澑鴸: 疊牷喚吋袈耪, 耦癪鿖孕殸綃: cookie}
                else:
                    headers = ["籄椟炧閆斯蓺('40')", 援腷葠典爕歡("籄椟炧閆斯蓺('96')"), 援腷葠典爕歡('籄椟炧閆斯蓺(~7844)'), 援腷葠典爕歡('籄椟炧閆斯蓺(~15)'), "籄椟炧閆斯蓺('3')", 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6400')")) >> 姌叿裯秞翧隨(援腷葠典爕歡("籄椟炧閆斯蓺('6')")[::-1])]
            if 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵.args[0] == 3:
                if 戓棺忾弧滢關 in response:
                    return (吴琤誗烃蔓薋, None, None)
                elif 檐捪釽盂憠蕷 in response:
                    return (屰师堆禮鎂闙, cookie, response)
                else:
                    return (羈嬷囗赖雅談, None, None)
            if 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵.args[0] == 5:
                貈貈貈绵貈貈伖伖貈伖芏貈貈伖芏绵窵 = 129838821791595
            if 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵.args[0] == 6:
                跣窵芏窵芏芏跣跣绵跣貈貈芏伖窵芏窵 = 2080149486453
            if 窵芏窵窵伖伖窵跣伖绵伖貈伖伖绵伖绵.args[0] == 2:
                response = session.get(邬帰嘒霐桹礜, headers=headers).text

def get_info(html):
    跣跣绵跣跣跣绵绵窵跣窵窵绵芏绵芏芏 = 0
    while 跣跣绵跣跣跣绵绵窵跣窵窵绵芏绵芏芏 != 5:
        跣跣绵跣跣跣绵绵窵跣窵窵绵芏绵芏芏 += 1
        try:
            raise VELIMATIX(跣跣绵跣跣跣绵绵窵跣窵窵绵芏绵芏芏)
        except VELIMATIX as 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵:
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 6:
                窵貈绵伖窵绵绵绵窵跣伖绵跣伖芏芏窵 = 64370729988886
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 7:
                跣伖绵伖芏芏芏绵貈绵窵绵芏窵貈跣跣 = 152520017957072
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 8:
                窵貈跣伖貈窵绵貈窵芏芏伖芏窵伖窵窵 = 152664144910094
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 3:
                if username_element:
                    username_parts = username_element.text.split(璁疛惬畍墹蟙)
                    username = username_parts[椎鸭栰髪繗皓].strip()
                    amount = username_parts[絴鞚熱蒫诘璂].strip() if 鬰謈碐糢锠釢(username_parts) > 埐鐔冋甝驭芆 else 厥蜓橌閲糪晷
                else:
                    username = 嫬段钋蛦泌糏
                    amount = 撂桗藠葑瀕怺
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 2:
                username_element = soup.find(嵤塈誥柮諘匓, class_=漟鍼蠛锋皡媳)
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 1:
                soup = BeautifulSoup(html, 蕌嬯幠睰奥疛)
            if 跣跣跣芏伖绵貈芏绵跣芏窵跣芏伖芏窵.args[0] == 4:
                return (username, amount)

def buy_like(cookie, id_post, amount):
    貈跣貈跣貈绵跣芏芏窵跣窵貈芏貈貈跣 = 0
    while 貈跣貈跣貈绵跣芏芏窵跣窵貈芏貈貈跣 != 5:
        貈跣貈跣貈绵跣芏芏窵跣窵貈芏貈貈跣 += 1
        try:
            raise VELIMATIX(貈跣貈跣貈绵跣芏芏窵跣窵貈芏貈貈跣)
        except VELIMATIX as 跣绵芏伖芏芏貈跣伖窵伖芏跣绵绵貈貈:
            if 跣绵芏伖芏芏貈跣伖窵伖芏跣绵绵貈貈.args[0] == 4:
                return response.text
            if 跣绵芏伖芏芏貈跣伖窵伖芏跣绵绵貈貈.args[0] == 2:
                payload = {彥蒬箵嫣弆隻: id_post, 蟌睢粇袺呇踲: 髛罧贲擫诠軇, 接鞔恕絭嵠岅: 姌叿裯秞翧隨(amount), 勚愪煛塣隀曪: 鍀楁湾镉梣蝶}
            if 跣绵芏伖芏芏貈跣伖窵伖芏跣绵绵貈貈.args[0] == 3:
                response = session.post(闣玡楞鉕袀诚, headers=headers, data=payload)
            if 跣绵芏伖芏芏貈跣伖窵伖芏跣绵绵貈貈.args[0] == 1:
                headers = {溸浠痱窗韩墉: 袹筊芥駃箉鿒, 餷咒竐隖噇煑: 繦妇罣鏜牣淅, 僀碅訸嘽扩祐: 瀌点碜刢繺稧, 髎濶娢旈攢菫: 勜焑倖嶨袛抅, 彴辞韏鑓伨螨: 綞戠鶹淇爁婽, 誽枢珧壢嶀馑: 滁扦藆篷穲挚, 灬呓齞皚舷焅: 鑫蕿穦埙咞凅, 烁揗忏愙箣蓿: 铆私艵恱苑滽, 凪濊牏腮熺釜: 褄酎慘朂秓籷, 魨尌藠琂曇颺: 謳逝炒泀螯孙, 轊唡滬盱劼晢: 簎鸩壢鸚掛診, 秭傟氛粔韏韥: 恊鶋主譵謼亱, 亊酮鹬侲搜椪: 瘧冮棅戟烶嬭, 渽跙晎磬咢涗: cookie}

def get_response(html, 绵绵绵伖貈跣貈貈窵伖貈跣窵绵跣窵貈):
    跣窵芏貈窵绵绵绵芏跣跣绵窵绵貈貈伖 = 0
    while 跣窵芏貈窵绵绵绵芏跣跣绵窵绵貈貈伖 != 6:
        跣窵芏貈窵绵绵绵芏跣跣绵窵绵貈貈伖 += 1
        try:
            raise VELIMATIX(跣窵芏貈窵绵绵绵芏跣跣绵窵绵貈貈伖)
        except VELIMATIX as 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣:
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 4:
                pattern = 隍兑衬轚閇觷
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 5:
                try:
                    match = re.search(pattern, js_code)
                    message = match.group(綑禗妜詗雦洂)
                    return message
                except 娌雜郸唼紶叺:
                    return 穦偓凵鉪龾殕
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 2:
                if (lambda 窵伖绵芏跣绵伖芏窵貈芏窵跣窵窵伖伖: 窵伖绵芏跣绵伖芏窵貈芏窵跣窵窵伖伖 - (lambda: 4094 ^ 4051)())(绵绵绵伖貈跣貈貈窵伖貈跣窵绵跣窵貈):
                    script_tag = soup.find(懖紩懚瑾夞葋, type=殧鉟圛誫疊瑒)
                else:
                    script_tag = 援腷葠典爕歡("籄椟炧閆斯蓺('81')")[::-1]
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 3:
                js_code = script_tag.text if script_tag else 偀罞借珻鹭儗
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 7:
                绵貈芏芏貈芏芏伖芏跣伖伖窵貈芏貈窵 = 274518103879890
            if 貈貈芏芏窵芏绵跣跣绵跣窵貈芏绵貈跣.args[0] == 1:
                soup = BeautifulSoup(html, 噻坞櫾掿恮鬜)

def load_user_sessions():
    跣伖伖窵窵绵貈芏窵伖跣窵绵绵绵芏绵 = 0
    while 跣伖伖窵窵绵貈芏窵伖跣窵绵绵绵芏绵 != 3:
        跣伖伖窵窵绵貈芏窵伖跣窵绵绵绵芏绵 += 1
        try:
            raise VELIMATIX(跣伖伖窵窵绵貈芏窵伖跣窵绵绵绵芏绵)
        except VELIMATIX as 跣绵芏伖绵貈芏芏绵跣跣绵伖跣伖绵跣:
            if 跣绵芏伖绵貈芏芏绵跣跣绵伖跣伖绵跣.args[0] == 2:
                return __builtins__.__dict__['set']()
            if 跣绵芏伖绵貈芏芏绵跣跣绵伖跣伖绵跣.args[0] == 1:
                if os.path.exists(USER_SESSION_FILE):
                    with 諠鮞璈洋斗裹(USER_SESSION_FILE, 哑癧鹒撨狠宇) as file:
                        return __builtins__.__dict__['set']((line.strip() for line in file.readlines()))

def save_user_session(session_hash):
    伖窵跣绵伖绵芏绵芏芏跣貈伖跣芏伖绵 = 0
    while 伖窵跣绵伖绵芏绵芏芏跣貈伖跣芏伖绵 != 2:
        伖窵跣绵伖绵芏绵芏芏跣貈伖跣芏伖绵 += 1
        try:
            raise VELIMATIX(伖窵跣绵伖绵芏绵芏芏跣貈伖跣芏伖绵)
        except VELIMATIX as 窵伖貈窵貈芏窵芏窵绵窵跣貈窵芏伖跣:
            if 窵伖貈窵貈芏窵芏窵绵窵跣貈窵芏伖跣.args[0] == 3:
                芏跣跣貈貈芏跣伖跣跣伖跣窵跣绵窵貈 = 156202556325776
            if 窵伖貈窵貈芏窵芏窵绵窵跣貈窵芏伖跣.args[0] == 4:
                貈芏窵绵伖绵绵伖跣貈芏芏窵貈貈绵伖 = 214077142042479
            if 窵伖貈窵貈芏窵芏窵绵窵跣貈窵芏伖跣.args[0] == 1:
                with 諠鮞璈洋斗裹(USER_SESSION_FILE, 竗殖薊鎠鋦皓) as file:
                    file.write(罐撏噱埈藮甒.format(session_hash, 瓞尩嫼箤蠜擟))

def hash_cookie(cookie):
    貈跣绵跣跣窵芏貈绵伖跣芏伖跣绵貈芏 = 0
    while 貈跣绵跣跣窵芏貈绵伖跣芏伖跣绵貈芏 != 2:
        貈跣绵跣跣窵芏貈绵伖跣芏伖跣绵貈芏 += 1
        try:
            raise VELIMATIX(貈跣绵跣跣窵芏貈绵伖跣芏伖跣绵貈芏)
        except VELIMATIX as 伖貈伖窵跣伖绵绵绵绵芏伖窵貈芏跣芏:
            if 伖貈伖窵跣伖绵绵绵绵芏伖窵貈芏跣芏.args[0] == 1:
                return hashlib.sha256(cookie.encode()).hexdigest()
伖跣绵伖绵芏跣貈芏绵绵窵窵窵貈跣绵 = 0
while 伖跣绵伖绵芏跣貈芏绵绵窵窵窵貈跣绵 != 2:
    伖跣绵伖绵芏跣貈芏绵绵窵窵窵貈跣绵 += 1
    try:
        raise VELIMATIX(伖跣绵伖绵芏跣貈芏绵绵窵窵窵貈跣绵)
    except VELIMATIX as 芏伖芏伖窵芏窵窵貈窵窵窵貈芏貈芏貈:
        if 芏伖芏伖窵芏窵窵貈窵窵窵貈芏貈芏貈.args[0] == 3:
            伖伖貈芏貈跣绵窵芏跣窵绵伖窵窵芏貈 = 31283486761470
        if 芏伖芏伖窵芏窵窵貈窵窵窵貈芏貈芏貈.args[0] == 1:
            user_sessions = load_user_sessions()
跣绵貈芏貈窵貈跣貈绵跣芏伖窵伖跣窵 = 0
while 跣绵貈芏貈窵貈跣貈绵跣芏伖窵伖跣窵 != 2:
    跣绵貈芏貈窵貈跣貈绵跣芏伖窵伖跣窵 += 1
    try:
        raise VELIMATIX(跣绵貈芏貈窵貈跣貈绵跣芏伖窵伖跣窵)
    except VELIMATIX as 芏芏跣貈伖芏芏伖绵貈伖芏伖绵伖窵貈:
        if 芏芏跣貈伖芏芏伖绵貈伖芏伖绵伖窵貈.args[0] == 1:
            cookie = 簻阁舸阶嫜腖
        if 芏芏跣貈伖芏芏伖绵貈伖芏伖绵伖窵貈.args[0] == 3:
            跣跣跣跣芏伖芏窵伖伖窵跣跣绵窵绵伖 = 139645814243644
        if 芏芏跣貈伖芏芏伖绵貈伖芏伖绵伖窵貈.args[0] == 4:
            芏伖伖貈伖绵跣貈芏芏伖窵窵跣伖伖貈 = 142187038883431
        if 芏芏跣貈伖芏芏伖绵貈伖芏伖绵伖窵貈.args[0] == 5:
            窵伖窵芏绵伖伖窵绵窵芏窵跣窵窵跣伖 = 13307431225908
貈芏跣绵跣跣窵绵伖绵跣伖貈绵貈绵窵 = 0
while 貈芏跣绵跣跣窵绵伖绵跣伖貈绵貈绵窵 != 2:
    貈芏跣绵跣跣窵绵伖绵跣伖貈绵貈绵窵 += 1
    try:
        raise VELIMATIX(貈芏跣绵跣跣窵绵伖绵跣伖貈绵貈绵窵)
    except VELIMATIX as 跣窵窵伖跣跣绵窵芏跣绵芏绵伖窵绵芏:
        if 跣窵窵伖跣跣绵窵芏跣绵芏绵伖窵绵芏.args[0] == 3:
            芏貈绵伖跣绵芏窵芏伖窵窵貈绵绵跣跣 = 215678407514585
        if 跣窵窵伖跣跣绵窵芏跣绵芏绵伖窵绵芏.args[0] == 4:
            窵貈貈跣窵窵跣芏跣伖芏绵跣貈貈伖芏 = 84394736935575
        if 跣窵窵伖跣跣绵窵芏跣绵芏绵伖窵绵芏.args[0] == 1:
            cookie_hash = hash_cookie(cookie)
if cookie_hash in user_sessions:
    跣绵貈窵窵芏跣貈跣芏芏绵芏绵芏窵伖 = 0
    while 跣绵貈窵窵芏跣貈跣芏芏绵芏绵芏窵伖 != 3:
        跣绵貈窵窵芏跣貈跣芏芏绵芏绵芏窵伖 += 1
        try:
            raise VELIMATIX(跣绵貈窵窵芏跣貈跣芏芏绵芏绵芏窵伖)
        except VELIMATIX as 伖绵芏貈芏窵窵芏芏伖绵貈伖跣伖跣窵:
            if 伖绵芏貈芏窵窵芏芏伖绵貈伖跣伖跣窵.args[0] == 1:
                粙宅狸锼潤站(豴夗佂鐐攇顽)
            if 伖绵芏貈芏窵窵芏芏伖绵貈伖跣伖跣窵.args[0] == 2:
                葥枏凟汛眣琲()
            if 伖绵芏貈芏窵窵芏芏伖绵貈伖跣伖跣窵.args[0] == 4:
                窵窵貈芏窵绵跣绵窵貈窵绵绵窵伖伖伖 = 220953252007997
            if 伖绵芏貈芏窵窵芏芏伖绵貈伖跣伖跣窵.args[0] == 5:
                窵伖伖貈窵绵伖绵貈绵窵绵跣绵跣伖跣 = 236044427920544
窵跣伖绵绵绵窵窵貈绵绵跣貈绵窵伖伖 = 0
while 窵跣伖绵绵绵窵窵貈绵绵跣貈绵窵伖伖 != 2:
    窵跣伖绵绵绵窵窵貈绵绵跣貈绵窵伖伖 += 1
    try:
        raise VELIMATIX(窵跣伖绵绵绵窵窵貈绵绵跣貈绵窵伖伖)
    except VELIMATIX as 绵芏绵芏芏芏伖窵绵窵貈芏伖窵芏跣貈:
        if 绵芏绵芏芏芏伖窵绵窵貈芏伖窵芏跣貈.args[0] == 1:
            status, cookie, content = check_login(cookie, 20)
if not status:
    貈貈芏芏窵伖跣窵窵伖伖貈芏伖跣芏芏 = 0
    while 貈貈芏芏窵伖跣窵窵伖伖貈芏伖跣芏芏 != 3:
        貈貈芏芏窵伖跣窵窵伖伖貈芏伖跣芏芏 += 1
        try:
            raise VELIMATIX(貈貈芏芏窵伖跣窵窵伖伖貈芏伖跣芏芏)
        except VELIMATIX as 跣绵貈伖貈绵貈芏貈芏窵伖伖伖绵绵貈:
            if 跣绵貈伖貈绵貈芏貈芏窵伖伖伖绵绵貈.args[0] == 4:
                芏窵绵窵伖貈窵芏绵跣跣绵伖貈绵绵窵 = 168390189339312
            if 跣绵貈伖貈绵貈芏貈芏窵伖伖伖绵绵貈.args[0] == 1:
                粙宅狸锼潤站(賈瞸微坱绽趸)
            if 跣绵貈伖貈绵貈芏貈芏窵伖伖伖绵绵貈.args[0] == 2:
                葥枏凟汛眣琲()
窵窵绵跣伖貈跣貈芏伖芏跣貈伖芏窵伖 = 0
while 窵窵绵跣伖貈跣貈芏伖芏跣貈伖芏窵伖 != 2:
    窵窵绵跣伖貈跣貈芏伖芏跣貈伖芏窵伖 += 1
    try:
        raise VELIMATIX(窵窵绵跣伖貈跣貈芏伖芏跣貈伖芏窵伖)
    except VELIMATIX as 窵貈绵绵芏窵伖窵跣窵绵貈芏芏貈绵芏:
        if 窵貈绵绵芏窵伖窵跣窵绵貈芏芏貈绵芏.args[0] == 1:
            username, amount = get_info(content)
粙宅狸锼潤站(礘万拨颜喉馏)
粙宅狸锼潤站(肳児顩靝鈑嚝)
貈芏芏貈貈芏芏跣芏貈窵貈跣绵窵绵貈 = 0
while 貈芏芏貈貈芏芏跣芏貈窵貈跣绵窵绵貈 != 2:
    貈芏芏貈貈芏芏跣芏貈窵貈跣绵窵绵貈 += 1
    try:
        raise VELIMATIX(貈芏芏貈貈芏芏跣芏貈窵貈跣绵窵绵貈)
    except VELIMATIX as 跣芏窵芏窵绵芏绵跣伖绵芏伖伖伖貈伖:
        if 跣芏窵芏窵绵芏绵跣伖绵芏伖伖伖貈伖.args[0] == 1:
            id_post = 碧暋続絰啴鱿(睘掗邲擫脄騂)
if not isnumeric(id_post):
    绵跣芏芏跣绵芏跣貈芏绵伖芏跣貈芏跣 = 0
    while 绵跣芏芏跣绵芏跣貈芏绵伖芏跣貈芏跣 != 3:
        绵跣芏芏跣绵芏跣貈芏绵伖芏跣貈芏跣 += 1
        try:
            raise VELIMATIX(绵跣芏芏跣绵芏跣貈芏绵伖芏跣貈芏跣)
        except VELIMATIX as 伖窵芏窵伖绵跣绵跣窵貈芏绵绵貈貈跣:
            if 伖窵芏窵伖绵跣绵跣窵貈芏绵绵貈貈跣.args[0] == 2:
                葥枏凟汛眣琲()
            if 伖窵芏窵伖绵跣绵跣窵貈芏绵绵貈貈跣.args[0] == 1:
                粙宅狸锼潤站(葹暰撲嶛砊尔)
伖跣伖跣伖貈伖跣伖跣绵伖伖窵貈窵跣 = 0
while 伖跣伖跣伖貈伖跣伖跣绵伖伖窵貈窵跣 != 2:
    伖跣伖跣伖貈伖跣伖跣绵伖伖窵貈窵跣 += 1
    try:
        raise VELIMATIX(伖跣伖跣伖貈伖跣伖跣绵伖伖窵貈窵跣)
    except VELIMATIX as 跣伖跣伖芏窵貈绵貈绵窵貈貈貈绵绵貈:
        if 跣伖跣伖芏窵貈绵貈绵窵貈貈貈绵绵貈.args[0] == 1:
            amount = 碧暋続絰啴鱿(轍漁穟骩鈶钞)
if not isnumeric(amount) or 姌叿裯秞翧隨(amount) > 橉哊蔹扌鴁袤:
    芏芏跣貈芏绵貈貈绵伖芏绵绵伖窵绵貈 = 0
    while 芏芏跣貈芏绵貈貈绵伖芏绵绵伖窵绵貈 != 3:
        芏芏跣貈芏绵貈貈绵伖芏绵绵伖窵绵貈 += 1
        try:
            raise VELIMATIX(芏芏跣貈芏绵貈貈绵伖芏绵绵伖窵绵貈)
        except VELIMATIX as 伖伖芏窵貈窵芏貈跣芏跣窵伖窵绵伖跣:
            if 伖伖芏窵貈窵芏貈跣芏跣窵伖窵绵伖跣.args[0] == 2:
                葥枏凟汛眣琲()
            if 伖伖芏窵貈窵芏貈跣芏跣窵伖窵绵伖跣.args[0] == 4:
                芏伖芏伖芏跣芏窵跣窵绵跣跣芏窵跣伖 = 29429732284810
            if 伖伖芏窵貈窵芏貈跣芏跣窵伖窵绵伖跣.args[0] == 5:
                窵绵伖芏窵窵芏芏跣跣跣跣芏伖芏跣绵 = 59254105459262
            if 伖伖芏窵貈窵芏貈跣芏跣窵伖窵绵伖跣.args[0] == 1:
                粙宅狸锼潤站(埁潃绷當裇鈓)
绵貈芏貈跣貈跣伖绵貈绵窵芏伖跣貈绵 = 0
while 绵貈芏貈跣貈跣伖绵貈绵窵芏伖跣貈绵 != 2:
    绵貈芏貈跣貈跣伖绵貈绵窵芏伖跣貈绵 += 1
    try:
        raise VELIMATIX(绵貈芏貈跣貈跣伖绵貈绵窵芏伖跣貈绵)
    except VELIMATIX as 伖跣跣芏貈伖跣跣窵窵绵貈跣跣伖芏芏:
        if 伖跣跣芏貈伖跣跣窵窵绵貈跣跣伖芏芏.args[0] == 3:
            伖貈貈窵貈窵芏跣绵跣窵窵伖伖伖绵绵 = 60939033303043
        if 伖跣跣芏貈伖跣跣窵窵绵貈跣跣伖芏芏.args[0] == 4:
            芏貈伖伖窵窵窵貈芏貈貈伖伖芏窵跣貈 = 142127416677977
        if 伖跣跣芏貈伖跣跣窵窵绵貈跣跣伖芏芏.args[0] == 1:
            response = buy_like(cookie, id_post, amount)
伖跣伖伖窵跣貈芏窵芏伖绵貈跣窵芏跣 = 0
while 伖跣伖伖窵跣貈芏窵芏伖绵貈跣窵芏跣 != 2:
    伖跣伖伖窵跣貈芏窵芏伖绵貈跣窵芏跣 += 1
    try:
        raise VELIMATIX(伖跣伖伖窵跣貈芏窵芏伖绵貈跣窵芏跣)
    except VELIMATIX as 窵芏貈貈绵芏窵伖伖伖伖窵窵芏貈绵伖:
        if 窵芏貈貈绵芏窵伖伖伖伖窵窵芏貈绵伖.args[0] == 1:
            response = get_response(response, 46)
粙宅狸锼潤站(response)
save_user_session(cookie_hash)